/* automatically generated by rust-bindgen 0.72.1 */

#[repr(C)]
#[derive(Copy, Clone, Debug, Default, Eq, Hash, Ord, PartialEq, PartialOrd)]
pub struct __BindgenBitfieldUnit<Storage> {
    storage: Storage,
}
impl<Storage> __BindgenBitfieldUnit<Storage> {
    #[inline]
    pub const fn new(storage: Storage) -> Self {
        Self { storage }
    }
}
impl<Storage> __BindgenBitfieldUnit<Storage>
where
    Storage: AsRef<[u8]> + AsMut<[u8]>,
{
    #[inline]
    fn extract_bit(byte: u8, index: usize) -> bool {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)
        } else {
            index % 8
        };
        let mask = 1 << bit_index;
        byte & mask == mask
    }
    #[inline]
    pub fn get_bit(&self, index: usize) -> bool {
        debug_assert!(index / 8 < self.storage.as_ref().len());
        let byte_index = index / 8;
        let byte = self.storage.as_ref()[byte_index];
        Self::extract_bit(byte, index)
    }
    #[inline]
    pub unsafe fn raw_get_bit(this: *const Self, index: usize) -> bool {
        debug_assert!(index / 8 < core::mem::size_of::<Storage>());
        let byte_index = index / 8;
        let byte = unsafe { *(core::ptr::addr_of!((*this).storage) as *const u8).offset(byte_index as isize) };
        Self::extract_bit(byte, index)
    }
    #[inline]
    fn change_bit(byte: u8, index: usize, val: bool) -> u8 {
        let bit_index = if cfg!(target_endian = "big") {
            7 - (index % 8)

pub const UINT_LEAST32_MAX: u32 = 4294967295;
pub const INT_FAST8_MIN: i32 = -128;
pub const INT_FAST16_MIN: i64 = -9223372036854775808;
pub const INT_FAST32_MIN: i64 = -9223372036854775808;
pub const INT_FAST8_MAX: u32 = 127;
pub const INT_FAST16_MAX: u64 = 9223372036854775807;
pub const INT_FAST32_MAX: u64 = 9223372036854775807;
pub const UINT_FAST8_MAX: u32 = 255;
pub const UINT_FAST16_MAX: i32 = -1;
pub const UINT_FAST32_MAX: i32 = -1;
pub const INTPTR_MIN: i64 = -9223372036854775808;
pub const INTPTR_MAX: u64 = 9223372036854775807;
pub const UINTPTR_MAX: i32 = -1;
pub const PTRDIFF_MIN: i64 = -9223372036854775808;
pub const PTRDIFF_MAX: u64 = 9223372036854775807;
pub const SIG_ATOMIC_MIN: i32 = -2147483648;
pub const SIG_ATOMIC_MAX: u32 = 2147483647;
pub const SIZE_MAX: i32 = -1;
pub const WINT_MIN: u32 = 0;
pub const WINT_MAX: u32 = 4294967295;
pub const AMDSMI_MAX_MM_IP_COUNT: u32 = 8;
pub const AMDSMI_MAX_STRING_LENGTH: u32 = 256;
pub const AMDSMI_MAX_DEVICES: u32 = 32;
pub const AMDSMI_MAX_CACHE_TYPES: u32 = 10;
pub const AMDSMI_MAX_ACCELERATOR_PROFILE: u32 = 32;
pub const AMDSMI_MAX_CP_PROFILE_RESOURCES: u32 = 32;
pub const AMDSMI_MAX_ACCELERATOR_PARTITIONS: u32 = 8;
pub const AMDSMI_MAX_NUM_NUMA_NODES: u32 = 32;
pub const AMDSMI_GPU_UUID_SIZE: u32 = 38;
pub const AMDSMI_MAX_NUM_XGMI_PHYSICAL_LINK: u32 = 64;
pub const AMDSMI_MAX_CONTAINER_TYPE: u32 = 2;
pub const CENTRIGRADE_TO_MILLI_CENTIGRADE: u32 = 1000;
pub const AMDSMI_NUM_HBM_INSTANCES: u32 = 4;
pub const AMDSMI_MAX_NUM_VCN: u32 = 4;
pub const AMDSMI_MAX_NUM_CLKS: u32 = 4;
pub const AMDSMI_MAX_NUM_XGMI_LINKS: u32 = 8;
pub const AMDSMI_MAX_NUM_GFX_CLKS: u32 = 8;
pub const AMDSMI_MAX_AID: u32 = 4;
pub const AMDSMI_MAX_ENGINES: u32 = 8;
pub const AMDSMI_MAX_NUM_JPEG: u32 = 32;
pub const AMDSMI_MAX_NUM_JPEG_ENG_V1: u32 = 40;
pub const AMDSMI_MAX_NUM_XCC: u32 = 8;
pub const AMDSMI_MAX_NUM_XCP: u32 = 8;
pub const MAX_NUMBER_OF_AFIDS_PER_RECORD: u32 = 12;
pub const AMDSMI_TIME_FORMAT: &[u8; 20] = b"%02d:%02d:%02d.%03d\0";
pub const AMDSMI_DATE_FORMAT: &[u8; 35] = b"%04d-%02d-%02d:%02d:%02d:%02d.%03d\0";
pub const AMDSMI_LIB_VERSION_MAJOR: u32 = 26;
pub const AMDSMI_LIB_VERSION_MINOR: u32 = 1;
pub const AMDSMI_LIB_VERSION_RELEASE: u32 = 0;
pub const AMDSMI_MAX_NUM_FREQUENCIES: u32 = 33;
pub const AMDSMI_MAX_FAN_SPEED: u32 = 255;
pub const AMDSMI_NUM_VOLTAGE_CURVE_POINTS: u32 = 3;
pub const AMDSMI_MAX_UTILIZATION_VALUES: u32 = 4;
pub const AMDSMI_MAX_NUM_PM_POLICIES: u32 = 32;
pub const amd_smi_VERSION_MAJOR: u32 = 0;
pub const amd_smi_VERSION_MINOR: u32 = 0;
pub const amd_smi_VERSION_PATCH: u32 = 0;
pub const amd_smi_VERSION_BUILD: &[u8; 2] = b"0\0";
pub type wchar_t = ::std::os::raw::c_int;
pub type _Float32 = f32;
pub type _Float64 = f64;
pub type _Float32x = f64;
pub type _Float64x = u128;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct div_t {
    pub quot: ::std::os::raw::c_int,
    pub rem: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of div_t"][::std::mem::size_of::<div_t>() - 8usize];
    ["Alignment of div_t"][::std::mem::align_of::<div_t>() - 4usize];
    ["Offset of field: div_t::quot"][::std::mem::offset_of!(div_t, quot) - 0usize];
    ["Offset of field: div_t::rem"][::std::mem::offset_of!(div_t, rem) - 4usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct ldiv_t {
    pub quot: ::std::os::raw::c_long,
    pub rem: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of ldiv_t"][::std::mem::size_of::<ldiv_t>() - 16usize];
    ["Alignment of ldiv_t"][::std::mem::align_of::<ldiv_t>() - 8usize];
    ["Offset of field: ldiv_t::quot"][::std::mem::offset_of!(ldiv_t, quot) - 0usize];
    ["Offset of field: ldiv_t::rem"][::std::mem::offset_of!(ldiv_t, rem) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct lldiv_t {
    pub quot: ::std::os::raw::c_longlong,
    pub rem: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of lldiv_t"][::std::mem::size_of::<lldiv_t>() - 16usize];
    ["Alignment of lldiv_t"][::std::mem::align_of::<lldiv_t>() - 8usize];
    ["Offset of field: lldiv_t::quot"][::std::mem::offset_of!(lldiv_t, quot) - 0usize];
    ["Offset of field: lldiv_t::rem"][::std::mem::offset_of!(lldiv_t, rem) - 8usize];
};
pub type __u_char = ::std::os::raw::c_uchar;
pub type __u_short = ::std::os::raw::c_ushort;
pub type __u_int = ::std::os::raw::c_uint;
pub type __u_long = ::std::os::raw::c_ulong;
pub type __int8_t = ::std::os::raw::c_schar;
pub type __uint8_t = ::std::os::raw::c_uchar;
pub type __int16_t = ::std::os::raw::c_short;
pub type __uint16_t = ::std::os::raw::c_ushort;
pub type __int32_t = ::std::os::raw::c_int;
pub type __uint32_t = ::std::os::raw::c_uint;
pub type __int64_t = ::std::os::raw::c_long;
pub type __uint64_t = ::std::os::raw::c_ulong;
pub type __int_least8_t = __int8_t;
pub type __uint_least8_t = __uint8_t;
pub type __int_least16_t = __int16_t;
pub type __uint_least16_t = __uint16_t;
pub type __int_least32_t = __int32_t;
pub type __uint_least32_t = __uint32_t;
pub type __int_least64_t = __int64_t;
pub type __uint_least64_t = __uint64_t;
pub type __quad_t = ::std::os::raw::c_long;
pub type __u_quad_t = ::std::os::raw::c_ulong;
pub type __intmax_t = ::std::os::raw::c_long;
pub type __uintmax_t = ::std::os::raw::c_ulong;
pub type __dev_t = ::std::os::raw::c_ulong;
pub type __uid_t = ::std::os::raw::c_uint;
pub type __gid_t = ::std::os::raw::c_uint;
pub type __ino_t = ::std::os::raw::c_ulong;
pub type __ino64_t = ::std::os::raw::c_ulong;
pub type __mode_t = ::std::os::raw::c_uint;
pub type __nlink_t = ::std::os::raw::c_ulong;
pub type __off_t = ::std::os::raw::c_long;
pub type __off64_t = ::std::os::raw::c_long;
pub type __pid_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __fsid_t {
    pub __val: [::std::os::raw::c_int; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __fsid_t"][::std::mem::size_of::<__fsid_t>() - 8usize];
    ["Alignment of __fsid_t"][::std::mem::align_of::<__fsid_t>() - 4usize];
    ["Offset of field: __fsid_t::__val"][::std::mem::offset_of!(__fsid_t, __val) - 0usize];
};
pub type __clock_t = ::std::os::raw::c_long;
pub type __rlim_t = ::std::os::raw::c_ulong;
pub type __rlim64_t = ::std::os::raw::c_ulong;
pub type __id_t = ::std::os::raw::c_uint;
pub type __time_t = ::std::os::raw::c_long;
pub type __useconds_t = ::std::os::raw::c_uint;
pub type __suseconds_t = ::std::os::raw::c_long;
pub type __suseconds64_t = ::std::os::raw::c_long;
pub type __daddr_t = ::std::os::raw::c_int;
pub type __key_t = ::std::os::raw::c_int;
pub type __clockid_t = ::std::os::raw::c_int;
pub type __timer_t = *mut ::std::os::raw::c_void;
pub type __blksize_t = ::std::os::raw::c_long;
pub type __blkcnt_t = ::std::os::raw::c_long;
pub type __blkcnt64_t = ::std::os::raw::c_long;
pub type __fsblkcnt_t = ::std::os::raw::c_ulong;
pub type __fsblkcnt64_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt_t = ::std::os::raw::c_ulong;
pub type __fsfilcnt64_t = ::std::os::raw::c_ulong;
pub type __fsword_t = ::std::os::raw::c_long;
pub type __ssize_t = ::std::os::raw::c_long;
pub type __syscall_slong_t = ::std::os::raw::c_long;
pub type __syscall_ulong_t = ::std::os::raw::c_ulong;
pub type __loff_t = __off64_t;
pub type __caddr_t = *mut ::std::os::raw::c_char;
pub type __intptr_t = ::std::os::raw::c_long;
pub type __socklen_t = ::std::os::raw::c_uint;
pub type __sig_atomic_t = ::std::os::raw::c_int;
pub type u_char = __u_char;
pub type u_short = __u_short;
pub type u_int = __u_int;
pub type u_long = __u_long;
pub type quad_t = __quad_t;
pub type u_quad_t = __u_quad_t;
pub type fsid_t = __fsid_t;
pub type loff_t = __loff_t;
pub type ino_t = __ino_t;
pub type dev_t = __dev_t;
pub type gid_t = __gid_t;
pub type mode_t = __mode_t;
pub type nlink_t = __nlink_t;
pub type uid_t = __uid_t;
pub type off_t = __off_t;
pub type pid_t = __pid_t;
pub type id_t = __id_t;
pub type daddr_t = __daddr_t;
pub type caddr_t = __caddr_t;
pub type key_t = __key_t;
pub type clock_t = __clock_t;
pub type clockid_t = __clockid_t;
pub type time_t = __time_t;
pub type timer_t = __timer_t;
pub type ulong = ::std::os::raw::c_ulong;
pub type ushort = ::std::os::raw::c_ushort;
pub type uint = ::std::os::raw::c_uint;
pub type u_int8_t = __uint8_t;
pub type u_int16_t = __uint16_t;
pub type u_int32_t = __uint32_t;
pub type u_int64_t = __uint64_t;
pub type register_t = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __sigset_t {
    pub __val: [::std::os::raw::c_ulong; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __sigset_t"][::std::mem::size_of::<__sigset_t>() - 128usize];
    ["Alignment of __sigset_t"][::std::mem::align_of::<__sigset_t>() - 8usize];
    ["Offset of field: __sigset_t::__val"][::std::mem::offset_of!(__sigset_t, __val) - 0usize];
};
pub type sigset_t = __sigset_t;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timeval {
    pub tv_sec: __time_t,
    pub tv_usec: __suseconds_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timeval"][::std::mem::size_of::<timeval>() - 16usize];
    ["Alignment of timeval"][::std::mem::align_of::<timeval>() - 8usize];
    ["Offset of field: timeval::tv_sec"][::std::mem::offset_of!(timeval, tv_sec) - 0usize];
    ["Offset of field: timeval::tv_usec"][::std::mem::offset_of!(timeval, tv_usec) - 8usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct timespec {
    pub tv_sec: __time_t,
    pub tv_nsec: __syscall_slong_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of timespec"][::std::mem::size_of::<timespec>() - 16usize];
    ["Alignment of timespec"][::std::mem::align_of::<timespec>() - 8usize];
    ["Offset of field: timespec::tv_sec"][::std::mem::offset_of!(timespec, tv_sec) - 0usize];
    ["Offset of field: timespec::tv_nsec"][::std::mem::offset_of!(timespec, tv_nsec) - 8usize];
};
pub type suseconds_t = __suseconds_t;
pub type __fd_mask = ::std::os::raw::c_long;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct fd_set {
    pub __fds_bits: [__fd_mask; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of fd_set"][::std::mem::size_of::<fd_set>() - 128usize];
    ["Alignment of fd_set"][::std::mem::align_of::<fd_set>() - 8usize];
    ["Offset of field: fd_set::__fds_bits"][::std::mem::offset_of!(fd_set, __fds_bits) - 0usize];
};
pub type fd_mask = __fd_mask;
pub type blksize_t = __blksize_t;
pub type blkcnt_t = __blkcnt_t;
pub type fsblkcnt_t = __fsblkcnt_t;
pub type fsfilcnt_t = __fsfilcnt_t;
#[repr(C)]
#[derive(Copy, Clone)]
pub union __atomic_wide_counter {
    pub __value64: ::std::os::raw::c_ulonglong,
    pub __value32: __atomic_wide_counter__bindgen_ty_1,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __atomic_wide_counter__bindgen_ty_1 {
    pub __low: ::std::os::raw::c_uint,
    pub __high: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::size_of::<__atomic_wide_counter__bindgen_ty_1>() - 8usize];
    ["Alignment of __atomic_wide_counter__bindgen_ty_1"]
        [::std::mem::align_of::<__atomic_wide_counter__bindgen_ty_1>() - 4usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__low"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __low) - 0usize];
    ["Offset of field: __atomic_wide_counter__bindgen_ty_1::__high"]
        [::std::mem::offset_of!(__atomic_wide_counter__bindgen_ty_1, __high) - 4usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __atomic_wide_counter"][::std::mem::size_of::<__atomic_wide_counter>() - 8usize];
    ["Alignment of __atomic_wide_counter"][::std::mem::align_of::<__atomic_wide_counter>() - 8usize];
    ["Offset of field: __atomic_wide_counter::__value64"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value64) - 0usize];
    ["Offset of field: __atomic_wide_counter::__value32"]
        [::std::mem::offset_of!(__atomic_wide_counter, __value32) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_list {
    pub __prev: *mut __pthread_internal_list,
    pub __next: *mut __pthread_internal_list,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_list"][::std::mem::size_of::<__pthread_internal_list>() - 16usize];
    ["Alignment of __pthread_internal_list"][::std::mem::align_of::<__pthread_internal_list>() - 8usize];
    ["Offset of field: __pthread_internal_list::__prev"]
        [::std::mem::offset_of!(__pthread_internal_list, __prev) - 0usize];
    ["Offset of field: __pthread_internal_list::__next"]
        [::std::mem::offset_of!(__pthread_internal_list, __next) - 8usize];
};
pub type __pthread_list_t = __pthread_internal_list;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_internal_slist {
    pub __next: *mut __pthread_internal_slist,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_internal_slist"][::std::mem::size_of::<__pthread_internal_slist>() - 8usize];
    ["Alignment of __pthread_internal_slist"][::std::mem::align_of::<__pthread_internal_slist>() - 8usize];
    ["Offset of field: __pthread_internal_slist::__next"]
        [::std::mem::offset_of!(__pthread_internal_slist, __next) - 0usize];
};
pub type __pthread_slist_t = __pthread_internal_slist;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_mutex_s {
    pub __lock: ::std::os::raw::c_int,
    pub __count: ::std::os::raw::c_uint,
    pub __owner: ::std::os::raw::c_int,
    pub __nusers: ::std::os::raw::c_uint,
    pub __kind: ::std::os::raw::c_int,
    pub __spins: ::std::os::raw::c_short,
    pub __elision: ::std::os::raw::c_short,
    pub __list: __pthread_list_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_mutex_s"][::std::mem::size_of::<__pthread_mutex_s>() - 40usize];
    ["Alignment of __pthread_mutex_s"][::std::mem::align_of::<__pthread_mutex_s>() - 8usize];
    ["Offset of field: __pthread_mutex_s::__lock"][::std::mem::offset_of!(__pthread_mutex_s, __lock) - 0usize];
    ["Offset of field: __pthread_mutex_s::__count"][::std::mem::offset_of!(__pthread_mutex_s, __count) - 4usize];
    ["Offset of field: __pthread_mutex_s::__owner"][::std::mem::offset_of!(__pthread_mutex_s, __owner) - 8usize];
    ["Offset of field: __pthread_mutex_s::__nusers"][::std::mem::offset_of!(__pthread_mutex_s, __nusers) - 12usize];
    ["Offset of field: __pthread_mutex_s::__kind"][::std::mem::offset_of!(__pthread_mutex_s, __kind) - 16usize];
    ["Offset of field: __pthread_mutex_s::__spins"][::std::mem::offset_of!(__pthread_mutex_s, __spins) - 20usize];
    ["Offset of field: __pthread_mutex_s::__elision"][::std::mem::offset_of!(__pthread_mutex_s, __elision) - 22usize];
    ["Offset of field: __pthread_mutex_s::__list"][::std::mem::offset_of!(__pthread_mutex_s, __list) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __pthread_rwlock_arch_t {
    pub __readers: ::std::os::raw::c_uint,
    pub __writers: ::std::os::raw::c_uint,
    pub __wrphase_futex: ::std::os::raw::c_uint,
    pub __writers_futex: ::std::os::raw::c_uint,
    pub __pad3: ::std::os::raw::c_uint,
    pub __pad4: ::std::os::raw::c_uint,
    pub __cur_writer: ::std::os::raw::c_int,
    pub __shared: ::std::os::raw::c_int,
    pub __rwelision: ::std::os::raw::c_schar,
    pub __pad1: [::std::os::raw::c_uchar; 7usize],
    pub __pad2: ::std::os::raw::c_ulong,
    pub __flags: ::std::os::raw::c_uint,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_rwlock_arch_t"][::std::mem::size_of::<__pthread_rwlock_arch_t>() - 56usize];
    ["Alignment of __pthread_rwlock_arch_t"][::std::mem::align_of::<__pthread_rwlock_arch_t>() - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__readers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __readers) - 0usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers) - 4usize];
    ["Offset of field: __pthread_rwlock_arch_t::__wrphase_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __wrphase_futex) - 8usize];
    ["Offset of field: __pthread_rwlock_arch_t::__writers_futex"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __writers_futex) - 12usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad3"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad3) - 16usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad4"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad4) - 20usize];
    ["Offset of field: __pthread_rwlock_arch_t::__cur_writer"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __cur_writer) - 24usize];
    ["Offset of field: __pthread_rwlock_arch_t::__shared"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __shared) - 28usize];
    ["Offset of field: __pthread_rwlock_arch_t::__rwelision"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __rwelision) - 32usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad1"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad1) - 33usize];
    ["Offset of field: __pthread_rwlock_arch_t::__pad2"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __pad2) - 40usize];
    ["Offset of field: __pthread_rwlock_arch_t::__flags"]
        [::std::mem::offset_of!(__pthread_rwlock_arch_t, __flags) - 48usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub struct __pthread_cond_s {
    pub __wseq: __atomic_wide_counter,
    pub __g1_start: __atomic_wide_counter,
    pub __g_refs: [::std::os::raw::c_uint; 2usize],
    pub __g_size: [::std::os::raw::c_uint; 2usize],
    pub __g1_orig_size: ::std::os::raw::c_uint,
    pub __wrefs: ::std::os::raw::c_uint,
    pub __g_signals: [::std::os::raw::c_uint; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __pthread_cond_s"][::std::mem::size_of::<__pthread_cond_s>() - 48usize];
    ["Alignment of __pthread_cond_s"][::std::mem::align_of::<__pthread_cond_s>() - 8usize];
    ["Offset of field: __pthread_cond_s::__wseq"][::std::mem::offset_of!(__pthread_cond_s, __wseq) - 0usize];
    ["Offset of field: __pthread_cond_s::__g1_start"][::std::mem::offset_of!(__pthread_cond_s, __g1_start) - 8usize];
    ["Offset of field: __pthread_cond_s::__g_refs"][::std::mem::offset_of!(__pthread_cond_s, __g_refs) - 16usize];
    ["Offset of field: __pthread_cond_s::__g_size"][::std::mem::offset_of!(__pthread_cond_s, __g_size) - 24usize];
    ["Offset of field: __pthread_cond_s::__g1_orig_size"]
        [::std::mem::offset_of!(__pthread_cond_s, __g1_orig_size) - 32usize];
    ["Offset of field: __pthread_cond_s::__wrefs"][::std::mem::offset_of!(__pthread_cond_s, __wrefs) - 36usize];
    ["Offset of field: __pthread_cond_s::__g_signals"][::std::mem::offset_of!(__pthread_cond_s, __g_signals) - 40usize];
};
pub type __tss_t = ::std::os::raw::c_uint;
pub type __thrd_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct __once_flag {
    pub __data: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of __once_flag"][::std::mem::size_of::<__once_flag>() - 4usize];
    ["Alignment of __once_flag"][::std::mem::align_of::<__once_flag>() - 4usize];
    ["Offset of field: __once_flag::__data"][::std::mem::offset_of!(__once_flag, __data) - 0usize];
};
pub type pthread_t = ::std::os::raw::c_ulong;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutexattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutexattr_t"][::std::mem::size_of::<pthread_mutexattr_t>() - 4usize];
    ["Alignment of pthread_mutexattr_t"][::std::mem::align_of::<pthread_mutexattr_t>() - 4usize];
    ["Offset of field: pthread_mutexattr_t::__size"][::std::mem::offset_of!(pthread_mutexattr_t, __size) - 0usize];
    ["Offset of field: pthread_mutexattr_t::__align"][::std::mem::offset_of!(pthread_mutexattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_condattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_condattr_t"][::std::mem::size_of::<pthread_condattr_t>() - 4usize];
    ["Alignment of pthread_condattr_t"][::std::mem::align_of::<pthread_condattr_t>() - 4usize];
    ["Offset of field: pthread_condattr_t::__size"][::std::mem::offset_of!(pthread_condattr_t, __size) - 0usize];
    ["Offset of field: pthread_condattr_t::__align"][::std::mem::offset_of!(pthread_condattr_t, __align) - 0usize];
};
pub type pthread_key_t = ::std::os::raw::c_uint;
pub type pthread_once_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_attr_t {
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_attr_t"][::std::mem::size_of::<pthread_attr_t>() - 56usize];
    ["Alignment of pthread_attr_t"][::std::mem::align_of::<pthread_attr_t>() - 8usize];
    ["Offset of field: pthread_attr_t::__size"][::std::mem::offset_of!(pthread_attr_t, __size) - 0usize];
    ["Offset of field: pthread_attr_t::__align"][::std::mem::offset_of!(pthread_attr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_mutex_t {
    pub __data: __pthread_mutex_s,
    pub __size: [::std::os::raw::c_char; 40usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_mutex_t"][::std::mem::size_of::<pthread_mutex_t>() - 40usize];
    ["Alignment of pthread_mutex_t"][::std::mem::align_of::<pthread_mutex_t>() - 8usize];
    ["Offset of field: pthread_mutex_t::__data"][::std::mem::offset_of!(pthread_mutex_t, __data) - 0usize];
    ["Offset of field: pthread_mutex_t::__size"][::std::mem::offset_of!(pthread_mutex_t, __size) - 0usize];
    ["Offset of field: pthread_mutex_t::__align"][::std::mem::offset_of!(pthread_mutex_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_cond_t {
    pub __data: __pthread_cond_s,
    pub __size: [::std::os::raw::c_char; 48usize],
    pub __align: ::std::os::raw::c_longlong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_cond_t"][::std::mem::size_of::<pthread_cond_t>() - 48usize];
    ["Alignment of pthread_cond_t"][::std::mem::align_of::<pthread_cond_t>() - 8usize];
    ["Offset of field: pthread_cond_t::__data"][::std::mem::offset_of!(pthread_cond_t, __data) - 0usize];
    ["Offset of field: pthread_cond_t::__size"][::std::mem::offset_of!(pthread_cond_t, __size) - 0usize];
    ["Offset of field: pthread_cond_t::__align"][::std::mem::offset_of!(pthread_cond_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlock_t {
    pub __data: __pthread_rwlock_arch_t,
    pub __size: [::std::os::raw::c_char; 56usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlock_t"][::std::mem::size_of::<pthread_rwlock_t>() - 56usize];
    ["Alignment of pthread_rwlock_t"][::std::mem::align_of::<pthread_rwlock_t>() - 8usize];
    ["Offset of field: pthread_rwlock_t::__data"][::std::mem::offset_of!(pthread_rwlock_t, __data) - 0usize];
    ["Offset of field: pthread_rwlock_t::__size"][::std::mem::offset_of!(pthread_rwlock_t, __size) - 0usize];
    ["Offset of field: pthread_rwlock_t::__align"][::std::mem::offset_of!(pthread_rwlock_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_rwlockattr_t {
    pub __size: [::std::os::raw::c_char; 8usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_rwlockattr_t"][::std::mem::size_of::<pthread_rwlockattr_t>() - 8usize];
    ["Alignment of pthread_rwlockattr_t"][::std::mem::align_of::<pthread_rwlockattr_t>() - 8usize];
    ["Offset of field: pthread_rwlockattr_t::__size"][::std::mem::offset_of!(pthread_rwlockattr_t, __size) - 0usize];
    ["Offset of field: pthread_rwlockattr_t::__align"][::std::mem::offset_of!(pthread_rwlockattr_t, __align) - 0usize];
};
pub type pthread_spinlock_t = ::std::os::raw::c_int;
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrier_t {
    pub __size: [::std::os::raw::c_char; 32usize],
    pub __align: ::std::os::raw::c_long,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrier_t"][::std::mem::size_of::<pthread_barrier_t>() - 32usize];
    ["Alignment of pthread_barrier_t"][::std::mem::align_of::<pthread_barrier_t>() - 8usize];
    ["Offset of field: pthread_barrier_t::__size"][::std::mem::offset_of!(pthread_barrier_t, __size) - 0usize];
    ["Offset of field: pthread_barrier_t::__align"][::std::mem::offset_of!(pthread_barrier_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Copy, Clone)]
pub union pthread_barrierattr_t {
    pub __size: [::std::os::raw::c_char; 4usize],
    pub __align: ::std::os::raw::c_int,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of pthread_barrierattr_t"][::std::mem::size_of::<pthread_barrierattr_t>() - 4usize];
    ["Alignment of pthread_barrierattr_t"][::std::mem::align_of::<pthread_barrierattr_t>() - 4usize];
    ["Offset of field: pthread_barrierattr_t::__size"][::std::mem::offset_of!(pthread_barrierattr_t, __size) - 0usize];
    ["Offset of field: pthread_barrierattr_t::__align"]
        [::std::mem::offset_of!(pthread_barrierattr_t, __align) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct random_data {
    pub fptr: *mut i32,
    pub rptr: *mut i32,
    pub state: *mut i32,
    pub rand_type: ::std::os::raw::c_int,
    pub rand_deg: ::std::os::raw::c_int,
    pub rand_sep: ::std::os::raw::c_int,
    pub end_ptr: *mut i32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of random_data"][::std::mem::size_of::<random_data>() - 48usize];
    ["Alignment of random_data"][::std::mem::align_of::<random_data>() - 8usize];
    ["Offset of field: random_data::fptr"][::std::mem::offset_of!(random_data, fptr) - 0usize];
    ["Offset of field: random_data::rptr"][::std::mem::offset_of!(random_data, rptr) - 8usize];
    ["Offset of field: random_data::state"][::std::mem::offset_of!(random_data, state) - 16usize];
    ["Offset of field: random_data::rand_type"][::std::mem::offset_of!(random_data, rand_type) - 24usize];
    ["Offset of field: random_data::rand_deg"][::std::mem::offset_of!(random_data, rand_deg) - 28usize];
    ["Offset of field: random_data::rand_sep"][::std::mem::offset_of!(random_data, rand_sep) - 32usize];
    ["Offset of field: random_data::end_ptr"][::std::mem::offset_of!(random_data, end_ptr) - 40usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct drand48_data {
    pub __x: [::std::os::raw::c_ushort; 3usize],
    pub __old_x: [::std::os::raw::c_ushort; 3usize],
    pub __c: ::std::os::raw::c_ushort,
    pub __init: ::std::os::raw::c_ushort,
    pub __a: ::std::os::raw::c_ulonglong,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of drand48_data"][::std::mem::size_of::<drand48_data>() - 24usize];
    ["Alignment of drand48_data"][::std::mem::align_of::<drand48_data>() - 8usize];
    ["Offset of field: drand48_data::__x"][::std::mem::offset_of!(drand48_data, __x) - 0usize];
    ["Offset of field: drand48_data::__old_x"][::std::mem::offset_of!(drand48_data, __old_x) - 6usize];
    ["Offset of field: drand48_data::__c"][::std::mem::offset_of!(drand48_data, __c) - 12usize];
    ["Offset of field: drand48_data::__init"][::std::mem::offset_of!(drand48_data, __init) - 14usize];
    ["Offset of field: drand48_data::__a"][::std::mem::offset_of!(drand48_data, __a) - 16usize];
};
pub type __compar_fn_t = ::std::option::Option<
    unsafe extern "C" fn(
        arg1: *const ::std::os::raw::c_void,
        arg2: *const ::std::os::raw::c_void,
    ) -> ::std::os::raw::c_int,
>;
pub type int_least8_t = __int_least8_t;
pub type int_least16_t = __int_least16_t;
pub type int_least32_t = __int_least32_t;
pub type int_least64_t = __int_least64_t;
pub type uint_least8_t = __uint_least8_t;
pub type uint_least16_t = __uint_least16_t;
pub type uint_least32_t = __uint_least32_t;
pub type uint_least64_t = __uint_least64_t;
pub type int_fast8_t = ::std::os::raw::c_schar;
pub type int_fast16_t = ::std::os::raw::c_long;
pub type int_fast32_t = ::std::os::raw::c_long;
pub type int_fast64_t = ::std::os::raw::c_long;
pub type uint_fast8_t = ::std::os::raw::c_uchar;
pub type uint_fast16_t = ::std::os::raw::c_ulong;
pub type uint_fast32_t = ::std::os::raw::c_ulong;
pub type uint_fast64_t = ::std::os::raw::c_ulong;
pub type intmax_t = __intmax_t;
pub type uintmax_t = __uintmax_t;
#[doc = "!< Initialize all processors"]
pub const amdsmi_init_flags_t_AMDSMI_INIT_ALL_PROCESSORS: amdsmi_init_flags_t = 4294967295;
#[doc = "!< Initialize AMD CPUS"]
pub const amdsmi_init_flags_t_AMDSMI_INIT_AMD_CPUS: amdsmi_init_flags_t = 1;
#[doc = "!< Initialize AMD GPUS"]
pub const amdsmi_init_flags_t_AMDSMI_INIT_AMD_GPUS: amdsmi_init_flags_t = 2;
#[doc = "!< Initialize Non-AMD CPUS"]
pub const amdsmi_init_flags_t_AMDSMI_INIT_NON_AMD_CPUS: amdsmi_init_flags_t = 4;
#[doc = "!< Initialize Non-AMD GPUS"]
pub const amdsmi_init_flags_t_AMDSMI_INIT_NON_AMD_GPUS: amdsmi_init_flags_t = 8;
#[doc = "< Initialize AMD CPUS and GPUS\n(Default option)"]
pub const amdsmi_init_flags_t_AMDSMI_INIT_AMD_APUS: amdsmi_init_flags_t = 3;
#[doc = " @brief Initialization flags\n\n Initialization flags may be OR'd together and passed to ::amdsmi_init().\n\n @cond @tag{gpu_bm_linux} @tag{host} @tag{cpu_bm} @tag{guest_windows} @endcond"]
pub type amdsmi_init_flags_t = ::std::os::raw::c_uint;
#[doc = "!< Multi-Media Unified Video Decoder"]
pub const amdsmi_mm_ip_t_AMDSMI_MM_UVD: amdsmi_mm_ip_t = 0;
#[doc = "!< Multi-Media Video Coding Engine"]
pub const amdsmi_mm_ip_t_AMDSMI_MM_VCE: amdsmi_mm_ip_t = 1;
#[doc = "!< Multi-Media Video Core Next"]
pub const amdsmi_mm_ip_t_AMDSMI_MM_VCN: amdsmi_mm_ip_t = 2;
pub const amdsmi_mm_ip_t_AMDSMI_MM__MAX: amdsmi_mm_ip_t = 3;
#[doc = " @brief GPU Capability info\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_mm_ip_t = ::std::os::raw::c_uint;
#[doc = "!< Linux containers"]
pub const amdsmi_container_types_t_AMDSMI_CONTAINER_LXC: amdsmi_container_types_t = 0;
#[doc = "!< Docker containers"]
pub const amdsmi_container_types_t_AMDSMI_CONTAINER_DOCKER: amdsmi_container_types_t = 1;
#[doc = " @brief Container\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_container_types_t = ::std::os::raw::c_uint;
#[doc = " @brief opaque handler point to underlying implementation\n\n @cond @tag{gpu_bm_linux} @tag{host} @tag{cpu_bm} @tag{guest_windows} @endcond"]
pub type amdsmi_processor_handle = *mut ::std::os::raw::c_void;
pub type amdsmi_socket_handle = *mut ::std::os::raw::c_void;
#[doc = " @brief opaque handler point to underlying implementation\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
pub type amdsmi_node_handle = *mut ::std::os::raw::c_void;
#[doc = "!< Unknown processor type"]
pub const processor_type_t_AMDSMI_PROCESSOR_TYPE_UNKNOWN: processor_type_t = 0;
#[doc = "!< AMD Graphics processor type"]
pub const processor_type_t_AMDSMI_PROCESSOR_TYPE_AMD_GPU: processor_type_t = 1;
#[doc = "!< AMD CPU processor type"]
pub const processor_type_t_AMDSMI_PROCESSOR_TYPE_AMD_CPU: processor_type_t = 2;
#[doc = "!< Non-AMD Graphics processor type"]
pub const processor_type_t_AMDSMI_PROCESSOR_TYPE_NON_AMD_GPU: processor_type_t = 3;
#[doc = "!< Non-AMD CPU processor type"]
pub const processor_type_t_AMDSMI_PROCESSOR_TYPE_NON_AMD_CPU: processor_type_t = 4;
#[doc = "!< AMD CPU-Core processor type"]
pub const processor_type_t_AMDSMI_PROCESSOR_TYPE_AMD_CPU_CORE: processor_type_t = 5;
#[doc = "!< AMD Accelerated processor type (GPU and CPU)"]
pub const processor_type_t_AMDSMI_PROCESSOR_TYPE_AMD_APU: processor_type_t = 6;
#[doc = " @brief Processor types detectable by AMD SMI\n\n AMDSMI_PROCESSOR_TYPE_AMD_CPU      - CPU Socket is a physical component that holds the CPU.\n AMDSMI_PROCESSOR_TYPE_AMD_CPU_CORE - CPU Cores are number of individual processing units within the CPU.\n AMDSMI_PROCESSOR_TYPE_AMD_APU      - Combination of AMDSMI_PROCESSOR_TYPE_AMD_CPU and integrated GPU on single die\n\n @cond @tag{gpu_bm_linux} @tag{host} @tag{cpu_bm} @tag{guest_windows} @endcond"]
pub type processor_type_t = ::std::os::raw::c_uint;
#[doc = "!< Call succeeded"]
pub const amdsmi_status_t_AMDSMI_STATUS_SUCCESS: amdsmi_status_t = 0;
#[doc = "!< Invalid parameters"]
pub const amdsmi_status_t_AMDSMI_STATUS_INVAL: amdsmi_status_t = 1;
#[doc = "!< Command not supported"]
pub const amdsmi_status_t_AMDSMI_STATUS_NOT_SUPPORTED: amdsmi_status_t = 2;
#[doc = "!< Not implemented yet"]
pub const amdsmi_status_t_AMDSMI_STATUS_NOT_YET_IMPLEMENTED: amdsmi_status_t = 3;
#[doc = "!< Fail to load lib"]
pub const amdsmi_status_t_AMDSMI_STATUS_FAIL_LOAD_MODULE: amdsmi_status_t = 4;
#[doc = "!< Fail to load symbol"]
pub const amdsmi_status_t_AMDSMI_STATUS_FAIL_LOAD_SYMBOL: amdsmi_status_t = 5;
#[doc = "!< Error when call libdrm"]
pub const amdsmi_status_t_AMDSMI_STATUS_DRM_ERROR: amdsmi_status_t = 6;
#[doc = "!< API call failed"]
pub const amdsmi_status_t_AMDSMI_STATUS_API_FAILED: amdsmi_status_t = 7;
#[doc = "!< Timeout in API call"]
pub const amdsmi_status_t_AMDSMI_STATUS_TIMEOUT: amdsmi_status_t = 8;
#[doc = "!< Retry operation"]
pub const amdsmi_status_t_AMDSMI_STATUS_RETRY: amdsmi_status_t = 9;
#[doc = "!< Permission Denied"]
pub const amdsmi_status_t_AMDSMI_STATUS_NO_PERM: amdsmi_status_t = 10;
#[doc = "!< An interrupt occurred during execution of function"]
pub const amdsmi_status_t_AMDSMI_STATUS_INTERRUPT: amdsmi_status_t = 11;
#[doc = "!< I/O Error"]
pub const amdsmi_status_t_AMDSMI_STATUS_IO: amdsmi_status_t = 12;
#[doc = "!< Bad address"]
pub const amdsmi_status_t_AMDSMI_STATUS_ADDRESS_FAULT: amdsmi_status_t = 13;
#[doc = "!< Problem accessing a file"]
pub const amdsmi_status_t_AMDSMI_STATUS_FILE_ERROR: amdsmi_status_t = 14;
#[doc = "!< Not enough memory"]
pub const amdsmi_status_t_AMDSMI_STATUS_OUT_OF_RESOURCES: amdsmi_status_t = 15;
#[doc = "!< An internal exception was caught"]
pub const amdsmi_status_t_AMDSMI_STATUS_INTERNAL_EXCEPTION: amdsmi_status_t = 16;
#[doc = "!< The provided input is out of allowable or safe range"]
pub const amdsmi_status_t_AMDSMI_STATUS_INPUT_OUT_OF_BOUNDS: amdsmi_status_t = 17;
#[doc = "!< An error occurred when initializing internal data structures"]
pub const amdsmi_status_t_AMDSMI_STATUS_INIT_ERROR: amdsmi_status_t = 18;
#[doc = "!< An internal reference counter exceeded INT32_MAX"]
pub const amdsmi_status_t_AMDSMI_STATUS_REFCOUNT_OVERFLOW: amdsmi_status_t = 19;
#[doc = "!< Error when a directory is not found, maps to ENOTDIR"]
pub const amdsmi_status_t_AMDSMI_STATUS_DIRECTORY_NOT_FOUND: amdsmi_status_t = 20;
#[doc = "!< Processor busy"]
pub const amdsmi_status_t_AMDSMI_STATUS_BUSY: amdsmi_status_t = 30;
#[doc = "!< Processor Not found"]
pub const amdsmi_status_t_AMDSMI_STATUS_NOT_FOUND: amdsmi_status_t = 31;
#[doc = "!< Processor not initialized"]
pub const amdsmi_status_t_AMDSMI_STATUS_NOT_INIT: amdsmi_status_t = 32;
#[doc = "!< No more free slot"]
pub const amdsmi_status_t_AMDSMI_STATUS_NO_SLOT: amdsmi_status_t = 33;
#[doc = "!< Processor driver not loaded"]
pub const amdsmi_status_t_AMDSMI_STATUS_DRIVER_NOT_LOADED: amdsmi_status_t = 34;
#[doc = "!< There is more data than the buffer size the user passed"]
pub const amdsmi_status_t_AMDSMI_STATUS_MORE_DATA: amdsmi_status_t = 39;
#[doc = "!< No data was found for a given input"]
pub const amdsmi_status_t_AMDSMI_STATUS_NO_DATA: amdsmi_status_t = 40;
#[doc = "!< Not enough resources were available for the operation"]
pub const amdsmi_status_t_AMDSMI_STATUS_INSUFFICIENT_SIZE: amdsmi_status_t = 41;
#[doc = "!< An unexpected amount of data was read"]
pub const amdsmi_status_t_AMDSMI_STATUS_UNEXPECTED_SIZE: amdsmi_status_t = 42;
#[doc = "!< The data read or provided to function is not what was expected"]
pub const amdsmi_status_t_AMDSMI_STATUS_UNEXPECTED_DATA: amdsmi_status_t = 43;
#[doc = "!< System has different cpu than AMD"]
pub const amdsmi_status_t_AMDSMI_STATUS_NON_AMD_CPU: amdsmi_status_t = 44;
#[doc = "!< Energy driver not found"]
pub const amdsmi_status_t_AMDSMI_STATUS_NO_ENERGY_DRV: amdsmi_status_t = 45;
#[doc = "!< MSR driver not found"]
pub const amdsmi_status_t_AMDSMI_STATUS_NO_MSR_DRV: amdsmi_status_t = 46;
#[doc = "!< HSMP driver not found"]
pub const amdsmi_status_t_AMDSMI_STATUS_NO_HSMP_DRV: amdsmi_status_t = 47;
#[doc = "!< HSMP not supported"]
pub const amdsmi_status_t_AMDSMI_STATUS_NO_HSMP_SUP: amdsmi_status_t = 48;
#[doc = "!< HSMP message/feature not supported"]
pub const amdsmi_status_t_AMDSMI_STATUS_NO_HSMP_MSG_SUP: amdsmi_status_t = 49;
#[doc = "!< HSMP message timed out"]
pub const amdsmi_status_t_AMDSMI_STATUS_HSMP_TIMEOUT: amdsmi_status_t = 50;
#[doc = "!< No Energy and HSMP driver present"]
pub const amdsmi_status_t_AMDSMI_STATUS_NO_DRV: amdsmi_status_t = 51;
#[doc = "!< file or directory not found"]
pub const amdsmi_status_t_AMDSMI_STATUS_FILE_NOT_FOUND: amdsmi_status_t = 52;
#[doc = "!< Parsed argument is invalid"]
pub const amdsmi_status_t_AMDSMI_STATUS_ARG_PTR_NULL: amdsmi_status_t = 53;
#[doc = "!< AMDGPU restart failed"]
pub const amdsmi_status_t_AMDSMI_STATUS_AMDGPU_RESTART_ERR: amdsmi_status_t = 54;
#[doc = "!< Setting is not available"]
pub const amdsmi_status_t_AMDSMI_STATUS_SETTING_UNAVAILABLE: amdsmi_status_t = 55;
#[doc = "!< EEPROM is corrupted"]
pub const amdsmi_status_t_AMDSMI_STATUS_CORRUPTED_EEPROM: amdsmi_status_t = 56;
#[doc = "!< The internal library error did not map to a status code"]
pub const amdsmi_status_t_AMDSMI_STATUS_MAP_ERROR: amdsmi_status_t = 4294967294;
#[doc = "!< An unknown error occurred"]
pub const amdsmi_status_t_AMDSMI_STATUS_UNKNOWN_ERROR: amdsmi_status_t = 4294967295;
#[doc = " @brief Error codes returned by amdsmi functions\n\n Please avoid status codes that are multiples of 256 (256, 512, etc..)\n Return values in the shell get modulo 256 applied, meaning any multiple of 256 ends up as 0\n\n @cond @tag{gpu_bm_linux} @tag{host} @tag{cpu_bm} @tag{guest_windows} @endcond"]
pub type amdsmi_status_t = ::std::os::raw::c_uint;
#[doc = "!< System clock"]
pub const amdsmi_clk_type_t_AMDSMI_CLK_TYPE_SYS: amdsmi_clk_type_t = 0;
pub const amdsmi_clk_type_t_AMDSMI_CLK_TYPE_FIRST: amdsmi_clk_type_t = 0;
#[doc = "!< Graphics clock"]
pub const amdsmi_clk_type_t_AMDSMI_CLK_TYPE_GFX: amdsmi_clk_type_t = 0;
#[doc = "< Data Fabric clock (for ASICs\nrunning on a separate clock)"]
pub const amdsmi_clk_type_t_AMDSMI_CLK_TYPE_DF: amdsmi_clk_type_t = 1;
#[doc = "< Display Controller Engine Front clock,\ntiming/bandwidth signals to display"]
pub const amdsmi_clk_type_t_AMDSMI_CLK_TYPE_DCEF: amdsmi_clk_type_t = 2;
#[doc = "!< System On Chip clock, integrated circuit frequency"]
pub const amdsmi_clk_type_t_AMDSMI_CLK_TYPE_SOC: amdsmi_clk_type_t = 3;
#[doc = "!< Memory clock speed, system operating frequency"]
pub const amdsmi_clk_type_t_AMDSMI_CLK_TYPE_MEM: amdsmi_clk_type_t = 4;
#[doc = "!< PCI Express clock, high bandwidth peripherals"]
pub const amdsmi_clk_type_t_AMDSMI_CLK_TYPE_PCIE: amdsmi_clk_type_t = 5;
#[doc = "!< Video 0 clock, video processing units"]
pub const amdsmi_clk_type_t_AMDSMI_CLK_TYPE_VCLK0: amdsmi_clk_type_t = 6;
#[doc = "!< Video 1 clock, video processing units"]
pub const amdsmi_clk_type_t_AMDSMI_CLK_TYPE_VCLK1: amdsmi_clk_type_t = 7;
#[doc = "!< Display 1 clock, timing signals for display output"]
pub const amdsmi_clk_type_t_AMDSMI_CLK_TYPE_DCLK0: amdsmi_clk_type_t = 8;
#[doc = "!< Display 2 clock, timing signals for display output"]
pub const amdsmi_clk_type_t_AMDSMI_CLK_TYPE_DCLK1: amdsmi_clk_type_t = 9;
pub const amdsmi_clk_type_t_AMDSMI_CLK_TYPE__MAX: amdsmi_clk_type_t = 9;
#[doc = " @brief Clock types\n\n @cond @tag{gpu_bm_linux} @tag{host} @tag{guest_windows} @endcond"]
pub type amdsmi_clk_type_t = ::std::os::raw::c_uint;
#[doc = "!< Invalid accelerator partition type"]
pub const amdsmi_accelerator_partition_type_t_AMDSMI_ACCELERATOR_PARTITION_INVALID:
    amdsmi_accelerator_partition_type_t = 0;
#[doc = "< Single GPU mode (SPX)- All XCCs work\ntogether with shared memory"]
pub const amdsmi_accelerator_partition_type_t_AMDSMI_ACCELERATOR_PARTITION_SPX: amdsmi_accelerator_partition_type_t = 1;
#[doc = "< Dual GPU mode (DPX)- Half XCCs work\ntogether with shared memory"]
pub const amdsmi_accelerator_partition_type_t_AMDSMI_ACCELERATOR_PARTITION_DPX: amdsmi_accelerator_partition_type_t = 2;
#[doc = "< Triple GPU mode (TPX)- One-third XCCs\nwork together with shared memory"]
pub const amdsmi_accelerator_partition_type_t_AMDSMI_ACCELERATOR_PARTITION_TPX: amdsmi_accelerator_partition_type_t = 3;
#[doc = "< Quad GPU mode (QPX)- Quarter XCCs\nwork together with shared memory"]
pub const amdsmi_accelerator_partition_type_t_AMDSMI_ACCELERATOR_PARTITION_QPX: amdsmi_accelerator_partition_type_t = 4;
#[doc = "< Core mode (CPX)- Per-chip XCC with\nshared memory"]
pub const amdsmi_accelerator_partition_type_t_AMDSMI_ACCELERATOR_PARTITION_CPX: amdsmi_accelerator_partition_type_t = 5;
pub const amdsmi_accelerator_partition_type_t_AMDSMI_ACCELERATOR_PARTITION_MAX: amdsmi_accelerator_partition_type_t = 6;
#[doc = " @brief Accelerator Partition\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
pub type amdsmi_accelerator_partition_type_t = ::std::os::raw::c_uint;
#[doc = "!< Compute complex or stream processors"]
pub const amdsmi_accelerator_partition_resource_type_t_AMDSMI_ACCELERATOR_XCC:
    amdsmi_accelerator_partition_resource_type_t = 0;
#[doc = "!< Video encoding"]
pub const amdsmi_accelerator_partition_resource_type_t_AMDSMI_ACCELERATOR_ENCODER:
    amdsmi_accelerator_partition_resource_type_t = 1;
#[doc = "!< Video decoding"]
pub const amdsmi_accelerator_partition_resource_type_t_AMDSMI_ACCELERATOR_DECODER:
    amdsmi_accelerator_partition_resource_type_t = 2;
#[doc = "!< Direct Memory Access, high speed data transfers"]
pub const amdsmi_accelerator_partition_resource_type_t_AMDSMI_ACCELERATOR_DMA:
    amdsmi_accelerator_partition_resource_type_t = 3;
#[doc = "!< Encoding and Decoding jpeg engines"]
pub const amdsmi_accelerator_partition_resource_type_t_AMDSMI_ACCELERATOR_JPEG:
    amdsmi_accelerator_partition_resource_type_t = 4;
pub const amdsmi_accelerator_partition_resource_type_t_AMDSMI_ACCELERATOR_MAX:
    amdsmi_accelerator_partition_resource_type_t = 5;
#[doc = " @brief Accelerator Partition Resource Types\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
pub type amdsmi_accelerator_partition_resource_type_t = ::std::os::raw::c_uint;
#[doc = "!< Invalid compute partition type"]
pub const amdsmi_compute_partition_type_t_AMDSMI_COMPUTE_PARTITION_INVALID: amdsmi_compute_partition_type_t = 0;
#[doc = "< Single GPU mode (SPX)- All XCCs work\ntogether with shared memory"]
pub const amdsmi_compute_partition_type_t_AMDSMI_COMPUTE_PARTITION_SPX: amdsmi_compute_partition_type_t = 1;
#[doc = "< Dual GPU mode (DPX)- Half XCCs work\ntogether with shared memory"]
pub const amdsmi_compute_partition_type_t_AMDSMI_COMPUTE_PARTITION_DPX: amdsmi_compute_partition_type_t = 2;
#[doc = "< Triple GPU mode (TPX)- One-third XCCs\nwork together with shared memory"]
pub const amdsmi_compute_partition_type_t_AMDSMI_COMPUTE_PARTITION_TPX: amdsmi_compute_partition_type_t = 3;
#[doc = "< Quad GPU mode (QPX)- Quarter XCCs\nwork together with shared memory"]
pub const amdsmi_compute_partition_type_t_AMDSMI_COMPUTE_PARTITION_QPX: amdsmi_compute_partition_type_t = 4;
#[doc = "< Core mode (CPX)- Per-chip XCC with\nshared memory"]
pub const amdsmi_compute_partition_type_t_AMDSMI_COMPUTE_PARTITION_CPX: amdsmi_compute_partition_type_t = 5;
#[doc = " @brief Compute Partition. This enum is used to identify\n various compute partitioning settings.\n\n @cond @tag{gpu_bm_linux} @tag{guest_windows} @endcond"]
pub type amdsmi_compute_partition_type_t = ::std::os::raw::c_uint;
pub const amdsmi_memory_partition_type_t_AMDSMI_MEMORY_PARTITION_UNKNOWN: amdsmi_memory_partition_type_t = 0;
#[doc = "< NPS1 - All CCD & XCD data is interleaved\nacross all 8 HBM stacks (all stacks/1)"]
pub const amdsmi_memory_partition_type_t_AMDSMI_MEMORY_PARTITION_NPS1: amdsmi_memory_partition_type_t = 1;
#[doc = "< NPS2 - 2 sets of CCDs or 4 XCD interleaved\nacross the 4 HBM stacks per AID pair\n(8 stacks/2)"]
pub const amdsmi_memory_partition_type_t_AMDSMI_MEMORY_PARTITION_NPS2: amdsmi_memory_partition_type_t = 2;
#[doc = "< NPS4 - Each XCD data is interleaved\nacross 2 (or single) HBM stacks\n(8 stacks/8 or 8 stacks/4)"]
pub const amdsmi_memory_partition_type_t_AMDSMI_MEMORY_PARTITION_NPS4: amdsmi_memory_partition_type_t = 4;
#[doc = "< NPS8 - Each XCD uses a single HBM stack\n(8 stacks/8). Or each XCD uses a single\nHBM stack & CCDs share 2 non-interleaved\nHBM stacks on its AID\n(AID[1,2,3] = 6 stacks/6)"]
pub const amdsmi_memory_partition_type_t_AMDSMI_MEMORY_PARTITION_NPS8: amdsmi_memory_partition_type_t = 8;
#[doc = " @brief Memory Partitions\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
pub type amdsmi_memory_partition_type_t = ::std::os::raw::c_uint;
#[doc = "!< Edge temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_EDGE: amdsmi_temperature_type_t = 0;
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_FIRST: amdsmi_temperature_type_t = 0;
#[doc = "!< Hottest temperature reported for entire die"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_HOTSPOT: amdsmi_temperature_type_t = 1;
#[doc = "!< Synonymous with HOTSPOT"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_JUNCTION: amdsmi_temperature_type_t = 1;
#[doc = "!< VRAM temperature on graphics card"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_VRAM: amdsmi_temperature_type_t = 2;
#[doc = "!< High Bandwidth 0 temperature per stack"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_HBM_0: amdsmi_temperature_type_t = 3;
#[doc = "!< High Bandwidth 1 temperature per stack"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_HBM_1: amdsmi_temperature_type_t = 4;
#[doc = "!< High Bandwidth 2 temperature per stack"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_HBM_2: amdsmi_temperature_type_t = 5;
#[doc = "!< High Bandwidth 3 temperature per stack"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_HBM_3: amdsmi_temperature_type_t = 6;
#[doc = "!< PCIe switch temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_PLX: amdsmi_temperature_type_t = 7;
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_NODE_FIRST: amdsmi_temperature_type_t = 100;
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_NODE_RETIMER_X: amdsmi_temperature_type_t = 100;
#[doc = "!< OAM X IBC temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_NODE_OAM_X_IBC: amdsmi_temperature_type_t = 101;
#[doc = "!< OAM X IBC 2 temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_NODE_OAM_X_IBC_2: amdsmi_temperature_type_t = 102;
#[doc = "!< OAM X VDD 1.8V voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_NODE_OAM_X_VDD18_VR: amdsmi_temperature_type_t =
    103;
#[doc = "!< OAM X 0.4V HBM B voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_NODE_OAM_X_04_HBM_B_VR: amdsmi_temperature_type_t =
    104;
#[doc = "!< OAM X 0.4V HBM D voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_NODE_OAM_X_04_HBM_D_VR: amdsmi_temperature_type_t =
    105;
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_NODE_LAST: amdsmi_temperature_type_t = 149;
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_VR_FIRST: amdsmi_temperature_type_t = 150;
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_VDDCR_VDD0: amdsmi_temperature_type_t = 150;
#[doc = "!< VDDCR VDD1 voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_VDDCR_VDD1: amdsmi_temperature_type_t = 151;
#[doc = "!< VDDCR VDD2 voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_VDDCR_VDD2: amdsmi_temperature_type_t = 152;
#[doc = "!< VDDCR VDD3 voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_VDDCR_VDD3: amdsmi_temperature_type_t = 153;
#[doc = "!< VDDCR SOC A voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_VDDCR_SOC_A: amdsmi_temperature_type_t = 154;
#[doc = "!< VDDCR SOC C voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_VDDCR_SOC_C: amdsmi_temperature_type_t = 155;
#[doc = "!< VDDCR SOCIO A voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_VDDCR_SOCIO_A: amdsmi_temperature_type_t = 156;
#[doc = "!< VDDCR SOCIO C voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_VDDCR_SOCIO_C: amdsmi_temperature_type_t = 157;
#[doc = "!< VDD 0.85V HBM voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_VDD_085_HBM: amdsmi_temperature_type_t = 158;
#[doc = "!< VDDCR 1.1V HBM B voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_VDDCR_11_HBM_B: amdsmi_temperature_type_t = 159;
#[doc = "!< VDDCR 1.1V HBM D voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_VDDCR_11_HBM_D: amdsmi_temperature_type_t = 160;
#[doc = "!< VDD USR voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_VDD_USR: amdsmi_temperature_type_t = 161;
#[doc = "!< VDDIO 1.1V E32 voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_VDDIO_11_E32: amdsmi_temperature_type_t = 162;
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_GPUBOARD_VR_LAST: amdsmi_temperature_type_t = 199;
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_FIRST: amdsmi_temperature_type_t = 200;
#[doc = "!< UBB FPGA temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_UBB_FPGA: amdsmi_temperature_type_t = 200;
#[doc = "!< UBB front temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_UBB_FRONT: amdsmi_temperature_type_t = 201;
#[doc = "!< UBB back temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_UBB_BACK: amdsmi_temperature_type_t = 202;
#[doc = "!< UBB OAM7 temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_UBB_OAM7: amdsmi_temperature_type_t = 203;
#[doc = "!< UBB IBC temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_UBB_IBC: amdsmi_temperature_type_t = 204;
#[doc = "!< UBB UFPGA temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_UBB_UFPGA: amdsmi_temperature_type_t = 205;
#[doc = "!< UBB OAM1 temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_UBB_OAM1: amdsmi_temperature_type_t = 206;
#[doc = "!< OAM 0-1 HSC temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_OAM_0_1_HSC: amdsmi_temperature_type_t = 207;
#[doc = "!< OAM 2-3 HSC temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_OAM_2_3_HSC: amdsmi_temperature_type_t = 208;
#[doc = "!< OAM 4-5 HSC temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_OAM_4_5_HSC: amdsmi_temperature_type_t = 209;
#[doc = "!< OAM 6-7 HSC temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_OAM_6_7_HSC: amdsmi_temperature_type_t = 210;
#[doc = "!< UBB FPGA 0.72V voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_UBB_FPGA_0V72_VR: amdsmi_temperature_type_t = 211;
#[doc = "!< UBB FPGA 3.3V voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_UBB_FPGA_3V3_VR: amdsmi_temperature_type_t = 212;
#[doc = "!< Retimer 0-1-2-3 1.2V voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_RETIMER_0_1_2_3_1V2_VR:
    amdsmi_temperature_type_t = 213;
#[doc = "!< Retimer 4-5-6-7 1.2V voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_RETIMER_4_5_6_7_1V2_VR:
    amdsmi_temperature_type_t = 214;
#[doc = "!< Retimer 0-1 0.9V voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_RETIMER_0_1_0V9_VR: amdsmi_temperature_type_t =
    215;
#[doc = "!< Retimer 4-5 0.9V voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_RETIMER_4_5_0V9_VR: amdsmi_temperature_type_t =
    216;
#[doc = "!< Retimer 2-3 0.9V voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_RETIMER_2_3_0V9_VR: amdsmi_temperature_type_t =
    217;
#[doc = "!< Retimer 6-7 0.9V voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_RETIMER_6_7_0V9_VR: amdsmi_temperature_type_t =
    218;
#[doc = "!< OAM 0-1-2-3 3.3V voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_OAM_0_1_2_3_3V3_VR: amdsmi_temperature_type_t =
    219;
#[doc = "!< OAM 4-5-6-7 3.3V voltage regulator temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_OAM_4_5_6_7_3V3_VR: amdsmi_temperature_type_t =
    220;
#[doc = "!< IBC HSC temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_IBC_HSC: amdsmi_temperature_type_t = 221;
#[doc = "!< IBC temperature"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_IBC: amdsmi_temperature_type_t = 222;
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE_BASEBOARD_LAST: amdsmi_temperature_type_t = 249;
#[doc = "!< Maximum per GPU temperature type"]
pub const amdsmi_temperature_type_t_AMDSMI_TEMPERATURE_TYPE__MAX: amdsmi_temperature_type_t = 249;
#[doc = " @brief This enumeration is used to indicate from which part of the processor a\n temperature reading should be obtained.\n\n @cond @tag{gpu_bm_linux} @tag{host} @tag{guest_windows} @endcond"]
pub type amdsmi_temperature_type_t = ::std::os::raw::c_uint;
#[doc = "< System Management Unit (power management,\nclock control, thermal monitoring, etc...)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_SMU: amdsmi_fw_block_t = 1;
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_FIRST: amdsmi_fw_block_t = 1;
#[doc = "!< Compute Processor - Command_Engine (fetch, decode, dispatch)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_CP_CE: amdsmi_fw_block_t = 2;
#[doc = "!< Compute Processor - Pixel Front End Processor (pixelating process)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_CP_PFP: amdsmi_fw_block_t = 3;
#[doc = "!< Compute Processor - Micro Engine (specialize processing)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_CP_ME: amdsmi_fw_block_t = 4;
#[doc = "!< Compute Processor - Micro Engine Controler Job Table 1 (queues, scheduling)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_CP_MEC_JT1: amdsmi_fw_block_t = 5;
#[doc = "!< Compute Processor - Micro Engine Controler Job Table 2 (queues, scheduling)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_CP_MEC_JT2: amdsmi_fw_block_t = 6;
#[doc = "!< Compute Processor - Micro Engine Controler 1 (scheduling, managing resources)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_CP_MEC1: amdsmi_fw_block_t = 7;
#[doc = "!< Compute Processor - Micro Engine Controler 2 (scheduling, managing resources)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_CP_MEC2: amdsmi_fw_block_t = 8;
#[doc = "!< Rasterizer and L2 Cache (rasterization processs)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RLC: amdsmi_fw_block_t = 9;
#[doc = "!< System Direct Memory Access 0 (high speed data transfers)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_SDMA0: amdsmi_fw_block_t = 10;
#[doc = "!< System Direct Memory Access 1 (high speed data transfers)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_SDMA1: amdsmi_fw_block_t = 11;
#[doc = "!< System Direct Memory Access 2 (high speed data transfers)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_SDMA2: amdsmi_fw_block_t = 12;
#[doc = "!< System Direct Memory Access 3 (high speed data transfers)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_SDMA3: amdsmi_fw_block_t = 13;
#[doc = "!< System Direct Memory Access 4 (high speed data transfers)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_SDMA4: amdsmi_fw_block_t = 14;
#[doc = "!< System Direct Memory Access 5 (high speed data transfers)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_SDMA5: amdsmi_fw_block_t = 15;
#[doc = "!< System Direct Memory Access 6 (high speed data transfers)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_SDMA6: amdsmi_fw_block_t = 16;
#[doc = "!< System Direct Memory Access 7 (high speed data transfers)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_SDMA7: amdsmi_fw_block_t = 17;
#[doc = "!< Video Core Next (encoding and decoding)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_VCN: amdsmi_fw_block_t = 18;
#[doc = "!< Unified Video Decoder (decode specific video formats)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_UVD: amdsmi_fw_block_t = 19;
#[doc = "!< Video Coding Engine (Encoding video)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_VCE: amdsmi_fw_block_t = 20;
#[doc = "!< Image Signal Processor (processing raw image data from sensors)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_ISP: amdsmi_fw_block_t = 21;
#[doc = "!< Digital Micro Controller Unit - Embedded RAM (memory used by DMU)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_DMCU_ERAM: amdsmi_fw_block_t = 22;
#[doc = "!< Digital Micro Controller Unit - Interrupt Service Routine (interrupt handlers)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_DMCU_ISR: amdsmi_fw_block_t = 23;
#[doc = "!< Rasterizier and L2 Cache Restore List Graphics Processor Memory"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RLC_RESTORE_LIST_GPM_MEM: amdsmi_fw_block_t = 24;
#[doc = "!< Rasterizier and L2 Cache Restore List System RAM Memory"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RLC_RESTORE_LIST_SRM_MEM: amdsmi_fw_block_t = 25;
#[doc = "!< Rasterizier and L2 Cache Restore List Control"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RLC_RESTORE_LIST_CNTL: amdsmi_fw_block_t = 26;
#[doc = "!< Rasterizier and L2 Cache Virtual memory"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RLC_V: amdsmi_fw_block_t = 27;
#[doc = "!< Multi-Media Shader Hardware Scheduler"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_MMSCH: amdsmi_fw_block_t = 28;
#[doc = "!< Platform Security Processor System Driver"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_PSP_SYSDRV: amdsmi_fw_block_t = 29;
#[doc = "!< Platform Security Processor Secure Operating System Driver"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_PSP_SOSDRV: amdsmi_fw_block_t = 30;
#[doc = "!< Platform Security Processor Table of Contents"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_PSP_TOC: amdsmi_fw_block_t = 31;
#[doc = "!< Platform Security Processor Table of Contents"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_PSP_KEYDB: amdsmi_fw_block_t = 32;
#[doc = "!< Data Fabric Controler (bandwidth and coherency)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_DFC: amdsmi_fw_block_t = 33;
#[doc = "!< Platform Security Processor Secure Program Loader"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_PSP_SPL: amdsmi_fw_block_t = 34;
#[doc = "!< Driver Capabilities (capabilities, features)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_DRV_CAP: amdsmi_fw_block_t = 35;
#[doc = "!< Memory Contoller (RAM and VRAM)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_MC: amdsmi_fw_block_t = 36;
#[doc = "!< Platform Security Processor Bootloader (initial firmware)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_PSP_BL: amdsmi_fw_block_t = 37;
#[doc = "!< Compute Processor Packet Processor 4 (processing command packets)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_CP_PM4: amdsmi_fw_block_t = 38;
#[doc = "!< Rasterizier and L2 Cache Partition"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RLC_P: amdsmi_fw_block_t = 39;
#[doc = "!< Security Policy Stage 2 (security features)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_SEC_POLICY_STAGE2: amdsmi_fw_block_t = 40;
#[doc = "!< Register Access Whitelist (Prevent unathorizied access)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_REG_ACCESS_WHITELIST: amdsmi_fw_block_t = 41;
#[doc = "!< Input/Output Memory Management Unit - Dynamic RAM"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_IMU_DRAM: amdsmi_fw_block_t = 42;
#[doc = "!< Input/Output Memory Management Unit - Instruction RAM"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_IMU_IRAM: amdsmi_fw_block_t = 43;
#[doc = "!< System Direct Memory Access - Thread Handler 0"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_SDMA_TH0: amdsmi_fw_block_t = 44;
#[doc = "!< System Direct Memory Access - Thread Handler 1"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_SDMA_TH1: amdsmi_fw_block_t = 45;
#[doc = "!< Compute Processor - Micro Engine Scheduler"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_CP_MES: amdsmi_fw_block_t = 46;
#[doc = "!< Micro Engine Scheduler - Kernel Indirect Queue"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_MES_KIQ: amdsmi_fw_block_t = 47;
#[doc = "!< Micro Engine Scheduler - Stack"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_MES_STACK: amdsmi_fw_block_t = 48;
#[doc = "!< Micro Engine Scheduler - Thread 1"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_MES_THREAD1: amdsmi_fw_block_t = 49;
#[doc = "!< Micro Engine Scheduler - Thread 1 Stack"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_MES_THREAD1_STACK: amdsmi_fw_block_t = 50;
#[doc = "!< Hardware Block RLX6"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RLX6: amdsmi_fw_block_t = 51;
#[doc = "!< Hardware Block RLX6 - Dynamic Ram Boot"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RLX6_DRAM_BOOT: amdsmi_fw_block_t = 52;
#[doc = "!< Hardware Block RS64 - Micro Engine"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RS64_ME: amdsmi_fw_block_t = 53;
#[doc = "!< Hardware Block RS64 - Micro Engine Partition 0 Data"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RS64_ME_P0_DATA: amdsmi_fw_block_t = 54;
#[doc = "!< Hardware Block RS64 - Micro Engine Partition 1 Data"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RS64_ME_P1_DATA: amdsmi_fw_block_t = 55;
#[doc = "!< Hardware Block RS64 - Pixel Front End Processor"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RS64_PFP: amdsmi_fw_block_t = 56;
#[doc = "!< Hardware Block RS64 - Pixel Front End Processor Partition 0 Data"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RS64_PFP_P0_DATA: amdsmi_fw_block_t = 57;
#[doc = "!< Hardware Block RS64 - Pixel Front End Processor Partition 1 Data"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RS64_PFP_P1_DATA: amdsmi_fw_block_t = 58;
#[doc = "!< Hardware Block RS64 - Micro Engine Controller"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RS64_MEC: amdsmi_fw_block_t = 59;
#[doc = "!< Hardware Block RS64 - Micro Engine Controller Partition 0 Data"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RS64_MEC_P0_DATA: amdsmi_fw_block_t = 60;
#[doc = "!< Hardware Block RS64 - Micro Engine Controller Partition 1 Data"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RS64_MEC_P1_DATA: amdsmi_fw_block_t = 61;
#[doc = "!< Hardware Block RS64 - Micro Engine Controller Partition 2 Data"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RS64_MEC_P2_DATA: amdsmi_fw_block_t = 62;
#[doc = "!< Hardware Block RS64 - Micro Engine Controller Partition 3 Data"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RS64_MEC_P3_DATA: amdsmi_fw_block_t = 63;
#[doc = "!< Power Policy Table (power management policies)"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_PPTABLE: amdsmi_fw_block_t = 64;
#[doc = "!< Platform Security Processor - System On a Chip"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_PSP_SOC: amdsmi_fw_block_t = 65;
#[doc = "!< Platform Security Processor - Debug"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_PSP_DBG: amdsmi_fw_block_t = 66;
#[doc = "!< Platform Security Processor - Interface"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_PSP_INTF: amdsmi_fw_block_t = 67;
#[doc = "!< Hardware Block RLX6 - Core 1"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RLX6_CORE1: amdsmi_fw_block_t = 68;
#[doc = "!< Hardware Block RLX6 Core 1 - Dynamic RAM Boot"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RLX6_DRAM_BOOT_CORE1: amdsmi_fw_block_t = 69;
#[doc = "!< Hardware Block RLCV - Subsystem LX7"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RLCV_LX7: amdsmi_fw_block_t = 70;
#[doc = "!< Rasterizier and L2 Cache - Save Restore List"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RLC_SAVE_RESTORE_LIST: amdsmi_fw_block_t = 71;
#[doc = "!< Asynchronous Shader Dispatcher"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_ASD: amdsmi_fw_block_t = 72;
#[doc = "!< Trusted Applications - Reliablity Availability and Serviceability"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_TA_RAS: amdsmi_fw_block_t = 73;
#[doc = "!< Trusted Applications - Reliablity XGMI"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_TA_XGMI: amdsmi_fw_block_t = 74;
#[doc = "!< Rasterizier and L2 Cache - Shared Resource Local Group"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RLC_SRLG: amdsmi_fw_block_t = 75;
#[doc = "!< Rasterizier and L2 Cache - Shared Resource Local Segment"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_RLC_SRLS: amdsmi_fw_block_t = 76;
#[doc = "!< Power Management Firmware"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_PM: amdsmi_fw_block_t = 77;
#[doc = "!< Display Micro-Controller Unit"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_DMCU: amdsmi_fw_block_t = 78;
#[doc = "!< Platform Level Data Model Firmware Bundle"]
pub const amdsmi_fw_block_t_AMDSMI_FW_ID_PLDM_BUNDLE: amdsmi_fw_block_t = 79;
pub const amdsmi_fw_block_t_AMDSMI_FW_ID__MAX: amdsmi_fw_block_t = 80;
#[doc = " @brief The values of this enum are used to identify the various firmware\n blocks.\n\n @cond @tag{gpu_bm_linux} @tag{guest_windows} @tag{host} @endcond"]
pub type amdsmi_fw_block_t = ::std::os::raw::c_uint;
#[doc = "!< Unknown memory type"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_UNKNOWN: amdsmi_vram_type_t = 0;
#[doc = "!< High Bandwidth Memory"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_HBM: amdsmi_vram_type_t = 1;
#[doc = "!< High Bandwidth Memory, Generation 2"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_HBM2: amdsmi_vram_type_t = 2;
#[doc = "!< High Bandwidth Memory, Generation 2 Enhanced"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_HBM2E: amdsmi_vram_type_t = 3;
#[doc = "!< High Bandwidth Memory, Generation 3"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_HBM3: amdsmi_vram_type_t = 4;
#[doc = "!< High Bandwidth Memory, Generation 3 Enhanced"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_HBM3E: amdsmi_vram_type_t = 5;
#[doc = "!< Double Data Rate, Generation 2"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_DDR2: amdsmi_vram_type_t = 10;
#[doc = "!< Double Data Rate, Generation 3"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_DDR3: amdsmi_vram_type_t = 11;
#[doc = "!< Double Data Rate, Generation 4"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_DDR4: amdsmi_vram_type_t = 12;
#[doc = "!< Double Data Rate, Generation 5"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_DDR5: amdsmi_vram_type_t = 13;
#[doc = "!< Graphics Double Data Rate, Generation 1"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_GDDR1: amdsmi_vram_type_t = 17;
#[doc = "!< Graphics Double Data Rate, Generation 2"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_GDDR2: amdsmi_vram_type_t = 18;
#[doc = "!< Graphics Double Data Rate, Generation 3"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_GDDR3: amdsmi_vram_type_t = 19;
#[doc = "!< Graphics Double Data Rate, Generation 4"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_GDDR4: amdsmi_vram_type_t = 20;
#[doc = "!< Graphics Double Data Rate, Generation 5"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_GDDR5: amdsmi_vram_type_t = 21;
#[doc = "!< Graphics Double Data Rate, Generation 6"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_GDDR6: amdsmi_vram_type_t = 22;
#[doc = "!< Graphics Double Data Rate, Generation 7"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_GDDR7: amdsmi_vram_type_t = 23;
#[doc = "!< Low Power Double Data Rate, Generation 4"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_LPDDR4: amdsmi_vram_type_t = 30;
#[doc = "!< Low Power Double Data Rate, Generation 5"]
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE_LPDDR5: amdsmi_vram_type_t = 31;
pub const amdsmi_vram_type_t_AMDSMI_VRAM_TYPE__MAX: amdsmi_vram_type_t = 31;
#[doc = " @brief vRam Types. This enum is used to identify various VRam types.\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
pub type amdsmi_vram_type_t = ::std::os::raw::c_uint;
#[doc = " @brief This structure represents a range (e.g., frequencies or voltages).\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_range_t {
    #[doc = "!< Lower bound of range"]
    pub lower_bound: u64,
    #[doc = "!< Upper bound of range"]
    pub upper_bound: u64,
    pub reserved: [u64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_range_t"][::std::mem::size_of::<amdsmi_range_t>() - 32usize];
    ["Alignment of amdsmi_range_t"][::std::mem::align_of::<amdsmi_range_t>() - 8usize];
    ["Offset of field: amdsmi_range_t::lower_bound"][::std::mem::offset_of!(amdsmi_range_t, lower_bound) - 0usize];
    ["Offset of field: amdsmi_range_t::upper_bound"][::std::mem::offset_of!(amdsmi_range_t, upper_bound) - 8usize];
    ["Offset of field: amdsmi_range_t::reserved"][::std::mem::offset_of!(amdsmi_range_t, reserved) - 16usize];
};
#[doc = " @brief XGMI Information\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_xgmi_info_t {
    pub xgmi_lanes: u8,
    pub xgmi_hive_id: u64,
    pub xgmi_node_id: u64,
    pub index: u32,
    pub reserved: [u32; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_xgmi_info_t"][::std::mem::size_of::<amdsmi_xgmi_info_t>() - 64usize];
    ["Alignment of amdsmi_xgmi_info_t"][::std::mem::align_of::<amdsmi_xgmi_info_t>() - 8usize];
    ["Offset of field: amdsmi_xgmi_info_t::xgmi_lanes"]
        [::std::mem::offset_of!(amdsmi_xgmi_info_t, xgmi_lanes) - 0usize];
    ["Offset of field: amdsmi_xgmi_info_t::xgmi_hive_id"]
        [::std::mem::offset_of!(amdsmi_xgmi_info_t, xgmi_hive_id) - 8usize];
    ["Offset of field: amdsmi_xgmi_info_t::xgmi_node_id"]
        [::std::mem::offset_of!(amdsmi_xgmi_info_t, xgmi_node_id) - 16usize];
    ["Offset of field: amdsmi_xgmi_info_t::index"][::std::mem::offset_of!(amdsmi_xgmi_info_t, index) - 24usize];
    ["Offset of field: amdsmi_xgmi_info_t::reserved"][::std::mem::offset_of!(amdsmi_xgmi_info_t, reserved) - 28usize];
};
#[doc = " @brief VRam Usage\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_vram_usage_t {
    #[doc = "!< In MB"]
    pub vram_total: u32,
    #[doc = "!< In MB"]
    pub vram_used: u32,
    pub reserved: [u32; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_vram_usage_t"][::std::mem::size_of::<amdsmi_vram_usage_t>() - 16usize];
    ["Alignment of amdsmi_vram_usage_t"][::std::mem::align_of::<amdsmi_vram_usage_t>() - 4usize];
    ["Offset of field: amdsmi_vram_usage_t::vram_total"]
        [::std::mem::offset_of!(amdsmi_vram_usage_t, vram_total) - 0usize];
    ["Offset of field: amdsmi_vram_usage_t::vram_used"]
        [::std::mem::offset_of!(amdsmi_vram_usage_t, vram_used) - 4usize];
    ["Offset of field: amdsmi_vram_usage_t::reserved"][::std::mem::offset_of!(amdsmi_vram_usage_t, reserved) - 8usize];
};
#[doc = " @brief This structure hold violation status information.\n        Note: for MI3x asics and higher, older ASICs will show unsupported.\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_violation_status_t {
    #[doc = "!< Represents CPU timestamp in microseconds (uS)"]
    pub reference_timestamp: u64,
    #[doc = "!< Violation time.  Units in nanoseconds (ns) {@linux_bm}, in milliseconds (ms) {@host}"]
    pub violation_timestamp: u64,
    #[doc = "!< Current accumulated counter; Max uint64 means unsupported"]
    pub acc_counter: u64,
    #[doc = "!< Current accumulated processor hot violation count; Max uint64 means unsupported"]
    pub acc_prochot_thrm: u64,
    #[doc = "!< PVIOL; Current accumulated Package Power Tracking (PPT) count; Max uint64 means unsupported"]
    pub acc_ppt_pwr: u64,
    #[doc = "!< TVIOL; Current accumulated Socket thermal count; Max uint64 means unsupported"]
    pub acc_socket_thrm: u64,
    #[doc = "!< Current accumulated voltage regulator count; Max uint64 means unsupported"]
    pub acc_vr_thrm: u64,
    #[doc = "!< Current accumulated High Bandwidth Memory (HBM) thermal count; Max uint64 means unsupported"]
    pub acc_hbm_thrm: u64,
    #[doc = "< UPDATED in new driver 1.8: use new *_gfx_clk_below_host_limit_pwr, *_gfx_clk_below_host_limit_thm, *_gfx_clk_below_host_limit_total values!\nCurrent gfx clock below host limit count; Max uint64 means unsupported."]
    pub acc_gfx_clk_below_host_limit: u64,
    #[doc = "!< Processor hot violation % (greater than 0% is a violation); Max uint64 means unsupported"]
    pub per_prochot_thrm: u64,
    #[doc = "!< PVIOL; Package Power Tracking (PPT) violation % (greater than 0% is a violation); Max uint64 means unsupported"]
    pub per_ppt_pwr: u64,
    #[doc = "!< TVIOL; Socket thermal violation % (greater than 0% is a violation); Max uint64 means unsupported"]
    pub per_socket_thrm: u64,
    #[doc = "!< Voltage regulator violation % (greater than 0% is a violation); Max uint64 means unsupported"]
    pub per_vr_thrm: u64,
    #[doc = "!< High Bandwidth Memory (HBM) thermal violation % (greater than 0% is a violation); Max uint64 means unsupported"]
    pub per_hbm_thrm: u64,
    #[doc = "< UPDATED in new driver 1.8: use new *_gfx_clk_below_host_limit_pwr, *_gfx_clk_below_host_limit_thm, *_gfx_clk_below_host_limit_total values!\nGfx clock below host limit violation % (greater than 0% is a violation); Max uint64 means unsupported."]
    pub per_gfx_clk_below_host_limit: u64,
    #[doc = "!< Processor hot violation; 1 = active 0 = not active; Max uint8 means unsupported"]
    pub active_prochot_thrm: u8,
    #[doc = "!< Package Power Tracking (PPT) violation; 1 = active 0 = not active; Max uint8 means unsupported"]
    pub active_ppt_pwr: u8,
    #[doc = "!< Socket thermal violation; 1 = active 0 = not active; Max uint8 means unsupported"]
    pub active_socket_thrm: u8,
    #[doc = "!< Voltage regulator violation; 1 = active 0 = not active; Max uint8 means unsupported"]
    pub active_vr_thrm: u8,
    #[doc = "!< High Bandwidth Memory (HBM) thermal violation; 1 = active 0 = not active; Max uint8 means unsupported"]
    pub active_hbm_thrm: u8,
    #[doc = "< UPDATED in new driver 1.8: use new *_gfx_clk_below_host_limit_total values!\nGfx clock below host limit violation; 1 = active 0 = not active; Max uint8 means unsupported."]
    pub active_gfx_clk_below_host_limit: u8,
    #[doc = "!< New Driver 1.8 fields: Current gfx clock below host limit power count; Max uint64 means unsupported"]
    pub acc_gfx_clk_below_host_limit_pwr: [[u64; 8usize]; 8usize],
    #[doc = "!< New Driver 1.8 fields: Current gfx clock below host limit thermal count; Max uint64 means unsupported"]
    pub acc_gfx_clk_below_host_limit_thm: [[u64; 8usize]; 8usize],
    #[doc = "!< New Driver 1.8 fields: Current low utilization count; Max uint64 means unsupported"]
    pub acc_low_utilization: [[u64; 8usize]; 8usize],
    #[doc = "!< New Driver 1.8 fields: Current gfx clock below host limit total count; Max uint64 means unsupported"]
    pub acc_gfx_clk_below_host_limit_total: [[u64; 8usize]; 8usize],
    #[doc = "!< New Driver 1.8 fields: Gfx clock below host limit power violation % (greater than 0% is a violation); Max uint64 means unsupported"]
    pub per_gfx_clk_below_host_limit_pwr: [[u64; 8usize]; 8usize],
    #[doc = "!< New Driver 1.8 fields: Gfx clock below host limit violation % (greater than 0% is a violation); Max uint64 means unsupported"]
    pub per_gfx_clk_below_host_limit_thm: [[u64; 8usize]; 8usize],
    #[doc = "!< New Driver 1.8 fields: Low utilization violation % (greater than 0% is a violation); Max uint64 means unsupported"]
    pub per_low_utilization: [[u64; 8usize]; 8usize],
    #[doc = "!< New Driver 1.8 fields: Any Gfx clock below host limit violation % (greater than 0% is a violation); Max uint64 means unsupported"]
    pub per_gfx_clk_below_host_limit_total: [[u64; 8usize]; 8usize],
    #[doc = "!< New Driver 1.8 fields: Gfx clock below host limit power violation; 1 = active 0 = not active; Max uint8 means unsupported"]
    pub active_gfx_clk_below_host_limit_pwr: [[u8; 8usize]; 8usize],
    #[doc = "!< New Driver 1.8 fields: Gfx clock below host limit thermal violation; 1 = active 0 = not active; Max uint8 means unsupported"]
    pub active_gfx_clk_below_host_limit_thm: [[u8; 8usize]; 8usize],
    #[doc = "!< New Driver 1.8 fields: Low utilization violation; 1 = active 0 = not active; Max uint8 means unsupported"]
    pub active_low_utilization: [[u8; 8usize]; 8usize],
    #[doc = "!< New Driver 1.8 fields: Any Gfx clock host limit violation; 1 = active 0 = not active; Max uint8 means unsupported"]
    pub active_gfx_clk_below_host_limit_total: [[u8; 8usize]; 8usize],
    pub reserved: [[u64; 8usize]; 8usize],
    pub reserved2: [[u64; 8usize]; 8usize],
    pub reserved3: [[u64; 8usize]; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_violation_status_t"][::std::mem::size_of::<amdsmi_violation_status_t>() - 6016usize];
    ["Alignment of amdsmi_violation_status_t"][::std::mem::align_of::<amdsmi_violation_status_t>() - 8usize];
    ["Offset of field: amdsmi_violation_status_t::reference_timestamp"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, reference_timestamp) - 0usize];
    ["Offset of field: amdsmi_violation_status_t::violation_timestamp"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, violation_timestamp) - 8usize];
    ["Offset of field: amdsmi_violation_status_t::acc_counter"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, acc_counter) - 16usize];
    ["Offset of field: amdsmi_violation_status_t::acc_prochot_thrm"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, acc_prochot_thrm) - 24usize];
    ["Offset of field: amdsmi_violation_status_t::acc_ppt_pwr"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, acc_ppt_pwr) - 32usize];
    ["Offset of field: amdsmi_violation_status_t::acc_socket_thrm"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, acc_socket_thrm) - 40usize];
    ["Offset of field: amdsmi_violation_status_t::acc_vr_thrm"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, acc_vr_thrm) - 48usize];
    ["Offset of field: amdsmi_violation_status_t::acc_hbm_thrm"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, acc_hbm_thrm) - 56usize];
    ["Offset of field: amdsmi_violation_status_t::acc_gfx_clk_below_host_limit"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, acc_gfx_clk_below_host_limit) - 64usize];
    ["Offset of field: amdsmi_violation_status_t::per_prochot_thrm"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, per_prochot_thrm) - 72usize];
    ["Offset of field: amdsmi_violation_status_t::per_ppt_pwr"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, per_ppt_pwr) - 80usize];
    ["Offset of field: amdsmi_violation_status_t::per_socket_thrm"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, per_socket_thrm) - 88usize];
    ["Offset of field: amdsmi_violation_status_t::per_vr_thrm"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, per_vr_thrm) - 96usize];
    ["Offset of field: amdsmi_violation_status_t::per_hbm_thrm"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, per_hbm_thrm) - 104usize];
    ["Offset of field: amdsmi_violation_status_t::per_gfx_clk_below_host_limit"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, per_gfx_clk_below_host_limit) - 112usize];
    ["Offset of field: amdsmi_violation_status_t::active_prochot_thrm"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, active_prochot_thrm) - 120usize];
    ["Offset of field: amdsmi_violation_status_t::active_ppt_pwr"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, active_ppt_pwr) - 121usize];
    ["Offset of field: amdsmi_violation_status_t::active_socket_thrm"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, active_socket_thrm) - 122usize];
    ["Offset of field: amdsmi_violation_status_t::active_vr_thrm"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, active_vr_thrm) - 123usize];
    ["Offset of field: amdsmi_violation_status_t::active_hbm_thrm"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, active_hbm_thrm) - 124usize];
    ["Offset of field: amdsmi_violation_status_t::active_gfx_clk_below_host_limit"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, active_gfx_clk_below_host_limit) - 125usize];
    ["Offset of field: amdsmi_violation_status_t::acc_gfx_clk_below_host_limit_pwr"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, acc_gfx_clk_below_host_limit_pwr) - 128usize];
    ["Offset of field: amdsmi_violation_status_t::acc_gfx_clk_below_host_limit_thm"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, acc_gfx_clk_below_host_limit_thm) - 640usize];
    ["Offset of field: amdsmi_violation_status_t::acc_low_utilization"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, acc_low_utilization) - 1152usize];
    ["Offset of field: amdsmi_violation_status_t::acc_gfx_clk_below_host_limit_total"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, acc_gfx_clk_below_host_limit_total) - 1664usize];
    ["Offset of field: amdsmi_violation_status_t::per_gfx_clk_below_host_limit_pwr"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, per_gfx_clk_below_host_limit_pwr) - 2176usize];
    ["Offset of field: amdsmi_violation_status_t::per_gfx_clk_below_host_limit_thm"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, per_gfx_clk_below_host_limit_thm) - 2688usize];
    ["Offset of field: amdsmi_violation_status_t::per_low_utilization"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, per_low_utilization) - 3200usize];
    ["Offset of field: amdsmi_violation_status_t::per_gfx_clk_below_host_limit_total"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, per_gfx_clk_below_host_limit_total) - 3712usize];
    ["Offset of field: amdsmi_violation_status_t::active_gfx_clk_below_host_limit_pwr"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, active_gfx_clk_below_host_limit_pwr) - 4224usize];
    ["Offset of field: amdsmi_violation_status_t::active_gfx_clk_below_host_limit_thm"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, active_gfx_clk_below_host_limit_thm) - 4288usize];
    ["Offset of field: amdsmi_violation_status_t::active_low_utilization"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, active_low_utilization) - 4352usize];
    ["Offset of field: amdsmi_violation_status_t::active_gfx_clk_below_host_limit_total"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, active_gfx_clk_below_host_limit_total) - 4416usize];
    ["Offset of field: amdsmi_violation_status_t::reserved"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, reserved) - 4480usize];
    ["Offset of field: amdsmi_violation_status_t::reserved2"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, reserved2) - 4992usize];
    ["Offset of field: amdsmi_violation_status_t::reserved3"]
        [::std::mem::offset_of!(amdsmi_violation_status_t, reserved3) - 5504usize];
};
#[doc = " @brief Frequency Range\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_frequency_range_t {
    #[doc = "!< In MHz"]
    pub supported_freq_range: amdsmi_range_t,
    #[doc = "!< In MHz"]
    pub current_freq_range: amdsmi_range_t,
    pub reserved: [u32; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_frequency_range_t"][::std::mem::size_of::<amdsmi_frequency_range_t>() - 96usize];
    ["Alignment of amdsmi_frequency_range_t"][::std::mem::align_of::<amdsmi_frequency_range_t>() - 8usize];
    ["Offset of field: amdsmi_frequency_range_t::supported_freq_range"]
        [::std::mem::offset_of!(amdsmi_frequency_range_t, supported_freq_range) - 0usize];
    ["Offset of field: amdsmi_frequency_range_t::current_freq_range"]
        [::std::mem::offset_of!(amdsmi_frequency_range_t, current_freq_range) - 32usize];
    ["Offset of field: amdsmi_frequency_range_t::reserved"]
        [::std::mem::offset_of!(amdsmi_frequency_range_t, reserved) - 64usize];
};
#[doc = " @brief bdf types\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union amdsmi_bdf_t {
    pub bdf: amdsmi_bdf_t_bdf_,
    pub __bindgen_anon_1: amdsmi_bdf_t__bindgen_ty_1,
    pub as_uint: u64,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_bdf_t_bdf_ {
    pub _bitfield_align_1: [u64; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_bdf_t_bdf_"][::std::mem::size_of::<amdsmi_bdf_t_bdf_>() - 8usize];
    ["Alignment of amdsmi_bdf_t_bdf_"][::std::mem::align_of::<amdsmi_bdf_t_bdf_>() - 8usize];
};
impl amdsmi_bdf_t_bdf_ {
    #[inline]
    pub fn function_number(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u64) }
    }
    #[inline]
    pub fn set_function_number(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn function_number_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                3u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_function_number_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn device_number(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 5u8) as u64) }
    }
    #[inline]
    pub fn set_device_number(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn device_number_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                5u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_device_number_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn bus_number(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u64) }
    }
    #[inline]
    pub fn set_bus_number(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn bus_number_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                8u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_bus_number_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn domain_number(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 48u8) as u64) }
    }
    #[inline]
    pub fn set_domain_number(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 48u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn domain_number_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                48u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_domain_number_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                48u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        function_number: u64,
        device_number: u64,
        bus_number: u64,
        domain_number: u64,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let function_number: u64 = unsafe { ::std::mem::transmute(function_number) };
            function_number as u64
        });
        __bindgen_bitfield_unit.set(3usize, 5u8, {
            let device_number: u64 = unsafe { ::std::mem::transmute(device_number) };
            device_number as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let bus_number: u64 = unsafe { ::std::mem::transmute(bus_number) };
            bus_number as u64
        });
        __bindgen_bitfield_unit.set(16usize, 48u8, {
            let domain_number: u64 = unsafe { ::std::mem::transmute(domain_number) };
            domain_number as u64
        });
        __bindgen_bitfield_unit
    }
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_bdf_t__bindgen_ty_1 {
    pub _bitfield_align_1: [u64; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 8usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_bdf_t__bindgen_ty_1"][::std::mem::size_of::<amdsmi_bdf_t__bindgen_ty_1>() - 8usize];
    ["Alignment of amdsmi_bdf_t__bindgen_ty_1"][::std::mem::align_of::<amdsmi_bdf_t__bindgen_ty_1>() - 8usize];
};
impl amdsmi_bdf_t__bindgen_ty_1 {
    #[inline]
    pub fn function_number(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 3u8) as u64) }
    }
    #[inline]
    pub fn set_function_number(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 3u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn function_number_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                3u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_function_number_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                3u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn device_number(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 5u8) as u64) }
    }
    #[inline]
    pub fn set_device_number(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 5u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn device_number_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                5u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_device_number_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                5u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn bus_number(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(8usize, 8u8) as u64) }
    }
    #[inline]
    pub fn set_bus_number(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(8usize, 8u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn bus_number_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                8usize,
                8u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_bus_number_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                8usize,
                8u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn domain_number(&self) -> u64 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(16usize, 48u8) as u64) }
    }
    #[inline]
    pub fn set_domain_number(&mut self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            self._bitfield_1.set(16usize, 48u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn domain_number_raw(this: *const Self) -> u64 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 8usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                16usize,
                48u8,
            ) as u64)
        }
    }
    #[inline]
    pub unsafe fn set_domain_number_raw(this: *mut Self, val: u64) {
        unsafe {
            let val: u64 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 8usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                16usize,
                48u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        function_number: u64,
        device_number: u64,
        bus_number: u64,
        domain_number: u64,
    ) -> __BindgenBitfieldUnit<[u8; 8usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 8usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 3u8, {
            let function_number: u64 = unsafe { ::std::mem::transmute(function_number) };
            function_number as u64
        });
        __bindgen_bitfield_unit.set(3usize, 5u8, {
            let device_number: u64 = unsafe { ::std::mem::transmute(device_number) };
            device_number as u64
        });
        __bindgen_bitfield_unit.set(8usize, 8u8, {
            let bus_number: u64 = unsafe { ::std::mem::transmute(bus_number) };
            bus_number as u64
        });
        __bindgen_bitfield_unit.set(16usize, 48u8, {
            let domain_number: u64 = unsafe { ::std::mem::transmute(domain_number) };
            domain_number as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_bdf_t"][::std::mem::size_of::<amdsmi_bdf_t>() - 8usize];
    ["Alignment of amdsmi_bdf_t"][::std::mem::align_of::<amdsmi_bdf_t>() - 8usize];
    ["Offset of field: amdsmi_bdf_t::bdf"][::std::mem::offset_of!(amdsmi_bdf_t, bdf) - 0usize];
    ["Offset of field: amdsmi_bdf_t::as_uint"][::std::mem::offset_of!(amdsmi_bdf_t, as_uint) - 0usize];
};
#[doc = " @brief Structure holds enumeration information\n\n @cond @tag{gpu_bm_linux} @tag{guest_1vf} @tag{guest_mvf} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_enumeration_info_t {
    #[doc = "!< the render node under /sys/class/drm/renderD*"]
    pub drm_render: u32,
    #[doc = "!< the graphic card device under /sys/class/drm/card*"]
    pub drm_card: u32,
    #[doc = "!< the HSA enumeration ID"]
    pub hsa_id: u32,
    #[doc = "!< the HIP enumeration ID"]
    pub hip_id: u32,
    #[doc = "!< the HIP unique identifer"]
    pub hip_uuid: [::std::os::raw::c_char; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_enumeration_info_t"][::std::mem::size_of::<amdsmi_enumeration_info_t>() - 272usize];
    ["Alignment of amdsmi_enumeration_info_t"][::std::mem::align_of::<amdsmi_enumeration_info_t>() - 4usize];
    ["Offset of field: amdsmi_enumeration_info_t::drm_render"]
        [::std::mem::offset_of!(amdsmi_enumeration_info_t, drm_render) - 0usize];
    ["Offset of field: amdsmi_enumeration_info_t::drm_card"]
        [::std::mem::offset_of!(amdsmi_enumeration_info_t, drm_card) - 4usize];
    ["Offset of field: amdsmi_enumeration_info_t::hsa_id"]
        [::std::mem::offset_of!(amdsmi_enumeration_info_t, hsa_id) - 8usize];
    ["Offset of field: amdsmi_enumeration_info_t::hip_id"]
        [::std::mem::offset_of!(amdsmi_enumeration_info_t, hip_id) - 12usize];
    ["Offset of field: amdsmi_enumeration_info_t::hip_uuid"]
        [::std::mem::offset_of!(amdsmi_enumeration_info_t, hip_uuid) - 16usize];
};
#[doc = "!< PCIE card form factor"]
pub const amdsmi_card_form_factor_t_AMDSMI_CARD_FORM_FACTOR_PCIE: amdsmi_card_form_factor_t = 0;
#[doc = "!< OAM form factor"]
pub const amdsmi_card_form_factor_t_AMDSMI_CARD_FORM_FACTOR_OAM: amdsmi_card_form_factor_t = 1;
#[doc = "!< CEM form factor"]
pub const amdsmi_card_form_factor_t_AMDSMI_CARD_FORM_FACTOR_CEM: amdsmi_card_form_factor_t = 2;
#[doc = "!< Unknown Form factor"]
pub const amdsmi_card_form_factor_t_AMDSMI_CARD_FORM_FACTOR_UNKNOWN: amdsmi_card_form_factor_t = 3;
#[doc = " @brief Card Form Factor\n\n @cond @tag{gpu_bm_linux} @tag{host} @tag{guest_windows} @endcond"]
pub type amdsmi_card_form_factor_t = ::std::os::raw::c_uint;
#[doc = " @brief pcie information\n\n @cond @tag{gpu_bm_linux} @tag{host} @tag{guest_windows} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_pcie_info_t {
    pub pcie_static: amdsmi_pcie_info_t_pcie_static_,
    pub pcie_metric: amdsmi_pcie_info_t_pcie_metric_,
    pub reserved: [u64; 32usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_pcie_info_t_pcie_static_ {
    #[doc = "!< maximum number of PCIe lanes"]
    pub max_pcie_width: u16,
    #[doc = "!< maximum PCIe speed in GT/s"]
    pub max_pcie_speed: u32,
    #[doc = "!< PCIe interface version"]
    pub pcie_interface_version: u32,
    #[doc = "!< card form factor"]
    pub slot_type: amdsmi_card_form_factor_t,
    #[doc = "!< maximum PCIe link generation"]
    pub max_pcie_interface_version: u32,
    pub reserved: [u64; 9usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_pcie_info_t_pcie_static_"][::std::mem::size_of::<amdsmi_pcie_info_t_pcie_static_>() - 96usize];
    ["Alignment of amdsmi_pcie_info_t_pcie_static_"]
        [::std::mem::align_of::<amdsmi_pcie_info_t_pcie_static_>() - 8usize];
    ["Offset of field: amdsmi_pcie_info_t_pcie_static_::max_pcie_width"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t_pcie_static_, max_pcie_width) - 0usize];
    ["Offset of field: amdsmi_pcie_info_t_pcie_static_::max_pcie_speed"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t_pcie_static_, max_pcie_speed) - 4usize];
    ["Offset of field: amdsmi_pcie_info_t_pcie_static_::pcie_interface_version"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t_pcie_static_, pcie_interface_version) - 8usize];
    ["Offset of field: amdsmi_pcie_info_t_pcie_static_::slot_type"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t_pcie_static_, slot_type) - 12usize];
    ["Offset of field: amdsmi_pcie_info_t_pcie_static_::max_pcie_interface_version"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t_pcie_static_, max_pcie_interface_version) - 16usize];
    ["Offset of field: amdsmi_pcie_info_t_pcie_static_::reserved"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t_pcie_static_, reserved) - 24usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_pcie_info_t_pcie_metric_ {
    #[doc = "!< current PCIe width"]
    pub pcie_width: u16,
    #[doc = "!< current PCIe speed in MT/s"]
    pub pcie_speed: u32,
    #[doc = "!< current instantaneous PCIe bandwidth in Mb/s"]
    pub pcie_bandwidth: u32,
    #[doc = "!< total number of the replays issued on the PCIe link"]
    pub pcie_replay_count: u64,
    #[doc = "!< total number of times the PCIe link transitioned from L0 to the recovery state"]
    pub pcie_l0_to_recovery_count: u64,
    #[doc = "!< total number of replay rollovers issued on the PCIe link"]
    pub pcie_replay_roll_over_count: u64,
    #[doc = "!< total number of NAKs issued on the PCIe link by the device"]
    pub pcie_nak_sent_count: u64,
    #[doc = "!< total number of NAKs issued on the PCIe link by the receiver"]
    pub pcie_nak_received_count: u64,
    #[doc = "!< PCIe other end recovery counter"]
    pub pcie_lc_perf_other_end_recovery_count: u32,
    pub reserved: [u64; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_pcie_info_t_pcie_metric_"][::std::mem::size_of::<amdsmi_pcie_info_t_pcie_metric_>() - 160usize];
    ["Alignment of amdsmi_pcie_info_t_pcie_metric_"]
        [::std::mem::align_of::<amdsmi_pcie_info_t_pcie_metric_>() - 8usize];
    ["Offset of field: amdsmi_pcie_info_t_pcie_metric_::pcie_width"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t_pcie_metric_, pcie_width) - 0usize];
    ["Offset of field: amdsmi_pcie_info_t_pcie_metric_::pcie_speed"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t_pcie_metric_, pcie_speed) - 4usize];
    ["Offset of field: amdsmi_pcie_info_t_pcie_metric_::pcie_bandwidth"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t_pcie_metric_, pcie_bandwidth) - 8usize];
    ["Offset of field: amdsmi_pcie_info_t_pcie_metric_::pcie_replay_count"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t_pcie_metric_, pcie_replay_count) - 16usize];
    ["Offset of field: amdsmi_pcie_info_t_pcie_metric_::pcie_l0_to_recovery_count"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t_pcie_metric_, pcie_l0_to_recovery_count) - 24usize];
    ["Offset of field: amdsmi_pcie_info_t_pcie_metric_::pcie_replay_roll_over_count"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t_pcie_metric_, pcie_replay_roll_over_count) - 32usize];
    ["Offset of field: amdsmi_pcie_info_t_pcie_metric_::pcie_nak_sent_count"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t_pcie_metric_, pcie_nak_sent_count) - 40usize];
    ["Offset of field: amdsmi_pcie_info_t_pcie_metric_::pcie_nak_received_count"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t_pcie_metric_, pcie_nak_received_count) - 48usize];
    ["Offset of field: amdsmi_pcie_info_t_pcie_metric_::pcie_lc_perf_other_end_recovery_count"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t_pcie_metric_, pcie_lc_perf_other_end_recovery_count) - 56usize];
    ["Offset of field: amdsmi_pcie_info_t_pcie_metric_::reserved"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t_pcie_metric_, reserved) - 64usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_pcie_info_t"][::std::mem::size_of::<amdsmi_pcie_info_t>() - 512usize];
    ["Alignment of amdsmi_pcie_info_t"][::std::mem::align_of::<amdsmi_pcie_info_t>() - 8usize];
    ["Offset of field: amdsmi_pcie_info_t::pcie_static"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t, pcie_static) - 0usize];
    ["Offset of field: amdsmi_pcie_info_t::pcie_metric"]
        [::std::mem::offset_of!(amdsmi_pcie_info_t, pcie_metric) - 96usize];
    ["Offset of field: amdsmi_pcie_info_t::reserved"][::std::mem::offset_of!(amdsmi_pcie_info_t, reserved) - 256usize];
};
#[doc = " @brief Power Cap Information\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_power_cap_info_t {
    #[doc = "!< current power cap Units uW {@linux_bm} or W {@host}"]
    pub power_cap: u64,
    #[doc = "!< default power cap Units uW {@linux_bm} or W {@host}"]
    pub default_power_cap: u64,
    #[doc = "!< dpm power cap Units MHz {@linux_bm} or Hz {@host}"]
    pub dpm_cap: u64,
    #[doc = "!< minimum power cap Units uW {@linux_bm} or W {@host}"]
    pub min_power_cap: u64,
    #[doc = "!< maximum power cap Units uW {@linux_bm} or W {@host}"]
    pub max_power_cap: u64,
    pub reserved: [u64; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_power_cap_info_t"][::std::mem::size_of::<amdsmi_power_cap_info_t>() - 64usize];
    ["Alignment of amdsmi_power_cap_info_t"][::std::mem::align_of::<amdsmi_power_cap_info_t>() - 8usize];
    ["Offset of field: amdsmi_power_cap_info_t::power_cap"]
        [::std::mem::offset_of!(amdsmi_power_cap_info_t, power_cap) - 0usize];
    ["Offset of field: amdsmi_power_cap_info_t::default_power_cap"]
        [::std::mem::offset_of!(amdsmi_power_cap_info_t, default_power_cap) - 8usize];
    ["Offset of field: amdsmi_power_cap_info_t::dpm_cap"]
        [::std::mem::offset_of!(amdsmi_power_cap_info_t, dpm_cap) - 16usize];
    ["Offset of field: amdsmi_power_cap_info_t::min_power_cap"]
        [::std::mem::offset_of!(amdsmi_power_cap_info_t, min_power_cap) - 24usize];
    ["Offset of field: amdsmi_power_cap_info_t::max_power_cap"]
        [::std::mem::offset_of!(amdsmi_power_cap_info_t, max_power_cap) - 32usize];
    ["Offset of field: amdsmi_power_cap_info_t::reserved"]
        [::std::mem::offset_of!(amdsmi_power_cap_info_t, reserved) - 40usize];
};
#[doc = "!< PPT0 power cap; lower limit, filtered input"]
pub const amdsmi_power_cap_type_t_AMDSMI_POWER_CAP_TYPE_PPT0: amdsmi_power_cap_type_t = 0;
#[doc = "!< PPT1 power cap; higher limit, raw input"]
pub const amdsmi_power_cap_type_t_AMDSMI_POWER_CAP_TYPE_PPT1: amdsmi_power_cap_type_t = 1;
#[doc = " @brief Power Cap Package Power Tracking (PPT) type\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
pub type amdsmi_power_cap_type_t = ::std::os::raw::c_uint;
#[doc = " @brief VBios Information\n\n @cond @tag{gpu_bm_linux} @tag{guest_windows} @tag{host} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_vbios_info_t {
    pub name: [::std::os::raw::c_char; 256usize],
    pub build_date: [::std::os::raw::c_char; 256usize],
    pub part_number: [::std::os::raw::c_char; 256usize],
    pub version: [::std::os::raw::c_char; 256usize],
    pub boot_firmware: [::std::os::raw::c_char; 256usize],
    pub reserved: [u64; 36usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_vbios_info_t"][::std::mem::size_of::<amdsmi_vbios_info_t>() - 1568usize];
    ["Alignment of amdsmi_vbios_info_t"][::std::mem::align_of::<amdsmi_vbios_info_t>() - 8usize];
    ["Offset of field: amdsmi_vbios_info_t::name"][::std::mem::offset_of!(amdsmi_vbios_info_t, name) - 0usize];
    ["Offset of field: amdsmi_vbios_info_t::build_date"]
        [::std::mem::offset_of!(amdsmi_vbios_info_t, build_date) - 256usize];
    ["Offset of field: amdsmi_vbios_info_t::part_number"]
        [::std::mem::offset_of!(amdsmi_vbios_info_t, part_number) - 512usize];
    ["Offset of field: amdsmi_vbios_info_t::version"][::std::mem::offset_of!(amdsmi_vbios_info_t, version) - 768usize];
    ["Offset of field: amdsmi_vbios_info_t::boot_firmware"]
        [::std::mem::offset_of!(amdsmi_vbios_info_t, boot_firmware) - 1024usize];
    ["Offset of field: amdsmi_vbios_info_t::reserved"]
        [::std::mem::offset_of!(amdsmi_vbios_info_t, reserved) - 1280usize];
};
#[doc = "!< Cache enabled"]
pub const amdsmi_cache_property_type_t_AMDSMI_CACHE_PROPERTY_ENABLED: amdsmi_cache_property_type_t = 1;
#[doc = "!< Data cache"]
pub const amdsmi_cache_property_type_t_AMDSMI_CACHE_PROPERTY_DATA_CACHE: amdsmi_cache_property_type_t = 2;
#[doc = "!< Instruction cache"]
pub const amdsmi_cache_property_type_t_AMDSMI_CACHE_PROPERTY_INST_CACHE: amdsmi_cache_property_type_t = 4;
#[doc = "!< CPU cache"]
pub const amdsmi_cache_property_type_t_AMDSMI_CACHE_PROPERTY_CPU_CACHE: amdsmi_cache_property_type_t = 8;
#[doc = "!< Single Instruction, Multiple Data Cache"]
pub const amdsmi_cache_property_type_t_AMDSMI_CACHE_PROPERTY_SIMD_CACHE: amdsmi_cache_property_type_t = 16;
#[doc = " @brief cache properties\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
pub type amdsmi_cache_property_type_t = ::std::os::raw::c_uint;
#[doc = " @brief GPU Cache Information\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_gpu_cache_info_t {
    pub num_cache_types: u32,
    pub cache: [amdsmi_gpu_cache_info_t_cache_; 10usize],
    pub reserved: [u32; 15usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_gpu_cache_info_t_cache_ {
    #[doc = "!< amdsmi_cache_property_type_t which is a bitmask"]
    pub cache_properties: u32,
    #[doc = "!< In KB"]
    pub cache_size: u32,
    pub cache_level: u32,
    #[doc = "!< Indicates how many Compute Units share this cache instance"]
    pub max_num_cu_shared: u32,
    #[doc = "!< total number of instance of this cache type"]
    pub num_cache_instance: u32,
    pub reserved: [u32; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_gpu_cache_info_t_cache_"][::std::mem::size_of::<amdsmi_gpu_cache_info_t_cache_>() - 32usize];
    ["Alignment of amdsmi_gpu_cache_info_t_cache_"][::std::mem::align_of::<amdsmi_gpu_cache_info_t_cache_>() - 4usize];
    ["Offset of field: amdsmi_gpu_cache_info_t_cache_::cache_properties"]
        [::std::mem::offset_of!(amdsmi_gpu_cache_info_t_cache_, cache_properties) - 0usize];
    ["Offset of field: amdsmi_gpu_cache_info_t_cache_::cache_size"]
        [::std::mem::offset_of!(amdsmi_gpu_cache_info_t_cache_, cache_size) - 4usize];
    ["Offset of field: amdsmi_gpu_cache_info_t_cache_::cache_level"]
        [::std::mem::offset_of!(amdsmi_gpu_cache_info_t_cache_, cache_level) - 8usize];
    ["Offset of field: amdsmi_gpu_cache_info_t_cache_::max_num_cu_shared"]
        [::std::mem::offset_of!(amdsmi_gpu_cache_info_t_cache_, max_num_cu_shared) - 12usize];
    ["Offset of field: amdsmi_gpu_cache_info_t_cache_::num_cache_instance"]
        [::std::mem::offset_of!(amdsmi_gpu_cache_info_t_cache_, num_cache_instance) - 16usize];
    ["Offset of field: amdsmi_gpu_cache_info_t_cache_::reserved"]
        [::std::mem::offset_of!(amdsmi_gpu_cache_info_t_cache_, reserved) - 20usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_gpu_cache_info_t"][::std::mem::size_of::<amdsmi_gpu_cache_info_t>() - 384usize];
    ["Alignment of amdsmi_gpu_cache_info_t"][::std::mem::align_of::<amdsmi_gpu_cache_info_t>() - 4usize];
    ["Offset of field: amdsmi_gpu_cache_info_t::num_cache_types"]
        [::std::mem::offset_of!(amdsmi_gpu_cache_info_t, num_cache_types) - 0usize];
    ["Offset of field: amdsmi_gpu_cache_info_t::cache"]
        [::std::mem::offset_of!(amdsmi_gpu_cache_info_t, cache) - 4usize];
    ["Offset of field: amdsmi_gpu_cache_info_t::reserved"]
        [::std::mem::offset_of!(amdsmi_gpu_cache_info_t, reserved) - 324usize];
};
#[doc = " @brief Firmware Information\n\n @cond @tag{gpu_bm_linux} @tag{host} @tag{guest_windows} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_fw_info_t {
    pub num_fw_info: u8,
    pub fw_info_list: [amdsmi_fw_info_t_fw_info_list_; 80usize],
    pub reserved: [u32; 7usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_fw_info_t_fw_info_list_ {
    pub fw_id: amdsmi_fw_block_t,
    pub fw_version: u64,
    pub reserved: [u64; 2usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_fw_info_t_fw_info_list_"][::std::mem::size_of::<amdsmi_fw_info_t_fw_info_list_>() - 32usize];
    ["Alignment of amdsmi_fw_info_t_fw_info_list_"][::std::mem::align_of::<amdsmi_fw_info_t_fw_info_list_>() - 8usize];
    ["Offset of field: amdsmi_fw_info_t_fw_info_list_::fw_id"]
        [::std::mem::offset_of!(amdsmi_fw_info_t_fw_info_list_, fw_id) - 0usize];
    ["Offset of field: amdsmi_fw_info_t_fw_info_list_::fw_version"]
        [::std::mem::offset_of!(amdsmi_fw_info_t_fw_info_list_, fw_version) - 8usize];
    ["Offset of field: amdsmi_fw_info_t_fw_info_list_::reserved"]
        [::std::mem::offset_of!(amdsmi_fw_info_t_fw_info_list_, reserved) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_fw_info_t"][::std::mem::size_of::<amdsmi_fw_info_t>() - 2600usize];
    ["Alignment of amdsmi_fw_info_t"][::std::mem::align_of::<amdsmi_fw_info_t>() - 8usize];
    ["Offset of field: amdsmi_fw_info_t::num_fw_info"][::std::mem::offset_of!(amdsmi_fw_info_t, num_fw_info) - 0usize];
    ["Offset of field: amdsmi_fw_info_t::fw_info_list"]
        [::std::mem::offset_of!(amdsmi_fw_info_t, fw_info_list) - 8usize];
    ["Offset of field: amdsmi_fw_info_t::reserved"][::std::mem::offset_of!(amdsmi_fw_info_t, reserved) - 2568usize];
};
#[doc = " @brief ASIC Information\n\n @cond @tag{gpu_bm_linux} @tag{guest_windows} @tag{host} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_asic_info_t {
    pub market_name: [::std::os::raw::c_char; 256usize],
    #[doc = "!< Use 32 bit to be compatible with other platform."]
    pub vendor_id: u32,
    pub vendor_name: [::std::os::raw::c_char; 256usize],
    #[doc = "!< The subsystem vendor ID"]
    pub subvendor_id: u32,
    #[doc = "!< The device ID of a GPU"]
    pub device_id: u64,
    #[doc = "!< The revision ID of a GPU"]
    pub rev_id: u32,
    pub asic_serial: [::std::os::raw::c_char; 256usize],
    #[doc = "!< 0xFFFFFFFF if not supported"]
    pub oam_id: u32,
    #[doc = "!< 0xFFFFFFFF if not supported"]
    pub num_of_compute_units: u32,
    #[doc = "!< 0xFFFFFFFFFFFFFFFF if not supported"]
    pub target_graphics_version: u64,
    pub subsystem_id: u32,
    #[doc = "!> The subsystem ID"]
    pub reserved: [u32; 21usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_asic_info_t"][::std::mem::size_of::<amdsmi_asic_info_t>() - 896usize];
    ["Alignment of amdsmi_asic_info_t"][::std::mem::align_of::<amdsmi_asic_info_t>() - 8usize];
    ["Offset of field: amdsmi_asic_info_t::market_name"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, market_name) - 0usize];
    ["Offset of field: amdsmi_asic_info_t::vendor_id"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, vendor_id) - 256usize];
    ["Offset of field: amdsmi_asic_info_t::vendor_name"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, vendor_name) - 260usize];
    ["Offset of field: amdsmi_asic_info_t::subvendor_id"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, subvendor_id) - 516usize];
    ["Offset of field: amdsmi_asic_info_t::device_id"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, device_id) - 520usize];
    ["Offset of field: amdsmi_asic_info_t::rev_id"][::std::mem::offset_of!(amdsmi_asic_info_t, rev_id) - 528usize];
    ["Offset of field: amdsmi_asic_info_t::asic_serial"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, asic_serial) - 532usize];
    ["Offset of field: amdsmi_asic_info_t::oam_id"][::std::mem::offset_of!(amdsmi_asic_info_t, oam_id) - 788usize];
    ["Offset of field: amdsmi_asic_info_t::num_of_compute_units"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, num_of_compute_units) - 792usize];
    ["Offset of field: amdsmi_asic_info_t::target_graphics_version"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, target_graphics_version) - 800usize];
    ["Offset of field: amdsmi_asic_info_t::subsystem_id"]
        [::std::mem::offset_of!(amdsmi_asic_info_t, subsystem_id) - 808usize];
    ["Offset of field: amdsmi_asic_info_t::reserved"][::std::mem::offset_of!(amdsmi_asic_info_t, reserved) - 812usize];
};
#[doc = " @brief Structure holds kfd information\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_kfd_info_t {
    #[doc = "!< 0xFFFFFFFFFFFFFFFF if not supported"]
    pub kfd_id: u64,
    #[doc = "!< 0xFFFFFFFF if not supported"]
    pub node_id: u32,
    #[doc = "!< 0xFFFFFFFF if not supported"]
    pub current_partition_id: u32,
    pub reserved: [u32; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_kfd_info_t"][::std::mem::size_of::<amdsmi_kfd_info_t>() - 64usize];
    ["Alignment of amdsmi_kfd_info_t"][::std::mem::align_of::<amdsmi_kfd_info_t>() - 8usize];
    ["Offset of field: amdsmi_kfd_info_t::kfd_id"][::std::mem::offset_of!(amdsmi_kfd_info_t, kfd_id) - 0usize];
    ["Offset of field: amdsmi_kfd_info_t::node_id"][::std::mem::offset_of!(amdsmi_kfd_info_t, node_id) - 8usize];
    ["Offset of field: amdsmi_kfd_info_t::current_partition_id"]
        [::std::mem::offset_of!(amdsmi_kfd_info_t, current_partition_id) - 12usize];
    ["Offset of field: amdsmi_kfd_info_t::reserved"][::std::mem::offset_of!(amdsmi_kfd_info_t, reserved) - 16usize];
};
#[doc = " @brief This union holds memory partition bitmask.\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
#[repr(C)]
#[derive(Copy, Clone)]
pub union amdsmi_nps_caps_t {
    pub nps_flags: amdsmi_nps_caps_t_nps_flags_,
    pub nps_cap_mask: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_nps_caps_t_nps_flags_ {
    pub _bitfield_align_1: [u32; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_nps_caps_t_nps_flags_"][::std::mem::size_of::<amdsmi_nps_caps_t_nps_flags_>() - 4usize];
    ["Alignment of amdsmi_nps_caps_t_nps_flags_"][::std::mem::align_of::<amdsmi_nps_caps_t_nps_flags_>() - 4usize];
};
impl amdsmi_nps_caps_t_nps_flags_ {
    #[inline]
    pub fn nps1_cap(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_nps1_cap(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn nps1_cap_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_nps1_cap_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn nps2_cap(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_nps2_cap(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn nps2_cap_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_nps2_cap_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn nps4_cap(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_nps4_cap(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn nps4_cap_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_nps4_cap_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn nps8_cap(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_nps8_cap(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn nps8_cap_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_nps8_cap_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(4usize, 28u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(4usize, 28u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn reserved_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                4usize,
                28u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_reserved_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                4usize,
                28u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        nps1_cap: u32,
        nps2_cap: u32,
        nps4_cap: u32,
        nps8_cap: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let nps1_cap: u32 = unsafe { ::std::mem::transmute(nps1_cap) };
            nps1_cap as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let nps2_cap: u32 = unsafe { ::std::mem::transmute(nps2_cap) };
            nps2_cap as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let nps4_cap: u32 = unsafe { ::std::mem::transmute(nps4_cap) };
            nps4_cap as u64
        });
        __bindgen_bitfield_unit.set(3usize, 1u8, {
            let nps8_cap: u32 = unsafe { ::std::mem::transmute(nps8_cap) };
            nps8_cap as u64
        });
        __bindgen_bitfield_unit.set(4usize, 28u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_nps_caps_t"][::std::mem::size_of::<amdsmi_nps_caps_t>() - 4usize];
    ["Alignment of amdsmi_nps_caps_t"][::std::mem::align_of::<amdsmi_nps_caps_t>() - 4usize];
    ["Offset of field: amdsmi_nps_caps_t::nps_flags"][::std::mem::offset_of!(amdsmi_nps_caps_t, nps_flags) - 0usize];
    ["Offset of field: amdsmi_nps_caps_t::nps_cap_mask"]
        [::std::mem::offset_of!(amdsmi_nps_caps_t, nps_cap_mask) - 0usize];
};
#[doc = " @brief Memory Partition Configuration.\n This structure is used to identify various memory partition configurations.\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct amdsmi_memory_partition_config_t {
    pub partition_caps: amdsmi_nps_caps_t,
    pub mp_mode: amdsmi_memory_partition_type_t,
    pub num_numa_ranges: u32,
    pub numa_range: [amdsmi_memory_partition_config_t_numa_range_; 32usize],
    pub reserved: [u64; 11usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_memory_partition_config_t_numa_range_ {
    pub memory_type: amdsmi_vram_type_t,
    pub start: u64,
    pub end: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_memory_partition_config_t_numa_range_"]
        [::std::mem::size_of::<amdsmi_memory_partition_config_t_numa_range_>() - 24usize];
    ["Alignment of amdsmi_memory_partition_config_t_numa_range_"]
        [::std::mem::align_of::<amdsmi_memory_partition_config_t_numa_range_>() - 8usize];
    ["Offset of field: amdsmi_memory_partition_config_t_numa_range_::memory_type"]
        [::std::mem::offset_of!(amdsmi_memory_partition_config_t_numa_range_, memory_type) - 0usize];
    ["Offset of field: amdsmi_memory_partition_config_t_numa_range_::start"]
        [::std::mem::offset_of!(amdsmi_memory_partition_config_t_numa_range_, start) - 8usize];
    ["Offset of field: amdsmi_memory_partition_config_t_numa_range_::end"]
        [::std::mem::offset_of!(amdsmi_memory_partition_config_t_numa_range_, end) - 16usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_memory_partition_config_t"][::std::mem::size_of::<amdsmi_memory_partition_config_t>() - 872usize];
    ["Alignment of amdsmi_memory_partition_config_t"]
        [::std::mem::align_of::<amdsmi_memory_partition_config_t>() - 8usize];
    ["Offset of field: amdsmi_memory_partition_config_t::partition_caps"]
        [::std::mem::offset_of!(amdsmi_memory_partition_config_t, partition_caps) - 0usize];
    ["Offset of field: amdsmi_memory_partition_config_t::mp_mode"]
        [::std::mem::offset_of!(amdsmi_memory_partition_config_t, mp_mode) - 4usize];
    ["Offset of field: amdsmi_memory_partition_config_t::num_numa_ranges"]
        [::std::mem::offset_of!(amdsmi_memory_partition_config_t, num_numa_ranges) - 8usize];
    ["Offset of field: amdsmi_memory_partition_config_t::numa_range"]
        [::std::mem::offset_of!(amdsmi_memory_partition_config_t, numa_range) - 16usize];
    ["Offset of field: amdsmi_memory_partition_config_t::reserved"]
        [::std::mem::offset_of!(amdsmi_memory_partition_config_t, reserved) - 784usize];
};
#[doc = " @brief Accelerator Partition Resource Profile\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct amdsmi_accelerator_partition_profile_t {
    #[doc = "!< SPX, DPX, QPX, CPX and so on"]
    pub profile_type: amdsmi_accelerator_partition_type_t,
    #[doc = "!< On MI300X: SPX=>1, DPX=>2, QPX=>4, CPX=>8; length of resources"]
    pub num_partitions: u32,
    #[doc = "!< Possible memory partition capabilities"]
    pub memory_caps: amdsmi_nps_caps_t,
    #[doc = "!< Index in the profiles array in amdsmi_accelerator_partition_profile_t"]
    pub profile_index: u32,
    #[doc = "!< length of index_of_resources_profile"]
    pub num_resources: u32,
    pub resources: [[u32; 32usize]; 8usize],
    pub reserved: [u64; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_accelerator_partition_profile_t"]
        [::std::mem::size_of::<amdsmi_accelerator_partition_profile_t>() - 1152usize];
    ["Alignment of amdsmi_accelerator_partition_profile_t"]
        [::std::mem::align_of::<amdsmi_accelerator_partition_profile_t>() - 8usize];
    ["Offset of field: amdsmi_accelerator_partition_profile_t::profile_type"]
        [::std::mem::offset_of!(amdsmi_accelerator_partition_profile_t, profile_type) - 0usize];
    ["Offset of field: amdsmi_accelerator_partition_profile_t::num_partitions"]
        [::std::mem::offset_of!(amdsmi_accelerator_partition_profile_t, num_partitions) - 4usize];
    ["Offset of field: amdsmi_accelerator_partition_profile_t::memory_caps"]
        [::std::mem::offset_of!(amdsmi_accelerator_partition_profile_t, memory_caps) - 8usize];
    ["Offset of field: amdsmi_accelerator_partition_profile_t::profile_index"]
        [::std::mem::offset_of!(amdsmi_accelerator_partition_profile_t, profile_index) - 12usize];
    ["Offset of field: amdsmi_accelerator_partition_profile_t::num_resources"]
        [::std::mem::offset_of!(amdsmi_accelerator_partition_profile_t, num_resources) - 16usize];
    ["Offset of field: amdsmi_accelerator_partition_profile_t::resources"]
        [::std::mem::offset_of!(amdsmi_accelerator_partition_profile_t, resources) - 20usize];
    ["Offset of field: amdsmi_accelerator_partition_profile_t::reserved"]
        [::std::mem::offset_of!(amdsmi_accelerator_partition_profile_t, reserved) - 1048usize];
};
#[doc = " @brief  Accelerator Partition Resources.\n This struct is used to identify various partition resource profiles.\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_accelerator_partition_resource_profile_t {
    pub profile_index: u32,
    pub resource_type: amdsmi_accelerator_partition_resource_type_t,
    #[doc = "!< Resources a partition can use, which may be shared"]
    pub partition_resource: u32,
    #[doc = "!< If it is greater than 1, then resource is shared."]
    pub num_partitions_share_resource: u32,
    pub reserved: [u64; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_accelerator_partition_resource_profile_t"]
        [::std::mem::size_of::<amdsmi_accelerator_partition_resource_profile_t>() - 64usize];
    ["Alignment of amdsmi_accelerator_partition_resource_profile_t"]
        [::std::mem::align_of::<amdsmi_accelerator_partition_resource_profile_t>() - 8usize];
    ["Offset of field: amdsmi_accelerator_partition_resource_profile_t::profile_index"]
        [::std::mem::offset_of!(amdsmi_accelerator_partition_resource_profile_t, profile_index) - 0usize];
    ["Offset of field: amdsmi_accelerator_partition_resource_profile_t::resource_type"]
        [::std::mem::offset_of!(amdsmi_accelerator_partition_resource_profile_t, resource_type) - 4usize];
    ["Offset of field: amdsmi_accelerator_partition_resource_profile_t::partition_resource"]
        [::std::mem::offset_of!(amdsmi_accelerator_partition_resource_profile_t, partition_resource) - 8usize];
    ["Offset of field: amdsmi_accelerator_partition_resource_profile_t::num_partitions_share_resource"][::std::mem::offset_of!(
        amdsmi_accelerator_partition_resource_profile_t,
        num_partitions_share_resource
    ) - 12usize];
    ["Offset of field: amdsmi_accelerator_partition_resource_profile_t::reserved"]
        [::std::mem::offset_of!(amdsmi_accelerator_partition_resource_profile_t, reserved) - 16usize];
};
#[doc = " @brief Accelerator Partition Profile Configurations\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct amdsmi_accelerator_partition_profile_config_t {
    #[doc = "!< The length of profiles array"]
    pub num_profiles: u32,
    pub num_resource_profiles: u32,
    pub resource_profiles: [amdsmi_accelerator_partition_resource_profile_t; 32usize],
    #[doc = "!< The index of the default profile in the profiles array"]
    pub default_profile_index: u32,
    pub profiles: [amdsmi_accelerator_partition_profile_t; 32usize],
    pub reserved: [u64; 30usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_accelerator_partition_profile_config_t"]
        [::std::mem::size_of::<amdsmi_accelerator_partition_profile_config_t>() - 39168usize];
    ["Alignment of amdsmi_accelerator_partition_profile_config_t"]
        [::std::mem::align_of::<amdsmi_accelerator_partition_profile_config_t>() - 8usize];
    ["Offset of field: amdsmi_accelerator_partition_profile_config_t::num_profiles"]
        [::std::mem::offset_of!(amdsmi_accelerator_partition_profile_config_t, num_profiles) - 0usize];
    ["Offset of field: amdsmi_accelerator_partition_profile_config_t::num_resource_profiles"]
        [::std::mem::offset_of!(amdsmi_accelerator_partition_profile_config_t, num_resource_profiles) - 4usize];
    ["Offset of field: amdsmi_accelerator_partition_profile_config_t::resource_profiles"]
        [::std::mem::offset_of!(amdsmi_accelerator_partition_profile_config_t, resource_profiles) - 8usize];
    ["Offset of field: amdsmi_accelerator_partition_profile_config_t::default_profile_index"]
        [::std::mem::offset_of!(amdsmi_accelerator_partition_profile_config_t, default_profile_index) - 2056usize];
    ["Offset of field: amdsmi_accelerator_partition_profile_config_t::profiles"]
        [::std::mem::offset_of!(amdsmi_accelerator_partition_profile_config_t, profiles) - 2064usize];
    ["Offset of field: amdsmi_accelerator_partition_profile_config_t::reserved"]
        [::std::mem::offset_of!(amdsmi_accelerator_partition_profile_config_t, reserved) - 38928usize];
};
#[doc = "!< Internal Link Type, within chip"]
pub const amdsmi_link_type_t_AMDSMI_LINK_TYPE_INTERNAL: amdsmi_link_type_t = 0;
#[doc = "!< Peripheral Component Interconnect Express Link Type"]
pub const amdsmi_link_type_t_AMDSMI_LINK_TYPE_PCIE: amdsmi_link_type_t = 1;
#[doc = "!< GPU Memory Interconnect (multi GPU communication)"]
pub const amdsmi_link_type_t_AMDSMI_LINK_TYPE_XGMI: amdsmi_link_type_t = 2;
#[doc = "!< Not Applicable Link Type"]
pub const amdsmi_link_type_t_AMDSMI_LINK_TYPE_NOT_APPLICABLE: amdsmi_link_type_t = 3;
#[doc = "!< Unknown Link Type"]
pub const amdsmi_link_type_t_AMDSMI_LINK_TYPE_UNKNOWN: amdsmi_link_type_t = 4;
#[doc = " @brief Link type\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
pub type amdsmi_link_type_t = ::std::os::raw::c_uint;
#[doc = " @brief This structure holds CPU utilization information.\n\n @cond @tag{cpu_bm} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_cpu_util_t {
    pub cpu_util_total: u32,
    pub cpu_util_user: u32,
    pub cpu_util_nice: u32,
    pub cpu_util_sys: u32,
    pub cpu_util_irq: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_cpu_util_t"][::std::mem::size_of::<amdsmi_cpu_util_t>() - 20usize];
    ["Alignment of amdsmi_cpu_util_t"][::std::mem::align_of::<amdsmi_cpu_util_t>() - 4usize];
    ["Offset of field: amdsmi_cpu_util_t::cpu_util_total"]
        [::std::mem::offset_of!(amdsmi_cpu_util_t, cpu_util_total) - 0usize];
    ["Offset of field: amdsmi_cpu_util_t::cpu_util_user"]
        [::std::mem::offset_of!(amdsmi_cpu_util_t, cpu_util_user) - 4usize];
    ["Offset of field: amdsmi_cpu_util_t::cpu_util_nice"]
        [::std::mem::offset_of!(amdsmi_cpu_util_t, cpu_util_nice) - 8usize];
    ["Offset of field: amdsmi_cpu_util_t::cpu_util_sys"]
        [::std::mem::offset_of!(amdsmi_cpu_util_t, cpu_util_sys) - 12usize];
    ["Offset of field: amdsmi_cpu_util_t::cpu_util_irq"]
        [::std::mem::offset_of!(amdsmi_cpu_util_t, cpu_util_irq) - 16usize];
};
#[doc = " @brief Link Metrics\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
#[repr(C)]
#[derive(Copy, Clone)]
pub struct amdsmi_link_metrics_t {
    #[doc = "!< number of links"]
    pub num_links: u32,
    pub links: [amdsmi_link_metrics_t__links; 64usize],
    pub reserved: [u64; 7usize],
}
#[repr(C)]
#[derive(Copy, Clone)]
pub struct amdsmi_link_metrics_t__links {
    #[doc = "!< bdf of the destination gpu"]
    pub bdf: amdsmi_bdf_t,
    #[doc = "!< current link speed in Gb/s"]
    pub bit_rate: u32,
    #[doc = "!< max bandwidth of the link in Gb/s"]
    pub max_bandwidth: u32,
    #[doc = "!< type of the link"]
    pub link_type: amdsmi_link_type_t,
    #[doc = "!< total data received for each link in KB"]
    pub read: u64,
    #[doc = "!< total data transfered for each link in KB"]
    pub write: u64,
    pub reserved: [u64; 1usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_link_metrics_t__links"][::std::mem::size_of::<amdsmi_link_metrics_t__links>() - 48usize];
    ["Alignment of amdsmi_link_metrics_t__links"][::std::mem::align_of::<amdsmi_link_metrics_t__links>() - 8usize];
    ["Offset of field: amdsmi_link_metrics_t__links::bdf"]
        [::std::mem::offset_of!(amdsmi_link_metrics_t__links, bdf) - 0usize];
    ["Offset of field: amdsmi_link_metrics_t__links::bit_rate"]
        [::std::mem::offset_of!(amdsmi_link_metrics_t__links, bit_rate) - 8usize];
    ["Offset of field: amdsmi_link_metrics_t__links::max_bandwidth"]
        [::std::mem::offset_of!(amdsmi_link_metrics_t__links, max_bandwidth) - 12usize];
    ["Offset of field: amdsmi_link_metrics_t__links::link_type"]
        [::std::mem::offset_of!(amdsmi_link_metrics_t__links, link_type) - 16usize];
    ["Offset of field: amdsmi_link_metrics_t__links::read"]
        [::std::mem::offset_of!(amdsmi_link_metrics_t__links, read) - 24usize];
    ["Offset of field: amdsmi_link_metrics_t__links::write"]
        [::std::mem::offset_of!(amdsmi_link_metrics_t__links, write) - 32usize];
    ["Offset of field: amdsmi_link_metrics_t__links::reserved"]
        [::std::mem::offset_of!(amdsmi_link_metrics_t__links, reserved) - 40usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_link_metrics_t"][::std::mem::size_of::<amdsmi_link_metrics_t>() - 3136usize];
    ["Alignment of amdsmi_link_metrics_t"][::std::mem::align_of::<amdsmi_link_metrics_t>() - 8usize];
    ["Offset of field: amdsmi_link_metrics_t::num_links"]
        [::std::mem::offset_of!(amdsmi_link_metrics_t, num_links) - 0usize];
    ["Offset of field: amdsmi_link_metrics_t::links"][::std::mem::offset_of!(amdsmi_link_metrics_t, links) - 8usize];
    ["Offset of field: amdsmi_link_metrics_t::reserved"]
        [::std::mem::offset_of!(amdsmi_link_metrics_t, reserved) - 3080usize];
};
#[doc = " @brief VRam Information\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_vram_info_t {
    pub vram_type: amdsmi_vram_type_t,
    pub vram_vendor: [::std::os::raw::c_char; 256usize],
    #[doc = "!< vram size in MB"]
    pub vram_size: u64,
    #[doc = "!< In bits"]
    pub vram_bit_width: u32,
    #[doc = "!< The VRAM max bandwidth at current memory clock (GB/s)"]
    pub vram_max_bandwidth: u64,
    pub reserved: [u64; 37usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_vram_info_t"][::std::mem::size_of::<amdsmi_vram_info_t>() - 584usize];
    ["Alignment of amdsmi_vram_info_t"][::std::mem::align_of::<amdsmi_vram_info_t>() - 8usize];
    ["Offset of field: amdsmi_vram_info_t::vram_type"][::std::mem::offset_of!(amdsmi_vram_info_t, vram_type) - 0usize];
    ["Offset of field: amdsmi_vram_info_t::vram_vendor"]
        [::std::mem::offset_of!(amdsmi_vram_info_t, vram_vendor) - 4usize];
    ["Offset of field: amdsmi_vram_info_t::vram_size"]
        [::std::mem::offset_of!(amdsmi_vram_info_t, vram_size) - 264usize];
    ["Offset of field: amdsmi_vram_info_t::vram_bit_width"]
        [::std::mem::offset_of!(amdsmi_vram_info_t, vram_bit_width) - 272usize];
    ["Offset of field: amdsmi_vram_info_t::vram_max_bandwidth"]
        [::std::mem::offset_of!(amdsmi_vram_info_t, vram_max_bandwidth) - 280usize];
    ["Offset of field: amdsmi_vram_info_t::reserved"][::std::mem::offset_of!(amdsmi_vram_info_t, reserved) - 288usize];
};
#[doc = " @brief Driver Information\n\n @cond @tag{gpu_bm_linux} @tag{guest_windows} @tag{host} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_driver_info_t {
    pub driver_version: [::std::os::raw::c_char; 256usize],
    pub driver_date: [::std::os::raw::c_char; 256usize],
    pub driver_name: [::std::os::raw::c_char; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_driver_info_t"][::std::mem::size_of::<amdsmi_driver_info_t>() - 768usize];
    ["Alignment of amdsmi_driver_info_t"][::std::mem::align_of::<amdsmi_driver_info_t>() - 1usize];
    ["Offset of field: amdsmi_driver_info_t::driver_version"]
        [::std::mem::offset_of!(amdsmi_driver_info_t, driver_version) - 0usize];
    ["Offset of field: amdsmi_driver_info_t::driver_date"]
        [::std::mem::offset_of!(amdsmi_driver_info_t, driver_date) - 256usize];
    ["Offset of field: amdsmi_driver_info_t::driver_name"]
        [::std::mem::offset_of!(amdsmi_driver_info_t, driver_name) - 512usize];
};
#[doc = " @brief Board Information\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_board_info_t {
    pub model_number: [::std::os::raw::c_char; 256usize],
    pub product_serial: [::std::os::raw::c_char; 256usize],
    pub fru_id: [::std::os::raw::c_char; 256usize],
    pub product_name: [::std::os::raw::c_char; 256usize],
    pub manufacturer_name: [::std::os::raw::c_char; 256usize],
    pub reserved: [u64; 64usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_board_info_t"][::std::mem::size_of::<amdsmi_board_info_t>() - 1792usize];
    ["Alignment of amdsmi_board_info_t"][::std::mem::align_of::<amdsmi_board_info_t>() - 8usize];
    ["Offset of field: amdsmi_board_info_t::model_number"]
        [::std::mem::offset_of!(amdsmi_board_info_t, model_number) - 0usize];
    ["Offset of field: amdsmi_board_info_t::product_serial"]
        [::std::mem::offset_of!(amdsmi_board_info_t, product_serial) - 256usize];
    ["Offset of field: amdsmi_board_info_t::fru_id"][::std::mem::offset_of!(amdsmi_board_info_t, fru_id) - 512usize];
    ["Offset of field: amdsmi_board_info_t::product_name"]
        [::std::mem::offset_of!(amdsmi_board_info_t, product_name) - 768usize];
    ["Offset of field: amdsmi_board_info_t::manufacturer_name"]
        [::std::mem::offset_of!(amdsmi_board_info_t, manufacturer_name) - 1024usize];
    ["Offset of field: amdsmi_board_info_t::reserved"]
        [::std::mem::offset_of!(amdsmi_board_info_t, reserved) - 1280usize];
};
#[doc = " @brief Power Information\n\n Unsupported struct members are set to UINT32_MAX\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_power_info_t {
    #[doc = "!< Socket power in W"]
    pub socket_power: u64,
    #[doc = "!< Current socket power in W, Mi 300+ Series cards"]
    pub current_socket_power: u32,
    #[doc = "!< Average socket power in W, Navi + Mi 200 and earlier Series cards"]
    pub average_socket_power: u32,
    #[doc = "!< GFX voltage measurement in mV"]
    pub gfx_voltage: u64,
    #[doc = "!< SOC voltage measurement in mV"]
    pub soc_voltage: u64,
    #[doc = "!< MEM voltage measurement in mV"]
    pub mem_voltage: u64,
    #[doc = "!< The power limit in W"]
    pub power_limit: u32,
    pub reserved: [u64; 18usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_power_info_t"][::std::mem::size_of::<amdsmi_power_info_t>() - 192usize];
    ["Alignment of amdsmi_power_info_t"][::std::mem::align_of::<amdsmi_power_info_t>() - 8usize];
    ["Offset of field: amdsmi_power_info_t::socket_power"]
        [::std::mem::offset_of!(amdsmi_power_info_t, socket_power) - 0usize];
    ["Offset of field: amdsmi_power_info_t::current_socket_power"]
        [::std::mem::offset_of!(amdsmi_power_info_t, current_socket_power) - 8usize];
    ["Offset of field: amdsmi_power_info_t::average_socket_power"]
        [::std::mem::offset_of!(amdsmi_power_info_t, average_socket_power) - 12usize];
    ["Offset of field: amdsmi_power_info_t::gfx_voltage"]
        [::std::mem::offset_of!(amdsmi_power_info_t, gfx_voltage) - 16usize];
    ["Offset of field: amdsmi_power_info_t::soc_voltage"]
        [::std::mem::offset_of!(amdsmi_power_info_t, soc_voltage) - 24usize];
    ["Offset of field: amdsmi_power_info_t::mem_voltage"]
        [::std::mem::offset_of!(amdsmi_power_info_t, mem_voltage) - 32usize];
    ["Offset of field: amdsmi_power_info_t::power_limit"]
        [::std::mem::offset_of!(amdsmi_power_info_t, power_limit) - 40usize];
    ["Offset of field: amdsmi_power_info_t::reserved"][::std::mem::offset_of!(amdsmi_power_info_t, reserved) - 48usize];
};
#[doc = " @brief Clock Information\n\n @cond @tag{gpu_bm_linux} @tag{guest_windows} @tag{host} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_clk_info_t {
    #[doc = "!< In MHz"]
    pub clk: u32,
    #[doc = "!< In MHz"]
    pub min_clk: u32,
    #[doc = "!< In MHz"]
    pub max_clk: u32,
    #[doc = "!< True/False"]
    pub clk_locked: u8,
    #[doc = "!< True/False"]
    pub clk_deep_sleep: u8,
    pub reserved: [u32; 4usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_clk_info_t"][::std::mem::size_of::<amdsmi_clk_info_t>() - 32usize];
    ["Alignment of amdsmi_clk_info_t"][::std::mem::align_of::<amdsmi_clk_info_t>() - 4usize];
    ["Offset of field: amdsmi_clk_info_t::clk"][::std::mem::offset_of!(amdsmi_clk_info_t, clk) - 0usize];
    ["Offset of field: amdsmi_clk_info_t::min_clk"][::std::mem::offset_of!(amdsmi_clk_info_t, min_clk) - 4usize];
    ["Offset of field: amdsmi_clk_info_t::max_clk"][::std::mem::offset_of!(amdsmi_clk_info_t, max_clk) - 8usize];
    ["Offset of field: amdsmi_clk_info_t::clk_locked"][::std::mem::offset_of!(amdsmi_clk_info_t, clk_locked) - 12usize];
    ["Offset of field: amdsmi_clk_info_t::clk_deep_sleep"]
        [::std::mem::offset_of!(amdsmi_clk_info_t, clk_deep_sleep) - 13usize];
    ["Offset of field: amdsmi_clk_info_t::reserved"][::std::mem::offset_of!(amdsmi_clk_info_t, reserved) - 16usize];
};
#[doc = " @brief Engine Usage\n amdsmi_engine_usage_t:\n This structure holds common\n GPU activity values seen in both BM or\n SRIOV\n\n @cond @tag{gpu_bm_linux} @tag{guest_windows} @tag{host} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_engine_usage_t {
    #[doc = "!< In %"]
    pub gfx_activity: u32,
    #[doc = "!< In %"]
    pub umc_activity: u32,
    #[doc = "!< In %"]
    pub mm_activity: u32,
    pub reserved: [u32; 13usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_engine_usage_t"][::std::mem::size_of::<amdsmi_engine_usage_t>() - 64usize];
    ["Alignment of amdsmi_engine_usage_t"][::std::mem::align_of::<amdsmi_engine_usage_t>() - 4usize];
    ["Offset of field: amdsmi_engine_usage_t::gfx_activity"]
        [::std::mem::offset_of!(amdsmi_engine_usage_t, gfx_activity) - 0usize];
    ["Offset of field: amdsmi_engine_usage_t::umc_activity"]
        [::std::mem::offset_of!(amdsmi_engine_usage_t, umc_activity) - 4usize];
    ["Offset of field: amdsmi_engine_usage_t::mm_activity"]
        [::std::mem::offset_of!(amdsmi_engine_usage_t, mm_activity) - 8usize];
    ["Offset of field: amdsmi_engine_usage_t::reserved"]
        [::std::mem::offset_of!(amdsmi_engine_usage_t, reserved) - 12usize];
};
#[doc = " @brief Process Handle\n\n @cond @tag{gpu_bm_linux} @tag{guest_windows} @endcond"]
pub type amdsmi_process_handle_t = u32;
#[doc = " @brief Process Information\n\n @cond @tag{gpu_bm_linux} @tag{guest_windows} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_proc_info_t {
    pub name: [::std::os::raw::c_char; 256usize],
    pub pid: amdsmi_process_handle_t,
    #[doc = "!< In Bytes"]
    pub mem: u64,
    #[doc = "!< time the process spends using these engines in ns"]
    pub engine_usage: amdsmi_proc_info_t_engine_usage_,
    #[doc = "!< In Bytes"]
    pub memory_usage: amdsmi_proc_info_t_memory_usage_,
    pub container_name: [::std::os::raw::c_char; 256usize],
    #[doc = "!< Num CUs utilized"]
    pub cu_occupancy: u32,
    #[doc = "!< Time that queues are evicted on a GPU in milliseconds"]
    pub evicted_time: u32,
    pub reserved: [u32; 10usize],
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_proc_info_t_engine_usage_ {
    #[doc = "!< In nano-secs"]
    pub gfx: u64,
    #[doc = "!< In nano-secs"]
    pub enc: u64,
    pub reserved: [u32; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_proc_info_t_engine_usage_"][::std::mem::size_of::<amdsmi_proc_info_t_engine_usage_>() - 64usize];
    ["Alignment of amdsmi_proc_info_t_engine_usage_"]
        [::std::mem::align_of::<amdsmi_proc_info_t_engine_usage_>() - 8usize];
    ["Offset of field: amdsmi_proc_info_t_engine_usage_::gfx"]
        [::std::mem::offset_of!(amdsmi_proc_info_t_engine_usage_, gfx) - 0usize];
    ["Offset of field: amdsmi_proc_info_t_engine_usage_::enc"]
        [::std::mem::offset_of!(amdsmi_proc_info_t_engine_usage_, enc) - 8usize];
    ["Offset of field: amdsmi_proc_info_t_engine_usage_::reserved"]
        [::std::mem::offset_of!(amdsmi_proc_info_t_engine_usage_, reserved) - 16usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_proc_info_t_memory_usage_ {
    #[doc = "!< In Bytes"]
    pub gtt_mem: u64,
    #[doc = "!< In Bytes"]
    pub cpu_mem: u64,
    #[doc = "!< In Bytes"]
    pub vram_mem: u64,
    pub reserved: [u32; 10usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_proc_info_t_memory_usage_"][::std::mem::size_of::<amdsmi_proc_info_t_memory_usage_>() - 64usize];
    ["Alignment of amdsmi_proc_info_t_memory_usage_"]
        [::std::mem::align_of::<amdsmi_proc_info_t_memory_usage_>() - 8usize];
    ["Offset of field: amdsmi_proc_info_t_memory_usage_::gtt_mem"]
        [::std::mem::offset_of!(amdsmi_proc_info_t_memory_usage_, gtt_mem) - 0usize];
    ["Offset of field: amdsmi_proc_info_t_memory_usage_::cpu_mem"]
        [::std::mem::offset_of!(amdsmi_proc_info_t_memory_usage_, cpu_mem) - 8usize];
    ["Offset of field: amdsmi_proc_info_t_memory_usage_::vram_mem"]
        [::std::mem::offset_of!(amdsmi_proc_info_t_memory_usage_, vram_mem) - 16usize];
    ["Offset of field: amdsmi_proc_info_t_memory_usage_::reserved"]
        [::std::mem::offset_of!(amdsmi_proc_info_t_memory_usage_, reserved) - 24usize];
};
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_proc_info_t"][::std::mem::size_of::<amdsmi_proc_info_t>() - 704usize];
    ["Alignment of amdsmi_proc_info_t"][::std::mem::align_of::<amdsmi_proc_info_t>() - 8usize];
    ["Offset of field: amdsmi_proc_info_t::name"][::std::mem::offset_of!(amdsmi_proc_info_t, name) - 0usize];
    ["Offset of field: amdsmi_proc_info_t::pid"][::std::mem::offset_of!(amdsmi_proc_info_t, pid) - 256usize];
    ["Offset of field: amdsmi_proc_info_t::mem"][::std::mem::offset_of!(amdsmi_proc_info_t, mem) - 264usize];
    ["Offset of field: amdsmi_proc_info_t::engine_usage"]
        [::std::mem::offset_of!(amdsmi_proc_info_t, engine_usage) - 272usize];
    ["Offset of field: amdsmi_proc_info_t::memory_usage"]
        [::std::mem::offset_of!(amdsmi_proc_info_t, memory_usage) - 336usize];
    ["Offset of field: amdsmi_proc_info_t::container_name"]
        [::std::mem::offset_of!(amdsmi_proc_info_t, container_name) - 400usize];
    ["Offset of field: amdsmi_proc_info_t::cu_occupancy"]
        [::std::mem::offset_of!(amdsmi_proc_info_t, cu_occupancy) - 656usize];
    ["Offset of field: amdsmi_proc_info_t::evicted_time"]
        [::std::mem::offset_of!(amdsmi_proc_info_t, evicted_time) - 660usize];
    ["Offset of field: amdsmi_proc_info_t::reserved"][::std::mem::offset_of!(amdsmi_proc_info_t, reserved) - 664usize];
};
#[doc = " @brief IO Link P2P Capability\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_p2p_capability_t {
    #[doc = "!< 1 = true, 0 = false, UINT8_MAX = Not defined"]
    pub is_iolink_coherent: u8,
    #[doc = "!< 1 = true, 0 = false, UINT8_MAX = Not defined"]
    pub is_iolink_atomics_32bit: u8,
    #[doc = "!< 1 = true, 0 = false, UINT8_MAX = Not defined"]
    pub is_iolink_atomics_64bit: u8,
    #[doc = "!< 1 = true, 0 = false, UINT8_MAX = Not defined"]
    pub is_iolink_dma: u8,
    #[doc = "!< 1 = true, 0 = false, UINT8_MAX = Not defined"]
    pub is_iolink_bi_directional: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_p2p_capability_t"][::std::mem::size_of::<amdsmi_p2p_capability_t>() - 5usize];
    ["Alignment of amdsmi_p2p_capability_t"][::std::mem::align_of::<amdsmi_p2p_capability_t>() - 1usize];
    ["Offset of field: amdsmi_p2p_capability_t::is_iolink_coherent"]
        [::std::mem::offset_of!(amdsmi_p2p_capability_t, is_iolink_coherent) - 0usize];
    ["Offset of field: amdsmi_p2p_capability_t::is_iolink_atomics_32bit"]
        [::std::mem::offset_of!(amdsmi_p2p_capability_t, is_iolink_atomics_32bit) - 1usize];
    ["Offset of field: amdsmi_p2p_capability_t::is_iolink_atomics_64bit"]
        [::std::mem::offset_of!(amdsmi_p2p_capability_t, is_iolink_atomics_64bit) - 2usize];
    ["Offset of field: amdsmi_p2p_capability_t::is_iolink_dma"]
        [::std::mem::offset_of!(amdsmi_p2p_capability_t, is_iolink_dma) - 3usize];
    ["Offset of field: amdsmi_p2p_capability_t::is_iolink_bi_directional"]
        [::std::mem::offset_of!(amdsmi_p2p_capability_t, is_iolink_bi_directional) - 4usize];
};
#[doc = "!< Performance level is \"auto\""]
pub const amdsmi_dev_perf_level_t_AMDSMI_DEV_PERF_LEVEL_AUTO: amdsmi_dev_perf_level_t = 0;
pub const amdsmi_dev_perf_level_t_AMDSMI_DEV_PERF_LEVEL_FIRST: amdsmi_dev_perf_level_t = 0;
#[doc = "!< Keep PowerPlay levels \"low\", regardless of workload"]
pub const amdsmi_dev_perf_level_t_AMDSMI_DEV_PERF_LEVEL_LOW: amdsmi_dev_perf_level_t = 1;
#[doc = "!< Keep PowerPlay levels \"high\", regardless of workload"]
pub const amdsmi_dev_perf_level_t_AMDSMI_DEV_PERF_LEVEL_HIGH: amdsmi_dev_perf_level_t = 2;
#[doc = "< Only use values defined by manually\nsetting the AMDSMI_CLK_TYPE_SYS speed"]
pub const amdsmi_dev_perf_level_t_AMDSMI_DEV_PERF_LEVEL_MANUAL: amdsmi_dev_perf_level_t = 3;
#[doc = "!< Stable power state with profiling clocks"]
pub const amdsmi_dev_perf_level_t_AMDSMI_DEV_PERF_LEVEL_STABLE_STD: amdsmi_dev_perf_level_t = 4;
#[doc = "!< Stable power state with peak clocks"]
pub const amdsmi_dev_perf_level_t_AMDSMI_DEV_PERF_LEVEL_STABLE_PEAK: amdsmi_dev_perf_level_t = 5;
#[doc = "!< Stable power state with minimum memory clock"]
pub const amdsmi_dev_perf_level_t_AMDSMI_DEV_PERF_LEVEL_STABLE_MIN_MCLK: amdsmi_dev_perf_level_t = 6;
#[doc = "!< Stable power state with minimum system clock"]
pub const amdsmi_dev_perf_level_t_AMDSMI_DEV_PERF_LEVEL_STABLE_MIN_SCLK: amdsmi_dev_perf_level_t = 7;
#[doc = "!< Performance determinism state"]
pub const amdsmi_dev_perf_level_t_AMDSMI_DEV_PERF_LEVEL_DETERMINISM: amdsmi_dev_perf_level_t = 8;
pub const amdsmi_dev_perf_level_t_AMDSMI_DEV_PERF_LEVEL_LAST: amdsmi_dev_perf_level_t = 8;
#[doc = "!< Unknown performance level"]
pub const amdsmi_dev_perf_level_t_AMDSMI_DEV_PERF_LEVEL_UNKNOWN: amdsmi_dev_perf_level_t = 256;
#[doc = " @brief PowerPlay performance levels\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_dev_perf_level_t = ::std::os::raw::c_uint;
#[doc = " @brief Handle to performance event counter\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_event_handle_t = usize;
#[doc = "!< Data Fabric (XGMI) related events"]
pub const amdsmi_event_group_t_AMDSMI_EVNT_GRP_XGMI: amdsmi_event_group_t = 0;
#[doc = "!< XGMI Outbound data"]
pub const amdsmi_event_group_t_AMDSMI_EVNT_GRP_XGMI_DATA_OUT: amdsmi_event_group_t = 10;
#[doc = "!< Unknown Event Group"]
pub const amdsmi_event_group_t_AMDSMI_EVNT_GRP_INVALID: amdsmi_event_group_t = 4294967295;
#[doc = " @brief Event Groups\n Enum denoting an event group. The value of the enum is the\n base value for all the event enums in the group.\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_event_group_t = ::std::os::raw::c_uint;
pub const amdsmi_event_type_t_AMDSMI_EVNT_FIRST: amdsmi_event_type_t = 0;
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_FIRST: amdsmi_event_type_t = 0;
#[doc = "!< NOPs sent to neighbor 0"]
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_0_NOP_TX: amdsmi_event_type_t = 0;
#[doc = "!< Outgoing requests to neighbor 0"]
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_0_REQUEST_TX: amdsmi_event_type_t = 1;
#[doc = "!< Outgoing responses to neighbor 0"]
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_0_RESPONSE_TX: amdsmi_event_type_t = 2;
#[doc = "!< Throughput = BEATS/time_running 10^9 bytes/sec"]
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_0_BEATS_TX: amdsmi_event_type_t = 3;
#[doc = "!< NOPs sent to neighbor 1"]
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_1_NOP_TX: amdsmi_event_type_t = 4;
#[doc = "!< Outgoing requests to neighbor 1"]
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_1_REQUEST_TX: amdsmi_event_type_t = 5;
#[doc = "!< Outgoing responses to neighbor 1"]
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_1_RESPONSE_TX: amdsmi_event_type_t = 6;
#[doc = "!< Data beats sent to neighbor 1; Each beat represents 32 bytes"]
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_1_BEATS_TX: amdsmi_event_type_t = 7;
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_LAST: amdsmi_event_type_t = 7;
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_DATA_OUT_FIRST: amdsmi_event_type_t = 10;
#[doc = "!< Outbound beats to neighbor 0"]
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_DATA_OUT_0: amdsmi_event_type_t = 10;
#[doc = "!< Outbound beats to neighbor 1"]
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_DATA_OUT_1: amdsmi_event_type_t = 11;
#[doc = "!< Outbound beats to neighbor 2"]
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_DATA_OUT_2: amdsmi_event_type_t = 12;
#[doc = "!< Outbound beats to neighbor 3"]
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_DATA_OUT_3: amdsmi_event_type_t = 13;
#[doc = "!< Outbound beats to neighbor 4"]
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_DATA_OUT_4: amdsmi_event_type_t = 14;
#[doc = "!< Outbound beats to neighbor 5"]
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_DATA_OUT_5: amdsmi_event_type_t = 15;
pub const amdsmi_event_type_t_AMDSMI_EVNT_XGMI_DATA_OUT_LAST: amdsmi_event_type_t = 15;
pub const amdsmi_event_type_t_AMDSMI_EVNT_LAST: amdsmi_event_type_t = 15;
#[doc = " @brief Event types\n Event type enum. Events belonging to a particular event group\n ::amdsmi_event_group_t should begin enumerating at the ::amdsmi_event_group_t\n value for that group.\n\n Data beats sent to neighbor 0; Each beat represents 32 bytes.<br><br>\n\n XGMI throughput can be calculated by multiplying a BEATs event\n such as ::AMDSMI_EVNT_XGMI_0_BEATS_TX by 32 and dividing by\n the time for which event collection occurred,\n ::amdsmi_counter_value_t.time_running (which is in nanoseconds). To get\n bytes per second, multiply this value by 10<sup>9</sup>.<br>\n <br>\n Throughput = BEATS/time_running * 10<sup>9</sup>  (bytes/second)<br>\n\n Events in the AMDSMI_EVNT_GRP_XGMI_DATA_OUT group measure\n the number of beats sent on an XGMI link. Each beat represents\n 32 bytes. AMDSMI_EVNT_XGMI_DATA_OUT_n represents the number of\n outbound beats (each representing 32 bytes) on link n.<br><br>\n\n XGMI throughput can be calculated by multiplying a event\n such as ::AMDSMI_EVNT_XGMI_DATA_OUT_n by 32 and dividing by\n the time for which event collection occurred,\n ::amdsmi_counter_value_t.time_running (which is in nanoseconds). To get\n bytes per second, multiply this value by 10<sup>9</sup>.<br>\n <br>\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_event_type_t = ::std::os::raw::c_uint;
#[doc = "!< Start the counter"]
pub const amdsmi_counter_command_t_AMDSMI_CNTR_CMD_START: amdsmi_counter_command_t = 0;
#[doc = "< Stop the counter; note that this should not\nbe used before reading"]
pub const amdsmi_counter_command_t_AMDSMI_CNTR_CMD_STOP: amdsmi_counter_command_t = 1;
#[doc = " @brief Event counter commands\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_counter_command_t = ::std::os::raw::c_uint;
#[doc = " @brief Counter value\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_counter_value_t {
    #[doc = "!< Counter value"]
    pub value: u64,
    #[doc = "!< Time that the counter was enabled in nanoseconds"]
    pub time_enabled: u64,
    #[doc = "!< Time that the counter was running in nanoseconds"]
    pub time_running: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_counter_value_t"][::std::mem::size_of::<amdsmi_counter_value_t>() - 24usize];
    ["Alignment of amdsmi_counter_value_t"][::std::mem::align_of::<amdsmi_counter_value_t>() - 8usize];
    ["Offset of field: amdsmi_counter_value_t::value"][::std::mem::offset_of!(amdsmi_counter_value_t, value) - 0usize];
    ["Offset of field: amdsmi_counter_value_t::time_enabled"]
        [::std::mem::offset_of!(amdsmi_counter_value_t, time_enabled) - 8usize];
    ["Offset of field: amdsmi_counter_value_t::time_running"]
        [::std::mem::offset_of!(amdsmi_counter_value_t, time_running) - 16usize];
};
#[doc = "!< No events"]
pub const amdsmi_evt_notification_type_t_AMDSMI_EVT_NOTIF_NONE: amdsmi_evt_notification_type_t = 0;
#[doc = "!< Virtual Memory Page Fault Event"]
pub const amdsmi_evt_notification_type_t_AMDSMI_EVT_NOTIF_VMFAULT: amdsmi_evt_notification_type_t = 1;
pub const amdsmi_evt_notification_type_t_AMDSMI_EVT_NOTIF_FIRST: amdsmi_evt_notification_type_t = 1;
#[doc = "!< thermal throttle"]
pub const amdsmi_evt_notification_type_t_AMDSMI_EVT_NOTIF_THERMAL_THROTTLE: amdsmi_evt_notification_type_t = 2;
#[doc = "!< pre-reset"]
pub const amdsmi_evt_notification_type_t_AMDSMI_EVT_NOTIF_GPU_PRE_RESET: amdsmi_evt_notification_type_t = 3;
#[doc = "!< post-reset"]
pub const amdsmi_evt_notification_type_t_AMDSMI_EVT_NOTIF_GPU_POST_RESET: amdsmi_evt_notification_type_t = 4;
#[doc = "!< migrate start"]
pub const amdsmi_evt_notification_type_t_AMDSMI_EVT_NOTIF_MIGRATE_START: amdsmi_evt_notification_type_t = 5;
#[doc = "!< migrate end"]
pub const amdsmi_evt_notification_type_t_AMDSMI_EVT_NOTIF_MIGRATE_END: amdsmi_evt_notification_type_t = 6;
#[doc = "!< page fault start"]
pub const amdsmi_evt_notification_type_t_AMDSMI_EVT_NOTIF_PAGE_FAULT_START: amdsmi_evt_notification_type_t = 7;
#[doc = "!< page fault end"]
pub const amdsmi_evt_notification_type_t_AMDSMI_EVT_NOTIF_PAGE_FAULT_END: amdsmi_evt_notification_type_t = 8;
#[doc = "!< queue eviction"]
pub const amdsmi_evt_notification_type_t_AMDSMI_EVT_NOTIF_QUEUE_EVICTION: amdsmi_evt_notification_type_t = 9;
#[doc = "!< queue restore"]
pub const amdsmi_evt_notification_type_t_AMDSMI_EVT_NOTIF_QUEUE_RESTORE: amdsmi_evt_notification_type_t = 10;
#[doc = "!< unmap from GPU"]
pub const amdsmi_evt_notification_type_t_AMDSMI_EVT_NOTIF_UNMAP_FROM_GPU: amdsmi_evt_notification_type_t = 11;
#[doc = "!< KFD process start"]
pub const amdsmi_evt_notification_type_t_AMDSMI_EVT_NOTIF_PROCESS_START: amdsmi_evt_notification_type_t = 12;
#[doc = "!< KFD process end"]
pub const amdsmi_evt_notification_type_t_AMDSMI_EVT_NOTIF_PROCESS_END: amdsmi_evt_notification_type_t = 13;
pub const amdsmi_evt_notification_type_t_AMDSMI_EVT_NOTIF_LAST: amdsmi_evt_notification_type_t = 13;
#[doc = " @brief Event notification event types\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_evt_notification_type_t = ::std::os::raw::c_uint;
#[doc = " @brief Event notification data returned from event notification API\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_evt_notification_data_t {
    #[doc = "!< Handler of device that corresponds to the event"]
    pub processor_handle: amdsmi_processor_handle,
    #[doc = "!< Event type"]
    pub event: amdsmi_evt_notification_type_t,
    #[doc = "!< Event message"]
    pub message: [::std::os::raw::c_char; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_evt_notification_data_t"][::std::mem::size_of::<amdsmi_evt_notification_data_t>() - 272usize];
    ["Alignment of amdsmi_evt_notification_data_t"][::std::mem::align_of::<amdsmi_evt_notification_data_t>() - 8usize];
    ["Offset of field: amdsmi_evt_notification_data_t::processor_handle"]
        [::std::mem::offset_of!(amdsmi_evt_notification_data_t, processor_handle) - 0usize];
    ["Offset of field: amdsmi_evt_notification_data_t::event"]
        [::std::mem::offset_of!(amdsmi_evt_notification_data_t, event) - 8usize];
    ["Offset of field: amdsmi_evt_notification_data_t::message"]
        [::std::mem::offset_of!(amdsmi_evt_notification_data_t, message) - 12usize];
};
#[doc = "!< Current temperature"]
pub const amdsmi_temperature_metric_t_AMDSMI_TEMP_CURRENT: amdsmi_temperature_metric_t = 0;
pub const amdsmi_temperature_metric_t_AMDSMI_TEMP_FIRST: amdsmi_temperature_metric_t = 0;
#[doc = "!< Max temperature"]
pub const amdsmi_temperature_metric_t_AMDSMI_TEMP_MAX: amdsmi_temperature_metric_t = 1;
#[doc = "!< Min temperature"]
pub const amdsmi_temperature_metric_t_AMDSMI_TEMP_MIN: amdsmi_temperature_metric_t = 2;
#[doc = "< Max limit hysteresis temperature\n(Absolute temperature, not a delta)"]
pub const amdsmi_temperature_metric_t_AMDSMI_TEMP_MAX_HYST: amdsmi_temperature_metric_t = 3;
#[doc = "< Min limit hysteresis temperature\n(Absolute temperature, not a delta)"]
pub const amdsmi_temperature_metric_t_AMDSMI_TEMP_MIN_HYST: amdsmi_temperature_metric_t = 4;
#[doc = "< Critical max limit temperature, typically\ngreater than max temperatures"]
pub const amdsmi_temperature_metric_t_AMDSMI_TEMP_CRITICAL: amdsmi_temperature_metric_t = 5;
#[doc = "< Critical hysteresis limit temperature\n(Absolute temperature, not a delta)"]
pub const amdsmi_temperature_metric_t_AMDSMI_TEMP_CRITICAL_HYST: amdsmi_temperature_metric_t = 6;
#[doc = "< Emergency max temperature, for chips\nsupporting more than two upper temperature\nlimits. Must be equal or greater than\ncorresponding temp_crit values"]
pub const amdsmi_temperature_metric_t_AMDSMI_TEMP_EMERGENCY: amdsmi_temperature_metric_t = 7;
#[doc = "< Emergency hysteresis limit temperature\n(Absolute temperature, not a delta)"]
pub const amdsmi_temperature_metric_t_AMDSMI_TEMP_EMERGENCY_HYST: amdsmi_temperature_metric_t = 8;
#[doc = "< Critical min temperature, typically\nlower than minimum temperatures"]
pub const amdsmi_temperature_metric_t_AMDSMI_TEMP_CRIT_MIN: amdsmi_temperature_metric_t = 9;
#[doc = "< Min Hysteresis critical limit temperature\n(Absolute temperature, not a delta)"]
pub const amdsmi_temperature_metric_t_AMDSMI_TEMP_CRIT_MIN_HYST: amdsmi_temperature_metric_t = 10;
#[doc = "< Temperature offset which is added to the\ntemperature reading by the chip"]
pub const amdsmi_temperature_metric_t_AMDSMI_TEMP_OFFSET: amdsmi_temperature_metric_t = 11;
#[doc = "!< Historical min temperature"]
pub const amdsmi_temperature_metric_t_AMDSMI_TEMP_LOWEST: amdsmi_temperature_metric_t = 12;
#[doc = "!< Historical max temperature"]
pub const amdsmi_temperature_metric_t_AMDSMI_TEMP_HIGHEST: amdsmi_temperature_metric_t = 13;
#[doc = "!< Shutdown temperature"]
pub const amdsmi_temperature_metric_t_AMDSMI_TEMP_SHUTDOWN: amdsmi_temperature_metric_t = 14;
pub const amdsmi_temperature_metric_t_AMDSMI_TEMP_LAST: amdsmi_temperature_metric_t = 14;
#[doc = " @brief Temperature Metrics. This enum is used to identify various\n temperature metrics. Corresponding values will be in Celcius\n\n @cond @tag{gpu_bm_linux} @tag{host} @tag{guest_windows} @endcond"]
pub type amdsmi_temperature_metric_t = ::std::os::raw::c_uint;
#[doc = "!< Voltage current value."]
pub const amdsmi_voltage_metric_t_AMDSMI_VOLT_CURRENT: amdsmi_voltage_metric_t = 0;
pub const amdsmi_voltage_metric_t_AMDSMI_VOLT_FIRST: amdsmi_voltage_metric_t = 0;
#[doc = "!< Voltage max value."]
pub const amdsmi_voltage_metric_t_AMDSMI_VOLT_MAX: amdsmi_voltage_metric_t = 1;
#[doc = "!< Voltage critical min value."]
pub const amdsmi_voltage_metric_t_AMDSMI_VOLT_MIN_CRIT: amdsmi_voltage_metric_t = 2;
#[doc = "!< Voltage min value."]
pub const amdsmi_voltage_metric_t_AMDSMI_VOLT_MIN: amdsmi_voltage_metric_t = 3;
#[doc = "!< Voltage critical max value."]
pub const amdsmi_voltage_metric_t_AMDSMI_VOLT_MAX_CRIT: amdsmi_voltage_metric_t = 4;
#[doc = "!< Average voltage."]
pub const amdsmi_voltage_metric_t_AMDSMI_VOLT_AVERAGE: amdsmi_voltage_metric_t = 5;
#[doc = "!< Historical minimum voltage."]
pub const amdsmi_voltage_metric_t_AMDSMI_VOLT_LOWEST: amdsmi_voltage_metric_t = 6;
#[doc = "!< Historical maximum voltage."]
pub const amdsmi_voltage_metric_t_AMDSMI_VOLT_HIGHEST: amdsmi_voltage_metric_t = 7;
pub const amdsmi_voltage_metric_t_AMDSMI_VOLT_LAST: amdsmi_voltage_metric_t = 7;
#[doc = " @brief Voltage Metrics.  This enum is used to identify various\n Volatge metrics. Corresponding values will be in millivolt.\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_voltage_metric_t = ::std::os::raw::c_uint;
pub const amdsmi_voltage_type_t_AMDSMI_VOLT_TYPE_FIRST: amdsmi_voltage_type_t = 0;
#[doc = "!< Vddgfx GPU voltage"]
pub const amdsmi_voltage_type_t_AMDSMI_VOLT_TYPE_VDDGFX: amdsmi_voltage_type_t = 0;
#[doc = "!< Voltage for VDDBOARD"]
pub const amdsmi_voltage_type_t_AMDSMI_VOLT_TYPE_VDDBOARD: amdsmi_voltage_type_t = 1;
pub const amdsmi_voltage_type_t_AMDSMI_VOLT_TYPE_LAST: amdsmi_voltage_type_t = 1;
#[doc = "!< Invalid type"]
pub const amdsmi_voltage_type_t_AMDSMI_VOLT_TYPE_INVALID: amdsmi_voltage_type_t = 4294967295;
#[doc = " @brief This ennumeration is used to indicate which type of\n voltage reading should be obtained.\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_voltage_type_t = ::std::os::raw::c_uint;
#[doc = "!< Custom Power Profile"]
pub const amdsmi_power_profile_preset_masks_t_AMDSMI_PWR_PROF_PRST_CUSTOM_MASK: amdsmi_power_profile_preset_masks_t = 1;
#[doc = "!< Video Power Profile"]
pub const amdsmi_power_profile_preset_masks_t_AMDSMI_PWR_PROF_PRST_VIDEO_MASK: amdsmi_power_profile_preset_masks_t = 2;
#[doc = "!< Power Saving Profile"]
pub const amdsmi_power_profile_preset_masks_t_AMDSMI_PWR_PROF_PRST_POWER_SAVING_MASK:
    amdsmi_power_profile_preset_masks_t = 4;
#[doc = "!< Compute Saving Profile"]
pub const amdsmi_power_profile_preset_masks_t_AMDSMI_PWR_PROF_PRST_COMPUTE_MASK: amdsmi_power_profile_preset_masks_t =
    8;
#[doc = "!< VR Power Profile"]
pub const amdsmi_power_profile_preset_masks_t_AMDSMI_PWR_PROF_PRST_VR_MASK: amdsmi_power_profile_preset_masks_t = 16;
#[doc = "!< 3D Full Screen Profile"]
pub const amdsmi_power_profile_preset_masks_t_AMDSMI_PWR_PROF_PRST_3D_FULL_SCR_MASK:
    amdsmi_power_profile_preset_masks_t = 32;
#[doc = "!< Default Boot Up Profile"]
pub const amdsmi_power_profile_preset_masks_t_AMDSMI_PWR_PROF_PRST_BOOTUP_DEFAULT: amdsmi_power_profile_preset_masks_t =
    64;
pub const amdsmi_power_profile_preset_masks_t_AMDSMI_PWR_PROF_PRST_LAST: amdsmi_power_profile_preset_masks_t = 64;
#[doc = "!< Invalid Power Profile"]
pub const amdsmi_power_profile_preset_masks_t_AMDSMI_PWR_PROF_PRST_INVALID: amdsmi_power_profile_preset_masks_t =
    18446744073709551615;
#[doc = " @brief Pre-set Profile Selections. These bitmasks can be AND'd with the\n ::amdsmi_power_profile_status_t.available_profiles returned from\n :: amdsmi_get_gpu_power_profile_presets to determine which power profiles\n are supported by the system.\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_power_profile_preset_masks_t = ::std::os::raw::c_ulong;
#[doc = "!< Invalid block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_INVALID: amdsmi_gpu_block_t = 0;
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_FIRST: amdsmi_gpu_block_t = 1;
#[doc = "!< UMC block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_UMC: amdsmi_gpu_block_t = 1;
#[doc = "!< SDMA block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_SDMA: amdsmi_gpu_block_t = 2;
#[doc = "!< GFX block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_GFX: amdsmi_gpu_block_t = 4;
#[doc = "!< MMHUB block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_MMHUB: amdsmi_gpu_block_t = 8;
#[doc = "!< ATHUB block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_ATHUB: amdsmi_gpu_block_t = 16;
#[doc = "!< PCIE_BIF block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_PCIE_BIF: amdsmi_gpu_block_t = 32;
#[doc = "!< HDP block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_HDP: amdsmi_gpu_block_t = 64;
#[doc = "!< XGMI block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_XGMI_WAFL: amdsmi_gpu_block_t = 128;
#[doc = "!< DF block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_DF: amdsmi_gpu_block_t = 256;
#[doc = "!< SMN block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_SMN: amdsmi_gpu_block_t = 512;
#[doc = "!< SEM block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_SEM: amdsmi_gpu_block_t = 1024;
#[doc = "!< MP0 block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_MP0: amdsmi_gpu_block_t = 2048;
#[doc = "!< MP1 block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_MP1: amdsmi_gpu_block_t = 4096;
#[doc = "!< Fuse block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_FUSE: amdsmi_gpu_block_t = 8192;
#[doc = "!< MCA block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_MCA: amdsmi_gpu_block_t = 16384;
#[doc = "!< VCN block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_VCN: amdsmi_gpu_block_t = 32768;
#[doc = "!< JPEG block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_JPEG: amdsmi_gpu_block_t = 65536;
#[doc = "!< IH block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_IH: amdsmi_gpu_block_t = 131072;
#[doc = "!< MPIO block"]
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_MPIO: amdsmi_gpu_block_t = 262144;
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_LAST: amdsmi_gpu_block_t = 262144;
pub const amdsmi_gpu_block_t_AMDSMI_GPU_BLOCK_RESERVED: amdsmi_gpu_block_t = 9223372036854775808;
#[doc = " @brief This enum is used to identify different GPU blocks.\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
pub type amdsmi_gpu_block_t = ::std::os::raw::c_ulong;
#[doc = "!< Min Clock value in MHz"]
pub const amdsmi_clk_limit_type_t_CLK_LIMIT_MIN: amdsmi_clk_limit_type_t = 0;
#[doc = "!< Max Clock value in MHz"]
pub const amdsmi_clk_limit_type_t_CLK_LIMIT_MAX: amdsmi_clk_limit_type_t = 1;
#[doc = " @brief The clk limit type\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_clk_limit_type_t = ::std::os::raw::c_uint;
#[doc = "!< CPER Non-Fatal Uncorrected severity"]
pub const amdsmi_cper_sev_t_AMDSMI_CPER_SEV_NON_FATAL_UNCORRECTED: amdsmi_cper_sev_t = 0;
#[doc = "!< CPER Fatal severity"]
pub const amdsmi_cper_sev_t_AMDSMI_CPER_SEV_FATAL: amdsmi_cper_sev_t = 1;
#[doc = "!< CPER Non-Fatal Corrected severity"]
pub const amdsmi_cper_sev_t_AMDSMI_CPER_SEV_NON_FATAL_CORRECTED: amdsmi_cper_sev_t = 2;
#[doc = "!< CPER severity Number"]
pub const amdsmi_cper_sev_t_AMDSMI_CPER_SEV_NUM: amdsmi_cper_sev_t = 3;
#[doc = "!< CPER Unused severity"]
pub const amdsmi_cper_sev_t_AMDSMI_CPER_SEV_UNUSED: amdsmi_cper_sev_t = 10;
#[doc = " @brief Cper sev\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
pub type amdsmi_cper_sev_t = ::std::os::raw::c_uint;
#[doc = "!< Corrected Memory Check"]
pub const amdsmi_cper_notify_type_t_AMDSMI_CPER_NOTIFY_TYPE_CMC: amdsmi_cper_notify_type_t = 4976123370175105969;
#[doc = "!< Corrected Platform Error"]
pub const amdsmi_cper_notify_type_t_AMDSMI_CPER_NOTIFY_TYPE_CPE: amdsmi_cper_notify_type_t = 5356425115412803478;
#[doc = "!< Machine Check Exception"]
pub const amdsmi_cper_notify_type_t_AMDSMI_CPER_NOTIFY_TYPE_MCE: amdsmi_cper_notify_type_t = 5531987820403847166;
#[doc = "!< PCI Express Error"]
pub const amdsmi_cper_notify_type_t_AMDSMI_CPER_NOTIFY_TYPE_PCIE: amdsmi_cper_notify_type_t = 5619395120325705759;
#[doc = "!< Initialization Error"]
pub const amdsmi_cper_notify_type_t_AMDSMI_CPER_NOTIFY_TYPE_INIT: amdsmi_cper_notify_type_t = 4992964802890589160;
#[doc = "!< Non_Maskable Interrupt"]
pub const amdsmi_cper_notify_type_t_AMDSMI_CPER_NOTIFY_TYPE_NMI: amdsmi_cper_notify_type_t = 4812579876830546431;
#[doc = "!< Boot Error"]
pub const amdsmi_cper_notify_type_t_AMDSMI_CPER_NOTIFY_TYPE_BOOT: amdsmi_cper_notify_type_t = 4655221457236894822;
#[doc = "!< Direct Memory Access Remapping Error"]
pub const amdsmi_cper_notify_type_t_AMDSMI_CPER_NOTIFY_TYPE_DMAR: amdsmi_cper_notify_type_t = 5487573144795207569;
#[doc = "!< System Error Architecture"]
pub const amdsmi_cper_notify_type_t_AMDSMI_CPER_NOTIFY_TYPE_SEA: amdsmi_cper_notify_type_t = 1289362001033197706;
#[doc = "!< System Error Interface"]
pub const amdsmi_cper_notify_type_t_AMDSMI_CPER_NOTIFY_TYPE_SEI: amdsmi_cper_notify_type_t = 5658685719731260545;
#[doc = "!< Platform Error Interface"]
pub const amdsmi_cper_notify_type_t_AMDSMI_CPER_NOTIFY_TYPE_PEI: amdsmi_cper_notify_type_t = 4761520883332928940;
#[doc = "!< Compute Express Link Component Error"]
pub const amdsmi_cper_notify_type_t_AMDSMI_CPER_NOTIFY_TYPE_CXL_COMPONENT: amdsmi_cper_notify_type_t =
    5306157213770398665;
#[doc = " @brief Cper notify\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
pub type amdsmi_cper_notify_type_t = ::std::os::raw::c_ulong;
#[doc = "!< No current errors"]
pub const amdsmi_ras_err_state_t_AMDSMI_RAS_ERR_STATE_NONE: amdsmi_ras_err_state_t = 0;
#[doc = "!< ECC is disabled"]
pub const amdsmi_ras_err_state_t_AMDSMI_RAS_ERR_STATE_DISABLED: amdsmi_ras_err_state_t = 1;
#[doc = "!< ECC errors present, but type unknown"]
pub const amdsmi_ras_err_state_t_AMDSMI_RAS_ERR_STATE_PARITY: amdsmi_ras_err_state_t = 2;
#[doc = "!< Single correctable error"]
pub const amdsmi_ras_err_state_t_AMDSMI_RAS_ERR_STATE_SING_C: amdsmi_ras_err_state_t = 3;
#[doc = "!< Multiple uncorrectable errors"]
pub const amdsmi_ras_err_state_t_AMDSMI_RAS_ERR_STATE_MULT_UC: amdsmi_ras_err_state_t = 4;
#[doc = "< Firmware detected error and isolated\npage. Treat as uncorrectable"]
pub const amdsmi_ras_err_state_t_AMDSMI_RAS_ERR_STATE_POISON: amdsmi_ras_err_state_t = 5;
#[doc = "!< ECC is enabled"]
pub const amdsmi_ras_err_state_t_AMDSMI_RAS_ERR_STATE_ENABLED: amdsmi_ras_err_state_t = 6;
pub const amdsmi_ras_err_state_t_AMDSMI_RAS_ERR_STATE_LAST: amdsmi_ras_err_state_t = 6;
pub const amdsmi_ras_err_state_t_AMDSMI_RAS_ERR_STATE_INVALID: amdsmi_ras_err_state_t = 4294967295;
#[doc = " @brief The current ECC state\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_ras_err_state_t = ::std::os::raw::c_uint;
pub const amdsmi_memory_type_t_AMDSMI_MEM_TYPE_FIRST: amdsmi_memory_type_t = 0;
#[doc = "!< VRAM memory"]
pub const amdsmi_memory_type_t_AMDSMI_MEM_TYPE_VRAM: amdsmi_memory_type_t = 0;
#[doc = "!< VRAM memory that is visible"]
pub const amdsmi_memory_type_t_AMDSMI_MEM_TYPE_VIS_VRAM: amdsmi_memory_type_t = 1;
#[doc = "!< GTT memory"]
pub const amdsmi_memory_type_t_AMDSMI_MEM_TYPE_GTT: amdsmi_memory_type_t = 2;
pub const amdsmi_memory_type_t_AMDSMI_MEM_TYPE_LAST: amdsmi_memory_type_t = 2;
#[doc = " @brief Types of memory\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_memory_type_t = ::std::os::raw::c_uint;
#[doc = "!< Index used for the minimum frequency value"]
pub const amdsmi_freq_ind_t_AMDSMI_FREQ_IND_MIN: amdsmi_freq_ind_t = 0;
#[doc = "!< Index used for the maximum frequency value"]
pub const amdsmi_freq_ind_t_AMDSMI_FREQ_IND_MAX: amdsmi_freq_ind_t = 1;
#[doc = "!< An invalid frequency index"]
pub const amdsmi_freq_ind_t_AMDSMI_FREQ_IND_INVALID: amdsmi_freq_ind_t = 4294967295;
#[doc = " @brief The values of this enum are used as frequency identifiers.\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_freq_ind_t = ::std::os::raw::c_uint;
#[doc = "!< XGMI No Errors"]
pub const amdsmi_xgmi_status_t_AMDSMI_XGMI_STATUS_NO_ERRORS: amdsmi_xgmi_status_t = 0;
#[doc = "!< XGMI Errors"]
pub const amdsmi_xgmi_status_t_AMDSMI_XGMI_STATUS_ERROR: amdsmi_xgmi_status_t = 1;
#[doc = "!< XGMI Multiple Errors"]
pub const amdsmi_xgmi_status_t_AMDSMI_XGMI_STATUS_MULTIPLE_ERRORS: amdsmi_xgmi_status_t = 2;
#[doc = " @brief XGMI Status\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_xgmi_status_t = ::std::os::raw::c_uint;
#[doc = " @brief Bitfield used in various AMDSMI calls\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_bit_field_t = u64;
#[doc = "!< Reserved. This gpu page is reserved and not available for use"]
pub const amdsmi_memory_page_status_t_AMDSMI_MEM_PAGE_STATUS_RESERVED: amdsmi_memory_page_status_t = 0;
#[doc = "< Pending. This gpu page is marked as bad and will be marked\nreserved at the next window"]
pub const amdsmi_memory_page_status_t_AMDSMI_MEM_PAGE_STATUS_PENDING: amdsmi_memory_page_status_t = 1;
#[doc = "!< Unable to reserve this page"]
pub const amdsmi_memory_page_status_t_AMDSMI_MEM_PAGE_STATUS_UNRESERVABLE: amdsmi_memory_page_status_t = 2;
#[doc = " @brief Reserved Memory Page States\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_memory_page_status_t = ::std::os::raw::c_uint;
pub const amdsmi_utilization_counter_type_t_AMDSMI_UTILIZATION_COUNTER_FIRST: amdsmi_utilization_counter_type_t = 0;
#[doc = "!< Course Grain Graphic Activity"]
pub const amdsmi_utilization_counter_type_t_AMDSMI_COARSE_GRAIN_GFX_ACTIVITY: amdsmi_utilization_counter_type_t = 0;
#[doc = "!< Course Grain Memory Activity"]
pub const amdsmi_utilization_counter_type_t_AMDSMI_COARSE_GRAIN_MEM_ACTIVITY: amdsmi_utilization_counter_type_t = 1;
#[doc = "!< Course Grain Decoder Activity"]
pub const amdsmi_utilization_counter_type_t_AMDSMI_COARSE_DECODER_ACTIVITY: amdsmi_utilization_counter_type_t = 2;
#[doc = "!< Fine Grain Graphic Activity"]
pub const amdsmi_utilization_counter_type_t_AMDSMI_FINE_GRAIN_GFX_ACTIVITY: amdsmi_utilization_counter_type_t = 100;
#[doc = "!< Fine Grain Memory Activity"]
pub const amdsmi_utilization_counter_type_t_AMDSMI_FINE_GRAIN_MEM_ACTIVITY: amdsmi_utilization_counter_type_t = 101;
#[doc = "!< Fine Grain Decoder Activity"]
pub const amdsmi_utilization_counter_type_t_AMDSMI_FINE_DECODER_ACTIVITY: amdsmi_utilization_counter_type_t = 102;
pub const amdsmi_utilization_counter_type_t_AMDSMI_UTILIZATION_COUNTER_LAST: amdsmi_utilization_counter_type_t = 102;
#[doc = " @brief The utilization counter type\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_utilization_counter_type_t = ::std::os::raw::c_uint;
#[doc = " @brief The utilization counter data\n\n The max number of values per counter type\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_utilization_counter_t {
    #[doc = "!< Utilization counter type"]
    pub type_: amdsmi_utilization_counter_type_t,
    #[doc = "!< Coarse grain activity counter value (average)"]
    pub value: u64,
    #[doc = "!< Utilization counter value"]
    pub fine_value: [u64; 4usize],
    pub fine_value_count: u16,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_utilization_counter_t"][::std::mem::size_of::<amdsmi_utilization_counter_t>() - 56usize];
    ["Alignment of amdsmi_utilization_counter_t"][::std::mem::align_of::<amdsmi_utilization_counter_t>() - 8usize];
    ["Offset of field: amdsmi_utilization_counter_t::type_"]
        [::std::mem::offset_of!(amdsmi_utilization_counter_t, type_) - 0usize];
    ["Offset of field: amdsmi_utilization_counter_t::value"]
        [::std::mem::offset_of!(amdsmi_utilization_counter_t, value) - 8usize];
    ["Offset of field: amdsmi_utilization_counter_t::fine_value"]
        [::std::mem::offset_of!(amdsmi_utilization_counter_t, fine_value) - 16usize];
    ["Offset of field: amdsmi_utilization_counter_t::fine_value_count"]
        [::std::mem::offset_of!(amdsmi_utilization_counter_t, fine_value_count) - 48usize];
};
#[doc = " @brief Reserved Memory Page Record\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_retired_page_record_t {
    #[doc = "!< Start address of page"]
    pub page_address: u64,
    #[doc = "!< Page size"]
    pub page_size: u64,
    #[doc = "!< Page \"reserved\" status"]
    pub status: amdsmi_memory_page_status_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_retired_page_record_t"][::std::mem::size_of::<amdsmi_retired_page_record_t>() - 24usize];
    ["Alignment of amdsmi_retired_page_record_t"][::std::mem::align_of::<amdsmi_retired_page_record_t>() - 8usize];
    ["Offset of field: amdsmi_retired_page_record_t::page_address"]
        [::std::mem::offset_of!(amdsmi_retired_page_record_t, page_address) - 0usize];
    ["Offset of field: amdsmi_retired_page_record_t::page_size"]
        [::std::mem::offset_of!(amdsmi_retired_page_record_t, page_size) - 8usize];
    ["Offset of field: amdsmi_retired_page_record_t::status"]
        [::std::mem::offset_of!(amdsmi_retired_page_record_t, status) - 16usize];
};
#[doc = " @brief This structure contains information about which power profiles are\n supported by the system for a given device, and which power profile is\n currently active.\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_power_profile_status_t {
    #[doc = "!< Which profiles are supported by this system"]
    pub available_profiles: amdsmi_bit_field_t,
    #[doc = "!< Which power profile is currently active"]
    pub current: amdsmi_power_profile_preset_masks_t,
    #[doc = "!< How many power profiles are available"]
    pub num_profiles: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_power_profile_status_t"][::std::mem::size_of::<amdsmi_power_profile_status_t>() - 24usize];
    ["Alignment of amdsmi_power_profile_status_t"][::std::mem::align_of::<amdsmi_power_profile_status_t>() - 8usize];
    ["Offset of field: amdsmi_power_profile_status_t::available_profiles"]
        [::std::mem::offset_of!(amdsmi_power_profile_status_t, available_profiles) - 0usize];
    ["Offset of field: amdsmi_power_profile_status_t::current"]
        [::std::mem::offset_of!(amdsmi_power_profile_status_t, current) - 8usize];
    ["Offset of field: amdsmi_power_profile_status_t::num_profiles"]
        [::std::mem::offset_of!(amdsmi_power_profile_status_t, num_profiles) - 16usize];
};
#[doc = " @brief This structure holds information about clock frequencies.\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_frequencies_t {
    #[doc = "!< Deep Sleep frequency is only supported by some GPUs"]
    pub has_deep_sleep: bool,
    #[doc = "!< The number of supported frequencies"]
    pub num_supported: u32,
    #[doc = "!< The current frequency index in MHz"]
    pub current: u32,
    #[doc = "< List of frequencies in MHz.\nOnly the first num_supported frequencies are valid"]
    pub frequency: [u64; 33usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_frequencies_t"][::std::mem::size_of::<amdsmi_frequencies_t>() - 280usize];
    ["Alignment of amdsmi_frequencies_t"][::std::mem::align_of::<amdsmi_frequencies_t>() - 8usize];
    ["Offset of field: amdsmi_frequencies_t::has_deep_sleep"]
        [::std::mem::offset_of!(amdsmi_frequencies_t, has_deep_sleep) - 0usize];
    ["Offset of field: amdsmi_frequencies_t::num_supported"]
        [::std::mem::offset_of!(amdsmi_frequencies_t, num_supported) - 4usize];
    ["Offset of field: amdsmi_frequencies_t::current"][::std::mem::offset_of!(amdsmi_frequencies_t, current) - 8usize];
    ["Offset of field: amdsmi_frequencies_t::frequency"]
        [::std::mem::offset_of!(amdsmi_frequencies_t, frequency) - 16usize];
};
#[doc = " @brief The dpm policy.\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_dpm_policy_entry_t {
    pub policy_id: u32,
    pub policy_description: [::std::os::raw::c_char; 256usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_dpm_policy_entry_t"][::std::mem::size_of::<amdsmi_dpm_policy_entry_t>() - 260usize];
    ["Alignment of amdsmi_dpm_policy_entry_t"][::std::mem::align_of::<amdsmi_dpm_policy_entry_t>() - 4usize];
    ["Offset of field: amdsmi_dpm_policy_entry_t::policy_id"]
        [::std::mem::offset_of!(amdsmi_dpm_policy_entry_t, policy_id) - 0usize];
    ["Offset of field: amdsmi_dpm_policy_entry_t::policy_description"]
        [::std::mem::offset_of!(amdsmi_dpm_policy_entry_t, policy_description) - 4usize];
};
#[doc = " @brief DPM Policy\n\n Only the first num_supported policies are valid.\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_dpm_policy_t {
    #[doc = "!< The number of supported policies"]
    pub num_supported: u32,
    #[doc = "!< The current policy index"]
    pub current: u32,
    #[doc = "!< List of policies."]
    pub policies: [amdsmi_dpm_policy_entry_t; 32usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_dpm_policy_t"][::std::mem::size_of::<amdsmi_dpm_policy_t>() - 8328usize];
    ["Alignment of amdsmi_dpm_policy_t"][::std::mem::align_of::<amdsmi_dpm_policy_t>() - 4usize];
    ["Offset of field: amdsmi_dpm_policy_t::num_supported"]
        [::std::mem::offset_of!(amdsmi_dpm_policy_t, num_supported) - 0usize];
    ["Offset of field: amdsmi_dpm_policy_t::current"][::std::mem::offset_of!(amdsmi_dpm_policy_t, current) - 4usize];
    ["Offset of field: amdsmi_dpm_policy_t::policies"][::std::mem::offset_of!(amdsmi_dpm_policy_t, policies) - 8usize];
};
#[doc = " @brief This structure holds information about the possible PCIe\n bandwidths. Specifically, the possible transfer rates and their\n associated numbers of lanes are stored here.\n\n Only the first num_supported bandwidths are valid.\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_pcie_bandwidth_t {
    #[doc = "!< Transfer rates (T/s) that are possible"]
    pub transfer_rate: amdsmi_frequencies_t,
    #[doc = "!< List of lanes for corresponding transfer rate."]
    pub lanes: [u32; 33usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_pcie_bandwidth_t"][::std::mem::size_of::<amdsmi_pcie_bandwidth_t>() - 416usize];
    ["Alignment of amdsmi_pcie_bandwidth_t"][::std::mem::align_of::<amdsmi_pcie_bandwidth_t>() - 8usize];
    ["Offset of field: amdsmi_pcie_bandwidth_t::transfer_rate"]
        [::std::mem::offset_of!(amdsmi_pcie_bandwidth_t, transfer_rate) - 0usize];
    ["Offset of field: amdsmi_pcie_bandwidth_t::lanes"]
        [::std::mem::offset_of!(amdsmi_pcie_bandwidth_t, lanes) - 280usize];
};
#[doc = " @brief This structure holds version information.\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_version_t {
    #[doc = "!< Major version"]
    pub major: u32,
    #[doc = "!< Minor version"]
    pub minor: u32,
    #[doc = "!< Patch, build or stepping version"]
    pub release: u32,
    #[doc = "!< Full Build version string"]
    pub build: *const ::std::os::raw::c_char,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_version_t"][::std::mem::size_of::<amdsmi_version_t>() - 24usize];
    ["Alignment of amdsmi_version_t"][::std::mem::align_of::<amdsmi_version_t>() - 8usize];
    ["Offset of field: amdsmi_version_t::major"][::std::mem::offset_of!(amdsmi_version_t, major) - 0usize];
    ["Offset of field: amdsmi_version_t::minor"][::std::mem::offset_of!(amdsmi_version_t, minor) - 4usize];
    ["Offset of field: amdsmi_version_t::release"][::std::mem::offset_of!(amdsmi_version_t, release) - 8usize];
    ["Offset of field: amdsmi_version_t::build"][::std::mem::offset_of!(amdsmi_version_t, build) - 16usize];
};
#[doc = " @brief This structure represents a point on the frequency-voltage plane.\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_od_vddc_point_t {
    #[doc = "!< Frequency coordinate (in Hz)"]
    pub frequency: u64,
    #[doc = "!< Voltage coordinate (in mV)"]
    pub voltage: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_od_vddc_point_t"][::std::mem::size_of::<amdsmi_od_vddc_point_t>() - 16usize];
    ["Alignment of amdsmi_od_vddc_point_t"][::std::mem::align_of::<amdsmi_od_vddc_point_t>() - 8usize];
    ["Offset of field: amdsmi_od_vddc_point_t::frequency"]
        [::std::mem::offset_of!(amdsmi_od_vddc_point_t, frequency) - 0usize];
    ["Offset of field: amdsmi_od_vddc_point_t::voltage"]
        [::std::mem::offset_of!(amdsmi_od_vddc_point_t, voltage) - 8usize];
};
#[doc = " @brief This structure holds 2 ::amdsmi_range_t's, one for frequency and one for\n voltage. These 2 ranges indicate the range of possible values for the\n corresponding ::amdsmi_od_vddc_point_t.\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_freq_volt_region_t {
    #[doc = "!< The frequency range for this VDDC Curve point"]
    pub freq_range: amdsmi_range_t,
    #[doc = "!< The voltage range for this VDDC Curve point"]
    pub volt_range: amdsmi_range_t,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_freq_volt_region_t"][::std::mem::size_of::<amdsmi_freq_volt_region_t>() - 64usize];
    ["Alignment of amdsmi_freq_volt_region_t"][::std::mem::align_of::<amdsmi_freq_volt_region_t>() - 8usize];
    ["Offset of field: amdsmi_freq_volt_region_t::freq_range"]
        [::std::mem::offset_of!(amdsmi_freq_volt_region_t, freq_range) - 0usize];
    ["Offset of field: amdsmi_freq_volt_region_t::volt_range"]
        [::std::mem::offset_of!(amdsmi_freq_volt_region_t, volt_range) - 32usize];
};
#[doc = " @brief OD Vold Curve\n ::AMDSMI_NUM_VOLTAGE_CURVE_POINTS number of ::amdsmi_od_vddc_point_t's\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_od_volt_curve_t {
    #[doc = "!< make up the voltage frequency curve points."]
    pub vc_points: [amdsmi_od_vddc_point_t; 3usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_od_volt_curve_t"][::std::mem::size_of::<amdsmi_od_volt_curve_t>() - 48usize];
    ["Alignment of amdsmi_od_volt_curve_t"][::std::mem::align_of::<amdsmi_od_volt_curve_t>() - 8usize];
    ["Offset of field: amdsmi_od_volt_curve_t::vc_points"]
        [::std::mem::offset_of!(amdsmi_od_volt_curve_t, vc_points) - 0usize];
};
#[doc = " @brief This structure holds the frequency-voltage values for a device.\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_od_volt_freq_data_t {
    #[doc = "!< The current SCLK frequency range in MHz"]
    pub curr_sclk_range: amdsmi_range_t,
    #[doc = "!< The current MCLK frequency range, upper bound only in MHz"]
    pub curr_mclk_range: amdsmi_range_t,
    #[doc = "!< The range possible of SCLK values in MHz"]
    pub sclk_freq_limits: amdsmi_range_t,
    #[doc = "!< The range possible of MCLK values in MHz"]
    pub mclk_freq_limits: amdsmi_range_t,
    #[doc = "!< The current voltage curve"]
    pub curve: amdsmi_od_volt_curve_t,
    #[doc = "!< The number of voltage curve regions"]
    pub num_regions: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_od_volt_freq_data_t"][::std::mem::size_of::<amdsmi_od_volt_freq_data_t>() - 184usize];
    ["Alignment of amdsmi_od_volt_freq_data_t"][::std::mem::align_of::<amdsmi_od_volt_freq_data_t>() - 8usize];
    ["Offset of field: amdsmi_od_volt_freq_data_t::curr_sclk_range"]
        [::std::mem::offset_of!(amdsmi_od_volt_freq_data_t, curr_sclk_range) - 0usize];
    ["Offset of field: amdsmi_od_volt_freq_data_t::curr_mclk_range"]
        [::std::mem::offset_of!(amdsmi_od_volt_freq_data_t, curr_mclk_range) - 32usize];
    ["Offset of field: amdsmi_od_volt_freq_data_t::sclk_freq_limits"]
        [::std::mem::offset_of!(amdsmi_od_volt_freq_data_t, sclk_freq_limits) - 64usize];
    ["Offset of field: amdsmi_od_volt_freq_data_t::mclk_freq_limits"]
        [::std::mem::offset_of!(amdsmi_od_volt_freq_data_t, mclk_freq_limits) - 96usize];
    ["Offset of field: amdsmi_od_volt_freq_data_t::curve"]
        [::std::mem::offset_of!(amdsmi_od_volt_freq_data_t, curve) - 128usize];
    ["Offset of field: amdsmi_od_volt_freq_data_t::num_regions"]
        [::std::mem::offset_of!(amdsmi_od_volt_freq_data_t, num_regions) - 176usize];
};
#[doc = " @brief Structure holds the gpu metrics table header for a device\n\n Size and version information of metrics data\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amd_metrics_table_header_t {
    #[doc = " \\cond Ignore in docs."]
    pub structure_size: u16,
    pub format_revision: u8,
    pub content_revision: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amd_metrics_table_header_t"][::std::mem::size_of::<amd_metrics_table_header_t>() - 4usize];
    ["Alignment of amd_metrics_table_header_t"][::std::mem::align_of::<amd_metrics_table_header_t>() - 2usize];
    ["Offset of field: amd_metrics_table_header_t::structure_size"]
        [::std::mem::offset_of!(amd_metrics_table_header_t, structure_size) - 0usize];
    ["Offset of field: amd_metrics_table_header_t::format_revision"]
        [::std::mem::offset_of!(amd_metrics_table_header_t, format_revision) - 2usize];
    ["Offset of field: amd_metrics_table_header_t::content_revision"]
        [::std::mem::offset_of!(amd_metrics_table_header_t, content_revision) - 3usize];
};
#[doc = " @brief The following structures hold the gpu statistics for a device.\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_gpu_xcp_metrics_t {
    #[doc = "!< Utilization Instantaneous in %"]
    pub gfx_busy_inst: [u32; 8usize],
    #[doc = "!< Utilization Instantaneous in % (UPDATED: to 40 in v1.8)"]
    pub jpeg_busy: [u16; 40usize],
    #[doc = "!< Utilization Instantaneous in %"]
    pub vcn_busy: [u16; 4usize],
    #[doc = "!< Utilization Accumulated in %"]
    pub gfx_busy_acc: [u64; 8usize],
    #[doc = "!< Total App Clock Counter Accumulated"]
    pub gfx_below_host_limit_acc: [u64; 8usize],
    #[doc = " @brief v1.8 additions"]
    pub gfx_below_host_limit_ppt_acc: [u64; 8usize],
    pub gfx_below_host_limit_thm_acc: [u64; 8usize],
    pub gfx_low_utilization_acc: [u64; 8usize],
    pub gfx_below_host_limit_total_acc: [u64; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_gpu_xcp_metrics_t"][::std::mem::size_of::<amdsmi_gpu_xcp_metrics_t>() - 504usize];
    ["Alignment of amdsmi_gpu_xcp_metrics_t"][::std::mem::align_of::<amdsmi_gpu_xcp_metrics_t>() - 8usize];
    ["Offset of field: amdsmi_gpu_xcp_metrics_t::gfx_busy_inst"]
        [::std::mem::offset_of!(amdsmi_gpu_xcp_metrics_t, gfx_busy_inst) - 0usize];
    ["Offset of field: amdsmi_gpu_xcp_metrics_t::jpeg_busy"]
        [::std::mem::offset_of!(amdsmi_gpu_xcp_metrics_t, jpeg_busy) - 32usize];
    ["Offset of field: amdsmi_gpu_xcp_metrics_t::vcn_busy"]
        [::std::mem::offset_of!(amdsmi_gpu_xcp_metrics_t, vcn_busy) - 112usize];
    ["Offset of field: amdsmi_gpu_xcp_metrics_t::gfx_busy_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_xcp_metrics_t, gfx_busy_acc) - 120usize];
    ["Offset of field: amdsmi_gpu_xcp_metrics_t::gfx_below_host_limit_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_xcp_metrics_t, gfx_below_host_limit_acc) - 184usize];
    ["Offset of field: amdsmi_gpu_xcp_metrics_t::gfx_below_host_limit_ppt_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_xcp_metrics_t, gfx_below_host_limit_ppt_acc) - 248usize];
    ["Offset of field: amdsmi_gpu_xcp_metrics_t::gfx_below_host_limit_thm_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_xcp_metrics_t, gfx_below_host_limit_thm_acc) - 312usize];
    ["Offset of field: amdsmi_gpu_xcp_metrics_t::gfx_low_utilization_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_xcp_metrics_t, gfx_low_utilization_acc) - 376usize];
    ["Offset of field: amdsmi_gpu_xcp_metrics_t::gfx_below_host_limit_total_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_xcp_metrics_t, gfx_below_host_limit_total_acc) - 440usize];
};
#[doc = " @brief Structure holds the gpu metrics values for a device\n\n This structure is extended to fit the needs of different GPU metric\n versions when exposing data through the structure.\n Depending on the version, some data members will hold data, and\n some will not. A good example is the set of 'current clocks':\n current_gfxclk, current_socclk, current_vclk0, current_dclk0.\n These are single-valued data members, up to version 1.3.\n For version 1.4 and up these are multi-valued data members (arrays)\n and their counterparts; current_gfxclks[], current_socclks[],\n current_vclk0s[], current_dclk0s[], will hold the data\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_gpu_metrics_t {
    pub common_header: amd_metrics_table_header_t,
    #[doc = " @brief v1.0 Base\n\n Temperature in C"]
    pub temperature_edge: u16,
    pub temperature_hotspot: u16,
    pub temperature_mem: u16,
    pub temperature_vrgfx: u16,
    pub temperature_vrsoc: u16,
    pub temperature_vrmem: u16,
    #[doc = "!< gfx"]
    pub average_gfx_activity: u16,
    #[doc = "!< memory controller"]
    pub average_umc_activity: u16,
    #[doc = "!< UVD or VCN"]
    pub average_mm_activity: u16,
    #[doc = " @brief Power (W) /Energy (15.259uJ per 1ns)"]
    pub average_socket_power: u16,
    #[doc = "!< v1 mod. (32->64)"]
    pub energy_accumulator: u64,
    #[doc = "!< v1 mod. (moved from top of struct)"]
    pub system_clock_counter: u64,
    #[doc = " @brief Average clocks (MHz)"]
    pub average_gfxclk_frequency: u16,
    pub average_socclk_frequency: u16,
    pub average_uclk_frequency: u16,
    pub average_vclk0_frequency: u16,
    pub average_dclk0_frequency: u16,
    pub average_vclk1_frequency: u16,
    pub average_dclk1_frequency: u16,
    #[doc = " @brief Current clocks (MHz)"]
    pub current_gfxclk: u16,
    pub current_socclk: u16,
    pub current_uclk: u16,
    pub current_vclk0: u16,
    pub current_dclk0: u16,
    pub current_vclk1: u16,
    pub current_dclk1: u16,
    #[doc = "!< Throttle status"]
    pub throttle_status: u32,
    #[doc = "!< Fans (RPM)"]
    pub current_fan_speed: u16,
    #[doc = "!< v1 mod.(8->16)"]
    pub pcie_link_width: u16,
    #[doc = "!< in 0.1 GT/s; v1 mod. (8->16)"]
    pub pcie_link_speed: u16,
    #[doc = "!< new in v1"]
    pub gfx_activity_acc: u32,
    #[doc = "!< new in v1"]
    pub mem_activity_acc: u32,
    #[doc = "!< new in v1"]
    pub temperature_hbm: [u16; 4usize],
    #[doc = "!< PMFW attached timestamp (10ns resolution)"]
    pub firmware_timestamp: u64,
    #[doc = "!< In mV"]
    pub voltage_soc: u16,
    #[doc = "!< In mV"]
    pub voltage_gfx: u16,
    #[doc = "!< In mV"]
    pub voltage_mem: u16,
    #[doc = "!< Throttle status"]
    pub indep_throttle_status: u64,
    #[doc = "!< In Watts"]
    pub current_socket_power: u16,
    #[doc = "!< Utilization (%)"]
    pub vcn_activity: [u16; 4usize],
    #[doc = "!< Clock Lock Status. Each bit corresponds to clock instance"]
    pub gfxclk_lock_status: u32,
    #[doc = "!< XGMI bus width in GB/s"]
    pub xgmi_link_width: u16,
    #[doc = "!< XGMI bus bitrate in GB/s"]
    pub xgmi_link_speed: u16,
    #[doc = "!< PCIE accumulated bandwidth (GB/sec)"]
    pub pcie_bandwidth_acc: u64,
    #[doc = "!< PCIE instantaneous bandwidth (GB/sec)"]
    pub pcie_bandwidth_inst: u64,
    #[doc = "!< PCIE L0 to recovery state transition accumulated count"]
    pub pcie_l0_to_recov_count_acc: u64,
    #[doc = "!< PCIE replay accumulated count"]
    pub pcie_replay_count_acc: u64,
    #[doc = "!< PCIE replay rollover accumulated count"]
    pub pcie_replay_rover_count_acc: u64,
    #[doc = "!< In KB"]
    pub xgmi_read_data_acc: [u64; 8usize],
    #[doc = "!< In KB"]
    pub xgmi_write_data_acc: [u64; 8usize],
    #[doc = "!< In KB"]
    pub current_gfxclks: [u16; 8usize],
    #[doc = "!< In KB"]
    pub current_socclks: [u16; 4usize],
    #[doc = "!< In KB"]
    pub current_vclk0s: [u16; 4usize],
    #[doc = "!< In KB"]
    pub current_dclk0s: [u16; 4usize],
    #[doc = "!< JPEG activity percent (encode/decode)"]
    pub jpeg_activity: [u16; 32usize],
    #[doc = "!< PCIE NAK sent accumulated count"]
    pub pcie_nak_sent_count_acc: u32,
    #[doc = "!< PCIE NAK received accumulated count"]
    pub pcie_nak_rcvd_count_acc: u32,
    #[doc = "!< Accumulation cycle counter"]
    pub accumulation_counter: u64,
    #[doc = " @brief Accumulated throttler residencies"]
    pub prochot_residency_acc: u64,
    #[doc = " @brief Accumulated throttler residencies\n\n Prochot (thermal) - PPT (power)\n Package Power Tracking (PPT) violation % (greater than 0% is a violation);\n aka PVIOL\n\n Ex. PVIOL/TVIOL calculations\n Where A and B are measurments recorded at prior points in time.\n Typically A is the earlier measured value and B is the latest measured value.\n\n PVIOL % = (PptResidencyAcc (B) - PptResidencyAcc (A)) * 100/ (AccumulationCounter (B) - AccumulationCounter (A))\n TVIOL % = (SocketThmResidencyAcc (B) -  SocketThmResidencyAcc (A)) * 100 / (AccumulationCounter (B) - AccumulationCounter (A))"]
    pub ppt_residency_acc: u64,
    #[doc = " @brief Accumulated throttler residencies\n\n Socket (thermal) -\n Socket thermal violation % (greater than 0% is a violation);\n aka TVIOL\n\n Ex. PVIOL/TVIOL calculations\n Where A and B are measurments recorded at prior points in time.\n Typically A is the earlier measured value and B is the latest measured value.\n\n PVIOL % = (PptResidencyAcc (B) - PptResidencyAcc (A)) * 100/ (AccumulationCounter (B) - AccumulationCounter (A))\n TVIOL % = (SocketThmResidencyAcc (B) -  SocketThmResidencyAcc (A)) * 100 / (AccumulationCounter (B) - AccumulationCounter (A))"]
    pub socket_thm_residency_acc: u64,
    pub vr_thm_residency_acc: u64,
    pub hbm_thm_residency_acc: u64,
    #[doc = "!< Number of current partition"]
    pub num_partition: u16,
    #[doc = "!< XCP (Graphic Cluster Partitions) metrics stats"]
    pub xcp_stats: [amdsmi_gpu_xcp_metrics_t; 8usize],
    #[doc = "!< PCIE other end recovery counter"]
    pub pcie_lc_perf_other_end_recovery: u32,
    #[doc = "!< VRAM max bandwidth at max memory clock (GB/s)"]
    pub vram_max_bandwidth: u64,
    #[doc = "!< XGMI link status(up/down)"]
    pub xgmi_link_status: [u16; 8usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_gpu_metrics_t"][::std::mem::size_of::<amdsmi_gpu_metrics_t>() - 4544usize];
    ["Alignment of amdsmi_gpu_metrics_t"][::std::mem::align_of::<amdsmi_gpu_metrics_t>() - 8usize];
    ["Offset of field: amdsmi_gpu_metrics_t::common_header"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, common_header) - 0usize];
    ["Offset of field: amdsmi_gpu_metrics_t::temperature_edge"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, temperature_edge) - 4usize];
    ["Offset of field: amdsmi_gpu_metrics_t::temperature_hotspot"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, temperature_hotspot) - 6usize];
    ["Offset of field: amdsmi_gpu_metrics_t::temperature_mem"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, temperature_mem) - 8usize];
    ["Offset of field: amdsmi_gpu_metrics_t::temperature_vrgfx"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, temperature_vrgfx) - 10usize];
    ["Offset of field: amdsmi_gpu_metrics_t::temperature_vrsoc"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, temperature_vrsoc) - 12usize];
    ["Offset of field: amdsmi_gpu_metrics_t::temperature_vrmem"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, temperature_vrmem) - 14usize];
    ["Offset of field: amdsmi_gpu_metrics_t::average_gfx_activity"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, average_gfx_activity) - 16usize];
    ["Offset of field: amdsmi_gpu_metrics_t::average_umc_activity"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, average_umc_activity) - 18usize];
    ["Offset of field: amdsmi_gpu_metrics_t::average_mm_activity"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, average_mm_activity) - 20usize];
    ["Offset of field: amdsmi_gpu_metrics_t::average_socket_power"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, average_socket_power) - 22usize];
    ["Offset of field: amdsmi_gpu_metrics_t::energy_accumulator"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, energy_accumulator) - 24usize];
    ["Offset of field: amdsmi_gpu_metrics_t::system_clock_counter"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, system_clock_counter) - 32usize];
    ["Offset of field: amdsmi_gpu_metrics_t::average_gfxclk_frequency"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, average_gfxclk_frequency) - 40usize];
    ["Offset of field: amdsmi_gpu_metrics_t::average_socclk_frequency"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, average_socclk_frequency) - 42usize];
    ["Offset of field: amdsmi_gpu_metrics_t::average_uclk_frequency"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, average_uclk_frequency) - 44usize];
    ["Offset of field: amdsmi_gpu_metrics_t::average_vclk0_frequency"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, average_vclk0_frequency) - 46usize];
    ["Offset of field: amdsmi_gpu_metrics_t::average_dclk0_frequency"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, average_dclk0_frequency) - 48usize];
    ["Offset of field: amdsmi_gpu_metrics_t::average_vclk1_frequency"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, average_vclk1_frequency) - 50usize];
    ["Offset of field: amdsmi_gpu_metrics_t::average_dclk1_frequency"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, average_dclk1_frequency) - 52usize];
    ["Offset of field: amdsmi_gpu_metrics_t::current_gfxclk"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, current_gfxclk) - 54usize];
    ["Offset of field: amdsmi_gpu_metrics_t::current_socclk"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, current_socclk) - 56usize];
    ["Offset of field: amdsmi_gpu_metrics_t::current_uclk"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, current_uclk) - 58usize];
    ["Offset of field: amdsmi_gpu_metrics_t::current_vclk0"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, current_vclk0) - 60usize];
    ["Offset of field: amdsmi_gpu_metrics_t::current_dclk0"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, current_dclk0) - 62usize];
    ["Offset of field: amdsmi_gpu_metrics_t::current_vclk1"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, current_vclk1) - 64usize];
    ["Offset of field: amdsmi_gpu_metrics_t::current_dclk1"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, current_dclk1) - 66usize];
    ["Offset of field: amdsmi_gpu_metrics_t::throttle_status"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, throttle_status) - 68usize];
    ["Offset of field: amdsmi_gpu_metrics_t::current_fan_speed"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, current_fan_speed) - 72usize];
    ["Offset of field: amdsmi_gpu_metrics_t::pcie_link_width"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, pcie_link_width) - 74usize];
    ["Offset of field: amdsmi_gpu_metrics_t::pcie_link_speed"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, pcie_link_speed) - 76usize];
    ["Offset of field: amdsmi_gpu_metrics_t::gfx_activity_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, gfx_activity_acc) - 80usize];
    ["Offset of field: amdsmi_gpu_metrics_t::mem_activity_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, mem_activity_acc) - 84usize];
    ["Offset of field: amdsmi_gpu_metrics_t::temperature_hbm"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, temperature_hbm) - 88usize];
    ["Offset of field: amdsmi_gpu_metrics_t::firmware_timestamp"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, firmware_timestamp) - 96usize];
    ["Offset of field: amdsmi_gpu_metrics_t::voltage_soc"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, voltage_soc) - 104usize];
    ["Offset of field: amdsmi_gpu_metrics_t::voltage_gfx"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, voltage_gfx) - 106usize];
    ["Offset of field: amdsmi_gpu_metrics_t::voltage_mem"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, voltage_mem) - 108usize];
    ["Offset of field: amdsmi_gpu_metrics_t::indep_throttle_status"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, indep_throttle_status) - 112usize];
    ["Offset of field: amdsmi_gpu_metrics_t::current_socket_power"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, current_socket_power) - 120usize];
    ["Offset of field: amdsmi_gpu_metrics_t::vcn_activity"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, vcn_activity) - 122usize];
    ["Offset of field: amdsmi_gpu_metrics_t::gfxclk_lock_status"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, gfxclk_lock_status) - 132usize];
    ["Offset of field: amdsmi_gpu_metrics_t::xgmi_link_width"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, xgmi_link_width) - 136usize];
    ["Offset of field: amdsmi_gpu_metrics_t::xgmi_link_speed"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, xgmi_link_speed) - 138usize];
    ["Offset of field: amdsmi_gpu_metrics_t::pcie_bandwidth_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, pcie_bandwidth_acc) - 144usize];
    ["Offset of field: amdsmi_gpu_metrics_t::pcie_bandwidth_inst"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, pcie_bandwidth_inst) - 152usize];
    ["Offset of field: amdsmi_gpu_metrics_t::pcie_l0_to_recov_count_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, pcie_l0_to_recov_count_acc) - 160usize];
    ["Offset of field: amdsmi_gpu_metrics_t::pcie_replay_count_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, pcie_replay_count_acc) - 168usize];
    ["Offset of field: amdsmi_gpu_metrics_t::pcie_replay_rover_count_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, pcie_replay_rover_count_acc) - 176usize];
    ["Offset of field: amdsmi_gpu_metrics_t::xgmi_read_data_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, xgmi_read_data_acc) - 184usize];
    ["Offset of field: amdsmi_gpu_metrics_t::xgmi_write_data_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, xgmi_write_data_acc) - 248usize];
    ["Offset of field: amdsmi_gpu_metrics_t::current_gfxclks"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, current_gfxclks) - 312usize];
    ["Offset of field: amdsmi_gpu_metrics_t::current_socclks"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, current_socclks) - 328usize];
    ["Offset of field: amdsmi_gpu_metrics_t::current_vclk0s"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, current_vclk0s) - 336usize];
    ["Offset of field: amdsmi_gpu_metrics_t::current_dclk0s"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, current_dclk0s) - 344usize];
    ["Offset of field: amdsmi_gpu_metrics_t::jpeg_activity"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, jpeg_activity) - 352usize];
    ["Offset of field: amdsmi_gpu_metrics_t::pcie_nak_sent_count_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, pcie_nak_sent_count_acc) - 416usize];
    ["Offset of field: amdsmi_gpu_metrics_t::pcie_nak_rcvd_count_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, pcie_nak_rcvd_count_acc) - 420usize];
    ["Offset of field: amdsmi_gpu_metrics_t::accumulation_counter"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, accumulation_counter) - 424usize];
    ["Offset of field: amdsmi_gpu_metrics_t::prochot_residency_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, prochot_residency_acc) - 432usize];
    ["Offset of field: amdsmi_gpu_metrics_t::ppt_residency_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, ppt_residency_acc) - 440usize];
    ["Offset of field: amdsmi_gpu_metrics_t::socket_thm_residency_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, socket_thm_residency_acc) - 448usize];
    ["Offset of field: amdsmi_gpu_metrics_t::vr_thm_residency_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, vr_thm_residency_acc) - 456usize];
    ["Offset of field: amdsmi_gpu_metrics_t::hbm_thm_residency_acc"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, hbm_thm_residency_acc) - 464usize];
    ["Offset of field: amdsmi_gpu_metrics_t::num_partition"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, num_partition) - 472usize];
    ["Offset of field: amdsmi_gpu_metrics_t::xcp_stats"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, xcp_stats) - 480usize];
    ["Offset of field: amdsmi_gpu_metrics_t::pcie_lc_perf_other_end_recovery"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, pcie_lc_perf_other_end_recovery) - 4512usize];
    ["Offset of field: amdsmi_gpu_metrics_t::vram_max_bandwidth"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, vram_max_bandwidth) - 4520usize];
    ["Offset of field: amdsmi_gpu_metrics_t::xgmi_link_status"]
        [::std::mem::offset_of!(amdsmi_gpu_metrics_t, xgmi_link_status) - 4528usize];
};
#[doc = "!< XGMI link status is down"]
pub const amdsmi_xgmi_link_status_type_t_AMDSMI_XGMI_LINK_DOWN: amdsmi_xgmi_link_status_type_t = 0;
#[doc = "!< XGMI link status is up"]
pub const amdsmi_xgmi_link_status_type_t_AMDSMI_XGMI_LINK_UP: amdsmi_xgmi_link_status_type_t = 1;
#[doc = "!< XGMI link status is disabled"]
pub const amdsmi_xgmi_link_status_type_t_AMDSMI_XGMI_LINK_DISABLE: amdsmi_xgmi_link_status_type_t = 2;
#[doc = " @brief XGMI Link Status Type\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_xgmi_link_status_type_t = ::std::os::raw::c_uint;
#[doc = " @brief XGMI Link Status\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_xgmi_link_status_t {
    #[doc = "!< The total links in the status array"]
    pub total_links: u32,
    pub status: [amdsmi_xgmi_link_status_type_t; 8usize],
    pub reserved: [u64; 7usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_xgmi_link_status_t"][::std::mem::size_of::<amdsmi_xgmi_link_status_t>() - 96usize];
    ["Alignment of amdsmi_xgmi_link_status_t"][::std::mem::align_of::<amdsmi_xgmi_link_status_t>() - 8usize];
    ["Offset of field: amdsmi_xgmi_link_status_t::total_links"]
        [::std::mem::offset_of!(amdsmi_xgmi_link_status_t, total_links) - 0usize];
    ["Offset of field: amdsmi_xgmi_link_status_t::status"]
        [::std::mem::offset_of!(amdsmi_xgmi_link_status_t, status) - 4usize];
    ["Offset of field: amdsmi_xgmi_link_status_t::reserved"]
        [::std::mem::offset_of!(amdsmi_xgmi_link_status_t, reserved) - 40usize];
};
#[doc = " @brief This structure holds the name value pairs\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_name_value_t {
    #[doc = "!< Name"]
    pub name: [::std::os::raw::c_char; 256usize],
    #[doc = "!< Use uint64_t to make it universal"]
    pub value: u64,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_name_value_t"][::std::mem::size_of::<amdsmi_name_value_t>() - 264usize];
    ["Alignment of amdsmi_name_value_t"][::std::mem::align_of::<amdsmi_name_value_t>() - 8usize];
    ["Offset of field: amdsmi_name_value_t::name"][::std::mem::offset_of!(amdsmi_name_value_t, name) - 0usize];
    ["Offset of field: amdsmi_name_value_t::value"][::std::mem::offset_of!(amdsmi_name_value_t, value) - 256usize];
};
#[doc = "!< XGMI registers"]
pub const amdsmi_reg_type_t_AMDSMI_REG_XGMI: amdsmi_reg_type_t = 0;
#[doc = "!< WAFL registers"]
pub const amdsmi_reg_type_t_AMDSMI_REG_WAFL: amdsmi_reg_type_t = 1;
#[doc = "!< PCIe registers"]
pub const amdsmi_reg_type_t_AMDSMI_REG_PCIE: amdsmi_reg_type_t = 2;
#[doc = "!< Usr registers"]
pub const amdsmi_reg_type_t_AMDSMI_REG_USR: amdsmi_reg_type_t = 3;
#[doc = "!< Usr1 registers"]
pub const amdsmi_reg_type_t_AMDSMI_REG_USR1: amdsmi_reg_type_t = 4;
#[doc = " @brief This register type for register table\n\n @cond @tag{gpu_bm_linux} @endcond"]
pub type amdsmi_reg_type_t = ::std::os::raw::c_uint;
#[doc = " @brief This structure holds ras feature\n\n @cond @tag{gpu_bm_linux} @platform{guest_windows} @tag{host} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_ras_feature_t {
    #[doc = "< PARITY error(bit 0), Single Bit correctable (bit1),\nDouble bit error detection (bit2), Poison (bit 3)."]
    pub ras_eeprom_version: u32,
    #[doc = "< ecc_correction_schema mask.\nPARITY error(bit 0), Single Bit correctable (bit1),\nDouble bit error detection (bit2), Poison (bit 3)"]
    pub ecc_correction_schema_flag: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_ras_feature_t"][::std::mem::size_of::<amdsmi_ras_feature_t>() - 8usize];
    ["Alignment of amdsmi_ras_feature_t"][::std::mem::align_of::<amdsmi_ras_feature_t>() - 4usize];
    ["Offset of field: amdsmi_ras_feature_t::ras_eeprom_version"]
        [::std::mem::offset_of!(amdsmi_ras_feature_t, ras_eeprom_version) - 0usize];
    ["Offset of field: amdsmi_ras_feature_t::ecc_correction_schema_flag"]
        [::std::mem::offset_of!(amdsmi_ras_feature_t, ecc_correction_schema_flag) - 4usize];
};
#[doc = " @brief This structure holds error counts.\n\n @cond @tag{gpu_bm_linux} @tag{guest_windows} @tag{host} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_error_count_t {
    #[doc = "!< Accumulated correctable errors"]
    pub correctable_count: u64,
    #[doc = "!< Accumulated uncorrectable errors"]
    pub uncorrectable_count: u64,
    #[doc = "!< Accumulated deferred errors"]
    pub deferred_count: u64,
    pub reserved: [u64; 5usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_error_count_t"][::std::mem::size_of::<amdsmi_error_count_t>() - 64usize];
    ["Alignment of amdsmi_error_count_t"][::std::mem::align_of::<amdsmi_error_count_t>() - 8usize];
    ["Offset of field: amdsmi_error_count_t::correctable_count"]
        [::std::mem::offset_of!(amdsmi_error_count_t, correctable_count) - 0usize];
    ["Offset of field: amdsmi_error_count_t::uncorrectable_count"]
        [::std::mem::offset_of!(amdsmi_error_count_t, uncorrectable_count) - 8usize];
    ["Offset of field: amdsmi_error_count_t::deferred_count"]
        [::std::mem::offset_of!(amdsmi_error_count_t, deferred_count) - 16usize];
    ["Offset of field: amdsmi_error_count_t::reserved"]
        [::std::mem::offset_of!(amdsmi_error_count_t, reserved) - 24usize];
};
#[doc = " @brief This structure contains information specific to a process.\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_process_info_t {
    #[doc = "!< Process ID"]
    pub process_id: u32,
    #[doc = "!< VRAM usage in MB"]
    pub vram_usage: u64,
    #[doc = "!< SDMA usage in microseconds"]
    pub sdma_usage: u64,
    #[doc = "!< Compute Unit usage in percent"]
    pub cu_occupancy: u32,
    #[doc = "!< Time that queues are evicted on a GPU in milliseconds"]
    pub evicted_time: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_process_info_t"][::std::mem::size_of::<amdsmi_process_info_t>() - 32usize];
    ["Alignment of amdsmi_process_info_t"][::std::mem::align_of::<amdsmi_process_info_t>() - 8usize];
    ["Offset of field: amdsmi_process_info_t::process_id"]
        [::std::mem::offset_of!(amdsmi_process_info_t, process_id) - 0usize];
    ["Offset of field: amdsmi_process_info_t::vram_usage"]
        [::std::mem::offset_of!(amdsmi_process_info_t, vram_usage) - 8usize];
    ["Offset of field: amdsmi_process_info_t::sdma_usage"]
        [::std::mem::offset_of!(amdsmi_process_info_t, sdma_usage) - 16usize];
    ["Offset of field: amdsmi_process_info_t::cu_occupancy"]
        [::std::mem::offset_of!(amdsmi_process_info_t, cu_occupancy) - 24usize];
    ["Offset of field: amdsmi_process_info_t::evicted_time"]
        [::std::mem::offset_of!(amdsmi_process_info_t, evicted_time) - 28usize];
};
#[doc = " @brief Topology Nearest\n\n @cond @tag{gpu_bm_linux} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_topology_nearest_t {
    pub count: u32,
    pub processor_list: [amdsmi_processor_handle; 256usize],
    pub reserved: [u64; 15usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_topology_nearest_t"][::std::mem::size_of::<amdsmi_topology_nearest_t>() - 2176usize];
    ["Alignment of amdsmi_topology_nearest_t"][::std::mem::align_of::<amdsmi_topology_nearest_t>() - 8usize];
    ["Offset of field: amdsmi_topology_nearest_t::count"]
        [::std::mem::offset_of!(amdsmi_topology_nearest_t, count) - 0usize];
    ["Offset of field: amdsmi_topology_nearest_t::processor_list"]
        [::std::mem::offset_of!(amdsmi_topology_nearest_t, processor_list) - 8usize];
    ["Offset of field: amdsmi_topology_nearest_t::reserved"]
        [::std::mem::offset_of!(amdsmi_topology_nearest_t, reserved) - 2056usize];
};
#[doc = "!< Unknown Virtualization Mode"]
pub const amdsmi_virtualization_mode_t_AMDSMI_VIRTUALIZATION_MODE_UNKNOWN: amdsmi_virtualization_mode_t = 0;
#[doc = "!< Baremetal Virtualization Mode"]
pub const amdsmi_virtualization_mode_t_AMDSMI_VIRTUALIZATION_MODE_BAREMETAL: amdsmi_virtualization_mode_t = 1;
#[doc = "!< Host Virtualization Mode"]
pub const amdsmi_virtualization_mode_t_AMDSMI_VIRTUALIZATION_MODE_HOST: amdsmi_virtualization_mode_t = 2;
#[doc = "!< Guest Virtualization Mode"]
pub const amdsmi_virtualization_mode_t_AMDSMI_VIRTUALIZATION_MODE_GUEST: amdsmi_virtualization_mode_t = 3;
#[doc = "!< Passthrough Virtualization Mode"]
pub const amdsmi_virtualization_mode_t_AMDSMI_VIRTUALIZATION_MODE_PASSTHROUGH: amdsmi_virtualization_mode_t = 4;
#[doc = " @brief Variant placeholder\n\n Place-holder \"variant\" for functions that have don't have any variants,\n but do have monitors or sensors.\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
pub type amdsmi_virtualization_mode_t = ::std::os::raw::c_uint;
#[doc = "!< Memory affinity as numa node"]
pub const amdsmi_affinity_scope_t_AMDSMI_AFFINITY_SCOPE_NODE: amdsmi_affinity_scope_t = 0;
#[doc = "!< socket affinity"]
pub const amdsmi_affinity_scope_t_AMDSMI_AFFINITY_SCOPE_SOCKET: amdsmi_affinity_scope_t = 1;
#[doc = " @brief Scope for Numa affinity or Socket affinity\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
pub type amdsmi_affinity_scope_t = ::std::os::raw::c_uint;
pub const amdsmi_npm_status_t_AMDSMI_NPM_STATUS_DISABLED: amdsmi_npm_status_t = 0;
pub const amdsmi_npm_status_t_AMDSMI_NPM_STATUS_ENABLED: amdsmi_npm_status_t = 1;
#[doc = " @brief NPM status\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
pub type amdsmi_npm_status_t = ::std::os::raw::c_uint;
#[doc = " @brief NPM info\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_npm_info_t {
    #[doc = "!< NPM status (enabled/disabled)."]
    pub status: amdsmi_npm_status_t,
    #[doc = "!< Node-level power limit in Watts."]
    pub limit: u64,
    pub reserved: [u64; 6usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_npm_info_t"][::std::mem::size_of::<amdsmi_npm_info_t>() - 64usize];
    ["Alignment of amdsmi_npm_info_t"][::std::mem::align_of::<amdsmi_npm_info_t>() - 8usize];
    ["Offset of field: amdsmi_npm_info_t::status"][::std::mem::offset_of!(amdsmi_npm_info_t, status) - 0usize];
    ["Offset of field: amdsmi_npm_info_t::limit"][::std::mem::offset_of!(amdsmi_npm_info_t, limit) - 8usize];
    ["Offset of field: amdsmi_npm_info_t::reserved"][::std::mem::offset_of!(amdsmi_npm_info_t, reserved) - 16usize];
};
#[doc = " @brief cpu socket info data\n\n @cond @tag{cpu_bm} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_sock_info_t {
    pub socket_id: u32,
    pub cores_per_socket: u32,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_sock_info_t"][::std::mem::size_of::<amdsmi_sock_info_t>() - 8usize];
    ["Alignment of amdsmi_sock_info_t"][::std::mem::align_of::<amdsmi_sock_info_t>() - 4usize];
    ["Offset of field: amdsmi_sock_info_t::socket_id"][::std::mem::offset_of!(amdsmi_sock_info_t, socket_id) - 0usize];
    ["Offset of field: amdsmi_sock_info_t::cores_per_socket"]
        [::std::mem::offset_of!(amdsmi_sock_info_t, cores_per_socket) - 4usize];
};
#[doc = " @brief Cper\n\n @cond @tag{gpu_bm_linux} @tag{host} @endcond"]
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_cper_guid_t {
    pub b: [::std::os::raw::c_uchar; 16usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_cper_guid_t"][::std::mem::size_of::<amdsmi_cper_guid_t>() - 16usize];
    ["Alignment of amdsmi_cper_guid_t"][::std::mem::align_of::<amdsmi_cper_guid_t>() - 1usize];
    ["Offset of field: amdsmi_cper_guid_t::b"][::std::mem::offset_of!(amdsmi_cper_guid_t, b) - 0usize];
};
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_cper_timestamp_t {
    pub seconds: u8,
    pub minutes: u8,
    pub hours: u8,
    pub flag: u8,
    pub day: u8,
    pub month: u8,
    pub year: u8,
    pub century: u8,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_cper_timestamp_t"][::std::mem::size_of::<amdsmi_cper_timestamp_t>() - 8usize];
    ["Alignment of amdsmi_cper_timestamp_t"][::std::mem::align_of::<amdsmi_cper_timestamp_t>() - 1usize];
    ["Offset of field: amdsmi_cper_timestamp_t::seconds"]
        [::std::mem::offset_of!(amdsmi_cper_timestamp_t, seconds) - 0usize];
    ["Offset of field: amdsmi_cper_timestamp_t::minutes"]
        [::std::mem::offset_of!(amdsmi_cper_timestamp_t, minutes) - 1usize];
    ["Offset of field: amdsmi_cper_timestamp_t::hours"]
        [::std::mem::offset_of!(amdsmi_cper_timestamp_t, hours) - 2usize];
    ["Offset of field: amdsmi_cper_timestamp_t::flag"][::std::mem::offset_of!(amdsmi_cper_timestamp_t, flag) - 3usize];
    ["Offset of field: amdsmi_cper_timestamp_t::day"][::std::mem::offset_of!(amdsmi_cper_timestamp_t, day) - 4usize];
    ["Offset of field: amdsmi_cper_timestamp_t::month"]
        [::std::mem::offset_of!(amdsmi_cper_timestamp_t, month) - 5usize];
    ["Offset of field: amdsmi_cper_timestamp_t::year"][::std::mem::offset_of!(amdsmi_cper_timestamp_t, year) - 6usize];
    ["Offset of field: amdsmi_cper_timestamp_t::century"]
        [::std::mem::offset_of!(amdsmi_cper_timestamp_t, century) - 7usize];
};
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub union amdsmi_cper_valid_bits_t {
    pub valid_bits: amdsmi_cper_valid_bits_t_valid_bits_,
    pub valid_mask: u32,
}
#[repr(C)]
#[derive(Debug, Copy, Clone)]
pub struct amdsmi_cper_valid_bits_t_valid_bits_ {
    pub _bitfield_align_1: [u8; 0],
    pub _bitfield_1: __BindgenBitfieldUnit<[u8; 4usize]>,
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_cper_valid_bits_t_valid_bits_"]
        [::std::mem::size_of::<amdsmi_cper_valid_bits_t_valid_bits_>() - 4usize];
    ["Alignment of amdsmi_cper_valid_bits_t_valid_bits_"]
        [::std::mem::align_of::<amdsmi_cper_valid_bits_t_valid_bits_>() - 1usize];
};
impl amdsmi_cper_valid_bits_t_valid_bits_ {
    #[inline]
    pub fn platform_id(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(0usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_platform_id(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(0usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn platform_id_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                0usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_platform_id_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                0usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn timestamp(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(1usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_timestamp(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(1usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn timestamp_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                1usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_timestamp_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                1usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn partition_id(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(2usize, 1u8) as u32) }
    }
    #[inline]
    pub fn set_partition_id(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(2usize, 1u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn partition_id_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                2usize,
                1u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_partition_id_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                2usize,
                1u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn reserved(&self) -> u32 {
        unsafe { ::std::mem::transmute(self._bitfield_1.get(3usize, 29u8) as u32) }
    }
    #[inline]
    pub fn set_reserved(&mut self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            self._bitfield_1.set(3usize, 29u8, val as u64)
        }
    }
    #[inline]
    pub unsafe fn reserved_raw(this: *const Self) -> u32 {
        unsafe {
            ::std::mem::transmute(<__BindgenBitfieldUnit<[u8; 4usize]>>::raw_get(
                ::std::ptr::addr_of!((*this)._bitfield_1),
                3usize,
                29u8,
            ) as u32)
        }
    }
    #[inline]
    pub unsafe fn set_reserved_raw(this: *mut Self, val: u32) {
        unsafe {
            let val: u32 = ::std::mem::transmute(val);
            <__BindgenBitfieldUnit<[u8; 4usize]>>::raw_set(
                ::std::ptr::addr_of_mut!((*this)._bitfield_1),
                3usize,
                29u8,
                val as u64,
            )
        }
    }
    #[inline]
    pub fn new_bitfield_1(
        platform_id: u32,
        timestamp: u32,
        partition_id: u32,
        reserved: u32,
    ) -> __BindgenBitfieldUnit<[u8; 4usize]> {
        let mut __bindgen_bitfield_unit: __BindgenBitfieldUnit<[u8; 4usize]> = Default::default();
        __bindgen_bitfield_unit.set(0usize, 1u8, {
            let platform_id: u32 = unsafe { ::std::mem::transmute(platform_id) };
            platform_id as u64
        });
        __bindgen_bitfield_unit.set(1usize, 1u8, {
            let timestamp: u32 = unsafe { ::std::mem::transmute(timestamp) };
            timestamp as u64
        });
        __bindgen_bitfield_unit.set(2usize, 1u8, {
            let partition_id: u32 = unsafe { ::std::mem::transmute(partition_id) };
            partition_id as u64
        });
        __bindgen_bitfield_unit.set(3usize, 29u8, {
            let reserved: u32 = unsafe { ::std::mem::transmute(reserved) };
            reserved as u64
        });
        __bindgen_bitfield_unit
    }
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_cper_valid_bits_t"][::std::mem::size_of::<amdsmi_cper_valid_bits_t>() - 4usize];
    ["Alignment of amdsmi_cper_valid_bits_t"][::std::mem::align_of::<amdsmi_cper_valid_bits_t>() - 1usize];
    ["Offset of field: amdsmi_cper_valid_bits_t::valid_bits"]
        [::std::mem::offset_of!(amdsmi_cper_valid_bits_t, valid_bits) - 0usize];
    ["Offset of field: amdsmi_cper_valid_bits_t::valid_mask"]
        [::std::mem::offset_of!(amdsmi_cper_valid_bits_t, valid_mask) - 0usize];
};
#[repr(C, packed)]
#[derive(Copy, Clone)]
pub struct amdsmi_cper_hdr_t {
    #[doc = "!< \"CPER\""]
    pub signature: [::std::os::raw::c_char; 4usize],
    pub revision: u16,
    #[doc = "!< 0xFFFFFFFF"]
    pub signature_end: u32,
    pub sec_cnt: u16,
    pub error_severity: amdsmi_cper_sev_t,
    pub cper_valid_bits: amdsmi_cper_valid_bits_t,
    #[doc = "!< Total size of CPER Entry"]
    pub record_length: u32,
    pub timestamp: amdsmi_cper_timestamp_t,
    pub platform_id: [::std::os::raw::c_char; 16usize],
    #[doc = "!< Reserved"]
    pub partition_id: amdsmi_cper_guid_t,
    pub creator_id: [::std::os::raw::c_char; 16usize],
    #[doc = "!< CMC, MCE, can use amdsmi_cper_notifiy_type_t to decode"]
    pub notify_type: amdsmi_cper_guid_t,
    #[doc = "!< Unique CPER Entry ID"]
    pub record_id: [::std::os::raw::c_char; 8usize],
    #[doc = "!< Reserved"]
    pub flags: u32,
    #[doc = "!< Reserved"]
    pub persistence_info: u64,
    #[doc = "!< Reserved"]
    pub reserved: [u8; 12usize],
}
#[allow(clippy::unnecessary_operation, clippy::identity_op)]
const _: () = {
    ["Size of amdsmi_cper_hdr_t"][::std::mem::size_of::<amdsmi_cper_hdr_t>() - 128usize];
    ["Alignment of amdsmi_cper_hdr_t"][::std::mem::align_of::<amdsmi_cper_hdr_t>() - 1usize];
    ["Offset of field: amdsmi_cper_hdr_t::signature"][::std::mem::offset_of!(amdsmi_cper_hdr_t, signature) - 0usize];
    ["Offset of field: amdsmi_cper_hdr_t::revision"][::std::mem::offset_of!(amdsmi_cper_hdr_t, revision) - 4usize];
    ["Offset of field: amdsmi_cper_hdr_t::signature_end"]
        [::std::mem::offset_of!(amdsmi_cper_hdr_t, signature_end) - 6usize];
    ["Offset of field: amdsmi_cper_hdr_t::sec_cnt"][::std::mem::offset_of!(amdsmi_cper_hdr_t, sec_cnt) - 10usize];
    ["Offset of field: amdsmi_cper_hdr_t::error_severity"]
        [::std::mem::offset_of!(amdsmi_cper_hdr_t, error_severity) - 12usize];
    ["Offset of field: amdsmi_cper_hdr_t::cper_valid_bits"]
        [::std::mem::offset_of!(amdsmi_cper_hdr_t, cper_valid_bits) - 16usize];
    ["Offset of field: amdsmi_cper_hdr_t::record_length"]
        [::std::mem::offset_of!(amdsmi_cper_hdr_t, record_length) - 20usize];
    ["Offset of field: amdsmi_cper_hdr_t::timestamp"][::std::mem::offset_of!(amdsmi_cper_hdr_t, timestamp) - 24usize];
    ["Offset of field: amdsmi_cper_hdr_t::platform_id"]
        [::std::mem::offset_of!(amdsmi_cper_hdr_t, platform_id) - 32usize];
    ["Offset of field: amdsmi_cper_hdr_t::partition_id"]
        [::std::mem::offset_of!(amdsmi_cper_hdr_t, partition_id) - 48usize];
    ["Offset of field: amdsmi_cper_hdr_t::creator_id"][::std::mem::offset_of!(amdsmi_cper_hdr_t, creator_id) - 64usize];
    ["Offset of field: amdsmi_cper_hdr_t::notify_type"]
        [::std::mem::offset_of!(amdsmi_cper_hdr_t, notify_type) - 80usize];
    ["Offset of field: amdsmi_cper_hdr_t::record_id"][::std::mem::offset_of!(amdsmi_cper_hdr_t, record_id) - 96usize];
    ["Offset of field: amdsmi_cper_hdr_t::flags"][::std::mem::offset_of!(amdsmi_cper_hdr_t, flags) - 104usize];
    ["Offset of field: amdsmi_cper_hdr_t::persistence_info"]
        [::std::mem::offset_of!(amdsmi_cper_hdr_t, persistence_info) - 108usize];
    ["Offset of field: amdsmi_cper_hdr_t::reserved"][::std::mem::offset_of!(amdsmi_cper_hdr_t, reserved) - 116usize];
};
pub struct libamd_smi {
    __library: ::libloading::Library,
    pub __ctype_get_mb_cur_max: Result<unsafe extern "C" fn() -> usize, ::libloading::Error>,
    pub atof: Result<unsafe extern "C" fn(__nptr: *const ::std::os::raw::c_char) -> f64, ::libloading::Error>,
    pub atoi: Result<
        unsafe extern "C" fn(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_int,
        ::libloading::Error,
    >,
    pub atol: Result<
        unsafe extern "C" fn(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_long,
        ::libloading::Error,
    >,
    pub atoll: Result<
        unsafe extern "C" fn(__nptr: *const ::std::os::raw::c_char) -> ::std::os::raw::c_longlong,
        ::libloading::Error,
    >,
    pub strtod: Result<
        unsafe extern "C" fn(__nptr: *const ::std::os::raw::c_char, __endptr: *mut *mut ::std::os::raw::c_char) -> f64,
